[{"item_id": 21091234, "text": "For many years I had imposter syndrome because I couldn&#x27;t read papers.<p>It took a lot of work to extract any information from a paper; I had to spend hours reading it.  I was always impressed at folks who could just glance at a single figure, without referring to the methods, and could glean what the paper was trying to say.<p>However, after working through enough papers and replicating the results of the authors, I came to learn a number of things- 1) papers are just written badly and it&#x27;s not beacuse the authors are smart.  It&#x27;s beacuse the authors are bad writers.  2) most papers- in bio, I&#x27;d say about 90%- contain invalidating errors which mean that the figures and conclusions are worthless.   It takes skilled readers to uncover methodological flaws (or infer them, as often not all the details are included).<p>After working in bio for a while, it was nice to be in ML because - at least it seemed- I could replicate most papers by downloading the github repo, training on my local GPU for a few days, and then using the trained model to make the same predictions as the papers.  Then I realized- in most cases, what was being claimed was far more than what the trained model was actually capable of doing.<p>Now I stick to well-trod engineering literature that most people consider boring.  In nearly all cases I can read the lit, repro the work, and get results that make sense (much of my work is ensuring that published benchmarks are reproducible).<p>The advice here is golden.", "by": "dekhn"}, {"item_id": 21089229, "text": "I am editing a paper now where I am removing a lot of non-jargon statements and replacing them with jargon. The reviewers were not pleased.<p>As other commenters have noted, plain english is imprecise. When communicating with other scientists in the field it is often necessary to use language that conveys an exact meaning within their pre-existing body of knowledge.<p>If the audience is people without this knowledge, the precise meanings are useless and can be ignored and rigorous quantifcations are often unimportant. However, this is frustrating to scientists who are then left wondering which of n different definitions of some property&#x2F;parameter you are using and how this influences results. This is critical knowledge when internalizing and applying new information.<p>I am also adding in many &quot;over-elaborations&quot; because the reviewer had questions that a simple adjective or two would have answered. A paper absolutely ~is~ a dialog with potential questions, and nothing illustrates this more than peer review.<p>The two audiences require different papers, and peer reviewers tend to fall only into one of them.", "by": "blix"}, {"item_id": 21087953, "text": "This looks pretty good mostly, but I&#x27;d emphasize more that the most important thing is to be understood. When it comes to a difficult mathematical concept, this is actually really really hard. If you can nail that, then worry about stylistic stuff, but you probably didn&#x27;t nail it.<p>With that in mind, this advice is really problematic:<p>&gt; Try to avoid jargon, buzzwords or overly technical language. And don’t use the same word repeatedly — it’s boring.<p>Boring is better than incorrect! I love when authors clearly define a term and use it over and over, because I know exactly what they mean every time. Jargon may be necessary to communicate precisely (but define your jargon, avoid assuming it&#x27;s familiar). E.g. mathematically, there is a difference between a ball and a sphere. And if your L2 ball becomes an L2 balloon in the middle of a proof, readers will be very confused.<p>Also, this is just dead wrong:<p>&gt; Avoid placing equations in the middle of sentences. Mathematics is not the same as English, and we shouldn’t pretend it is.<p>I can see this being useful advice when a proof is full of dense lines of inequalities, but the reasoning is still incorrect. Mathematical notation is nothing more nor less than shorthand for English (or any other language). The following is fine for example: If f(x) &gt;= 1, then either x = 0 or x \\in [1,2]. So is this: Noting that x &lt; 5, Pr[f(y) + x &gt;= 3] &lt;= 0.1. Perfectly grammatical.", "by": "bo1024"}, {"item_id": 21087899, "text": "One of my PhD classes was a paper reading seminar that spanned most of the history of modern molecular biology, from 1959 to the present. It was starkly apparent how much worse the writing quality became around the mid-1980s and beyond. Compare the classic [“genetic code” paper by Francis Crick](<a href=\"https:&#x2F;&#x2F;moscow.sci-hub.tw&#x2F;1024&#x2F;2cfa4b970e4a1fd816ee18afa95aae98&#x2F;crick1961.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;moscow.sci-hub.tw&#x2F;1024&#x2F;2cfa4b970e4a1fd816ee18afa95aa...</a>) with most modern papers<p>More science authors should read writing advice like this.", "by": "suchire"}, {"item_id": 21087921, "text": "I&#x27;m happy Cormac does this work. I&#x27;m even happier that he pointed out a few rules to break. This time invested to improve science writing by one of our greatest living writers is a friendly&#x2F;magnanimous gesture from a discipline that is on the rocks. I&#x27;m not sure if Cormac teaches out of necessity or the goodness of his heart, but count me even more despondent if he needs the salary despite his commercial and critical success.<p>Nothing can single-handedly fix scientific (or technical, or academic) writing. Reading your own writing like a stranger is harder than reading your own code like a stranger. Aside from a few polymaths, the best technical&#x2F;science writing takes careful, understanding partnerships.<p>That said, I think the bigger problem for science writing is how miserably disconnected pop-press coverage is from what is morally justifiable given the research design and results. Some of this is the fault of the scientists (and their reviewers), who don&#x27;t always appear to see the limitations of their own results. More often, it seems to be about poorly-paid writers churning out clickbait from journal articles.<p>Unless (or until) we see fit to ensure our scientists (and inventors, and developers, and economists, ...) are polymaths capable of communicating their work lucidly, I think there&#x27;s a lot of forsaken social value.<p>If it&#x27;s worth giving a grant to study or build something, it&#x27;s worth bolting a communication budget onto (not into) the grant to make sure the work is understood.", "by": "abathur"}, {"item_id": 21088287, "text": "For a slightly more lofty version, see Orwell&#x27;s &#x27;Politics and the English Language&#x27;[1], and in particular its six rules:<p>i. Never use a metaphor, simile, or other figure of speech which you are used to seeing in print.<p>ii. Never use a long word where a short one will do.<p>iii. If it is possible to cut a word out, always cut it out.<p>iv. Never use the passive where you can use the active.<p>v. Never use a foreign phrase, a scientific word, or a jargon word if you can think of an everyday English equivalent.<p>vi. Break any of these rules sooner than say anything outright barbarous.<p>[1]: <a href=\"https:&#x2F;&#x2F;www.orwell.ru&#x2F;library&#x2F;essays&#x2F;politics&#x2F;english&#x2F;e_polit\" rel=\"nofollow\">https:&#x2F;&#x2F;www.orwell.ru&#x2F;library&#x2F;essays&#x2F;politics&#x2F;english&#x2F;e_poli...</a>", "by": "sb057"}, {"item_id": 21088226, "text": "<i>Science is often hard to read. Most people assume that its difficulties are born out of necessity,\nout of the extreme complexity of scientific concepts, data and analysis. We argue here that\ncomplexity of thought need not lead to impenetrability of expression; we demonstrate a number\nof rhetorical principles that can produce clarity in communication without oversimplifying\nscientific issues. The results are substantive, not merely cosmetic: Improving the quality of\nwriting actually improves the quality of thought.</i><p>From &quot;The Science of Scientific Writing&quot;, 1990; there is a related video, [Judy Swan, Scientific Writing: Beyond Tips and Tricks](<a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;jLPCdDp_LE0\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;jLPCdDp_LE0</a>)", "by": "charlysl"}, {"item_id": 21090529, "text": "I write little academic papers for a living as a professor. I think this is good advice on how to write like cormac mccarthy. More important is to pick an academic writer whose journal articles you love and copy them. One of my favorites is Paul Krugman. He’s not in my field but apparently he’s good enough that people want to read him. He uses lots of semicolons and punctuation.\nI understand where this advice is coming from, though. Lots of academics are truly horrible writers and believe complication itself makes their writing erudite.", "by": "lewis500"}, {"item_id": 21089749, "text": "Nice article.<p>&gt;&gt; Minimize ... transition words — such as ‘however’ or ‘thus’ — so that the reader can focus on the main message &lt;&lt;<p>However, I&#x27;m not sure about this advice :) I remember reading a study that appropriate use of transition words is helpful in signposting how the coming sentence relates to the previous one, thereby reducing effort for the reader. What do other&#x27;s think?", "by": "anonymousDan"}, {"item_id": 21090015, "text": "<p><pre><code>  • Don’t slow the reader down. Avoid footnotes because they break the flow of\n  thoughts and send your eyes darting back and forth while your hands are\n  turning pages or clicking on links. Try to avoid jargon, buzzwords or overly\n  technical language. And don’t use the same word repeatedly — it’s boring.\n  \n  • Don’t over-elaborate. Only use an adjective if it’s relevant. Your paper is\n  not a dialogue with the readers’ potential questions, so don’t go overboard\n  anticipating them. Don’t say the same thing in three different ways in any\n  single section. Don’t say both ‘elucidate’ and ‘elaborate’. Just choose one,\n  or you risk that your readers will give up.\n</code></pre>\n&quot;Don&#x27;t use the same word repeatedly&quot; and &quot;don&#x27;t say the same thing in three\ndifferent ways in any single section&quot; are contradictory.<p>In particular the first bit of advice is not good advice, to my bitter, bitter\nexperience. I used to do this in my papers: I would vary the terminology I\nused to refer to the same concept throughout a paper, to make the text more\ninteresting. This was criticised very strongly and caused untold confusion\namong reviewers, and the confusion caused my work to be rejected with very\nstrongly negative comments. And that&#x27;s not just papers- I kept having to re-do\nthe reports on the progress of my research required by my university, because\nthe internal examiners wer so confused by the way I was writing.<p>Then I had a single session with a woman from the unversity&#x27;s center for\nacademic English and that was one of the first things she said to me: &quot;use the\nsame term to refer to the same concept, throughout the text&quot;. It was like a\nlightbulb went off and the next set of comments I got for my work was\noverwhelmingly positive (with respect to my technical writing anyway). It was\njust This One Simple Trick, right? But it made a world of difference.<p>And here&#x27;s a more general bit of advice: if you ever enjoyed literature, or\nindulged in writing your own, woe is you, o damned soul. Do not even consider\ntrying to write a technical paper as if it was literature. You will be damned\nfor ever to the eternal flames of damned damnation. Really- don&#x27;t do it.\nLiterary writing is evocative, it creates fleeting impressions and conjures\nemotions. Done right, no two readers will get the same impression from the\nsame literary text. But the same is death for technical writing. Technical\nwriting is precise and unambiguous. Everyone who reads it must understand it\nand they must all understand the same thing. Don&#x27;t mix the two kinds of\nwriting up or you&#x27;ll make a mess. Like I have.", "by": "YeGoblynQueenne"}, {"item_id": 21087716, "text": "Know your primary audience.  Allow for other audiences,\nbut know who you are writing to.  The audience for a science \npaper may be other researchers in your field, researchers in associated fields, or other fields, other scientists, or\na more general audience.   Audiences for hackers might be\nother hackers, programmers, computer scientists, users, investors, salespeople, technicians, translators, etc.<p>Pick one main audience, and a very few related audiences,\nand write so that any of them can understand without\nconfusion or distraction.  The red herring for an IPO\ndoes not benefit from leet-speak, nor does the FAQ for\nan online service benefit from legal disclaimers.", "by": "dmckeon"}, {"item_id": 21089748, "text": "&gt;  And don’t worry too much about readers who want to find a way to argue about every tangential point and list all possible qualifications for every statement. Just enjoy writing.<p>Trying to defend against bad reading is impossible and trying to do so in original article is useless.<p>Bad reading is  huge problem for social media and internet forums. Bad readers are  likely to be the first to comment  article in the internet forums and comment sections.  They destroy discussion.", "by": "INGELRII"}, {"item_id": 21088291, "text": "Is step 1 &quot;Be as depressing as possible?&quot;. Full respect to McCarthy but damn his books are hard work.", "by": "EdwardDiego"}, {"item_id": 21087824, "text": "This is some of the best writing advice I’ve read: straightforward and incredibly digestible. All while totally vindicating me for hating so many of the arbitrary style games I had to learn in school :)", "by": "save_ferris"}, {"item_id": 21089544, "text": "« And don’t use the same word repeatedly — it’s boring. »<p>This is dangerous advice, and not just because (as others have noted) it can add ambiguity.<p>Finding alternatives to the simplest word for a concept will often narrow the audience. For a simple example, if I decide I&#x27;ve written &quot;Venus&quot; too many times and substitute &quot;the second planet&quot;, I&#x27;m unnecessarily making it more difficult for people who don&#x27;t happen to know the order of the planets.", "by": "mjw1007"}, {"item_id": 21089593, "text": "&quot;Colloquial expressions can be good for this, but they shouldn’t be too narrowly tied to a region.&quot;<p>Avoiding the elephant in the room that is how it&#x27;s becoming mandatory to write in English for scientific communication. Won&#x27;t anyone think about how this presents a risk of stagnation for scientific thought? (Starting with native English speakers, who never really <i>have</i> to learn another language...)", "by": "BlueTemplar"}, {"item_id": 21090208, "text": "This lecture contains the best advice I&#x27;ve come across for academic writing: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=vtIzMaLkCaM\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=vtIzMaLkCaM</a>", "by": "VarFarYonder"}, {"item_id": 21091538, "text": "I wish there was some acknowledgement of the inevitable tension between readability and thoroughness. Sometimes it is actually more important to be thorough at the expense of readability.", "by": "mordymoop"}, {"item_id": 21089244, "text": "Would be great if he presented a paper rewritten according to his advice.", "by": "a_imho"}, {"item_id": 21088524, "text": "&gt; <i>Limit each paragraph to a single message. A single sentence can be a paragraph.</i><p>I agree with this. Newspaper style. But NeurIPS format will eat you alive if you follow this advice.", "by": "blt"}, {"item_id": 21094070, "text": "This echoes much of the theme of Strunk &amp; White &quot;Elements of Style&quot;: write concisely and directly.", "by": "scelerat"}, {"item_id": 21088099, "text": "This is so good, great advice for making scientific or technical papers more readable", "by": "moneil971"}]