[{"item_id": 21088123, "text": "I want a well-put-together electric car that&#x27;s completely analog <i>from the user&#x27;s perspective</i>. There&#x27;s not a single user-facing digital feature I&#x27;ve ever seen on a car that I wanted, and in fact most of them make things worse.<p>Obviously there&#x27;s some non-user-facing stuff, i.e. all-wheel-drive, which computerization has revolutionized. But any user-facing stuff is just awful. I want an electric car, but I don&#x27;t want to be forced into some awful proprietary OS touch screen just to adjust my A&#x2F;C, and I&#x27;m afraid companies are using the switch from gas to electric as an excuse to go in that direction.", "by": "kerkeslager"}, {"item_id": 21086070, "text": "Bit of a bad look that the video clip showing Smart Summon shows the Tesla driving the wrong direction down a one-way lane...<p>This might be a situation where Tesla Smart Summon works only when Tesla&#x27;s are still rare. In areas where they are more common, I imagine a traffic jam of confused driverless Teslas trying to move past each other but get stuck in a small lane like the one in the video.", "by": "tidepod12"}, {"item_id": 21085239, "text": "Really excited to finally get Spotify integration, that&#x27;s huge.<p>Also hoping they install WiFi at superchargers so you can watch youtube&#x2F;Netflix while charging there. Not sure where else I&#x27;d use that feature.", "by": "sxates"}, {"item_id": 21085637, "text": "This is why I am a Tesla fanboy (although somewhat begrudgingly due to Elon&#x27;s recent antics). They have made car ownership such a joyous experience. I am eagerly waiting to download this and go to town", "by": "dmode"}, {"item_id": 21088957, "text": "The depth and breadth of anti-Tesla sentiment in HN threads is curious. It&#x27;s rarely from owners. By all satisfaction surveys, owners love their Teslas.", "by": "kaiwen1"}, {"item_id": 21085410, "text": "Is there a specific reason why Tesla refuses to integrate CarPlay or Android Auto?", "by": "oflannabhra"}, {"item_id": 21085205, "text": "&quot;Those using Smart Summon must remain responsible for the car and monitor it and its surroundings at all times. &quot;<p>Does this come with an &quot;oh god, stop!&quot; button of some sort?", "by": "SketchySeaBeast"}, {"item_id": 21087227, "text": "Enhanced summon is great.  I had early access and used it on rainy days.  Never again worried I’ll forget my umbrella.", "by": "taf2"}, {"item_id": 21085723, "text": "Not sure why they called this new feature &quot;Joe Mode&quot;. Who is this Joe? An employee? Why not call it quiet mode?", "by": "citrusui"}, {"item_id": 21085878, "text": "Is this memeified announce video typical for official Tesla marketing? It’s so casual it is hard to take seriously.<p>Tesla is not your father’s car.", "by": "bredren"}, {"item_id": 21086685, "text": "I was really excited for a minute there hoping that they finally fixed the &quot;autoplay media on the phone on opening the door&quot; bug that plagued the car since its launch. But no such luck.", "by": "yalogin"}, {"item_id": 21085207, "text": "Smart summon is here; hide your young children.", "by": "new_realist"}, {"item_id": 21086162, "text": "Does anyone know if the user interface is still Qt&#x2F;QML?", "by": "EStudley"}, {"item_id": 21090110, "text": "I&#x27;m always surprised how many ycombinator news readers keep repeating utterly false trite that they heard in some news report that is completely false or was true years ago and has long been fixed. It&#x27;s like people are just only listening to things that confirm their anti-Tesla biases. People need to take a step back and just read the Wikipedia on things more often.", "by": "mlindner"}, {"item_id": 21090321, "text": "I have a VW radio with a touchscreen.<p>Fortunately the volume knob is in a fixed location so I can use it without taking my eyes of the road and the skip&#x2F;play buttons are on the steering wheel.<p>While aircraft use glass cockpits , the important controls keeping it in the sky are still good old button&#x2F;levers even with different shapes&#x2F;textures.", "by": "tibbydudeza"}, {"item_id": 21088129, "text": "I have seen a few comments talking about how Tesla’s can’t even read the traffic signs...<p>This is a conscious decision because signs are easily spoofed by black tape. Because speed limits change so infrequently, it is much easier and safer to pull from a lookup table than to read dirty signs and rely on CV...", "by": "mensetmanusman"}, {"item_id": 21086241, "text": "The entertainment system improvements are amusing.  I installed an Android-based radio in my 19 year old ICE car for less than $300 and have all of these features.<p>For internet, you have to be in Wifi range, add a SIM card to the radio, or tether from your phone.  (I tether or use the house Wifi).<p>It&#x27;s fun to add a bluetooth OBD2 dongle, so I can watch vacuum&#x2F;boost on the screen with the Torque app (or diagnose car problems, it is an old car..).<p><a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;Eonon-Bluetooth-Navigation-Support-System-GA9353&#x2F;dp&#x2F;B07QK4G16S&#x2F;ref=sr_1_19?keywords=android+radio+vw+passat&amp;qid=1569536406&amp;s=gateway&amp;sr=8-19\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;Eonon-Bluetooth-Navigation-Support-Sy...</a>", "by": "jhallenworld"}, {"item_id": 21085300, "text": "How is Smart Summon legal to use?<p>I&#x27;m guessing parking lots are private property?", "by": "kaibee"}, {"item_id": 21085348, "text": "I kinda wish Tesla made a few regular petrol cars for the enthusiast type such as myself, as this sounds like a ton of neat technology to play around with. I&#x27;m just not in the market for an electric car, unfortunately.<p>Edit: By enthusiast, I mean track&#x2F;motorsport&#x2F;etc enthusiast. I borrowed a Model S from a friend of mine for a few days and while I enjoyed it, it wasn&#x27;t the most exciting drive, and I can&#x27;t imagine it would be much good on a track. Amazing technology though.", "by": "AcerbicZero"}, {"item_id": 21091515, "text": "With all the entertainment features they are releasing, they should cash in on the trend of home smart speakers &#x2F; TVs.", "by": "dreamer7"}, {"item_id": 21087349, "text": "Great non-driving features.Not going to complain about Tesla making my car continuously better, but I was hoping to see, &quot;Autopilot now does more&quot;.", "by": "riantogo"}, {"item_id": 21087208, "text": "Use Smart Summon if you want to feel like Tony Stark.", "by": "aledalgrande"}, {"item_id": 21089777, "text": "Too bad the Tesla has been nerfed so bad it&#x27;s useless &#x2F; dangerous in Europe. ( because of regulation ).", "by": "JustFinishedBSG"}, {"item_id": 21090020, "text": "I love the push buttons on my radio 1-10 for 10 channels. If i wanna change, i intuitive press the right button.\nI drive a Mercedes, i can skip through 20 channels on my steer-wheel, or use the touchscreen and go to radio and...\nPush buttons for me.", "by": "GrumpyNl"}, {"item_id": 21085213, "text": "hoping to see that upgrade that recognizes stop signs for full self driving soon!", "by": "enahs-sf"}, {"item_id": 21086555, "text": "I love that hype video, Spotify is a god-send.", "by": "daferna"}, {"item_id": 21086547, "text": "This may seem petty but it annoys me that after all this time I still can&#x27;t make a hands free call to anyone that has more then one phone number in my address book.", "by": "je_bailey"}, {"item_id": 21092349, "text": "What a bunch of odd features.", "by": "cosmosa"}, {"item_id": 21086390, "text": "I really wish they offered a dumb car with the electrics but no screen.", "by": "SomeOldThrow"}, {"item_id": 21086667, "text": "&gt; “Car-aoke”<p>Oh no.", "by": "hartator"}, {"item_id": 21086859, "text": "I love Tesla! Designed and built in USA! And China&#x27;s built in China!\nThey are geniuses.", "by": "williesleg"}, {"item_id": 21085552, "text": "Netflix in a car that doesn&#x27;t yet have fully autonomous driving.<p>Perhaps not the greatest of ideas<p>Or maybe its while stationary only?", "by": "Havoc"}, {"item_id": 21086591, "text": "So glad they&#x27;ve made it possible to watch Netflix and Youtube and play games on the screen. Those things are exactly what I&#x27;m looking for in a car operating system. After all, I can&#x27;t do any of those with my phone.", "by": "dreamcompiler"}, {"item_id": 21086361, "text": "&gt; Our new “Car-aoke” feature lets you sing your heart out with friends on a road trip – or by yourself.<p>Wait what.. you&#x27;re encouraging drivers to look at the entertainment panel to read song lyrics?  While they&#x27;re driving?", "by": "Twirrim"}]