[{"item_id": 21100352, "text": "IMO this post has some good points but makes the executive sound like a passive referee, ultimately misunderstanding what High Output Management (also one of my favorite books!) is about. (Admittedly adding my own editorial here from my experience founding a startup and now running it as a ~3,000-person public company.)<p>The basic principle of HOM is that the fundamental job of an executive is to deliver results (&quot;output&quot;), and that the measure of an executive is the output of their organization. Importantly, there is no one right way to deliver results -- successful CEOs can have very different styles and techniques.<p>That said, for every effective way to deliver results there are vastly more that are ineffective. Complexity, ambiguity, and uncertainty are not your friends. Time is not your friend. Everything is situationally dependent. There are many skills to develop and principles that can help but there&#x27;s no formula.<p>This also partially explains why the median CEO or exec is perceived as ineffective, often because they are. It&#x27;s a hard job, otherwise everyone would do it well and there would be a surplus of good (and cheap) execs.<p>Contrary to what the post suggests, HOM does not say not that the job of an executive is to wave some kind of magic culture or &quot;values&quot; wand and rubber-stamp whatever emergent strategy and behavior results from that. CEOs and executives absolutely do (and must) make important decisions of all kinds, break ties, and set general direction. Occasionally they need to give commands but more typically you work collaboratively with and (as the post correctly suggests) empower your team and avoid doing too much as an individual contributor.<p>If you&#x27;re curious about what execs do and how to be a good one, HOM is an incredible book. The Effective Executive by Drucker is another favorite.<p><a href=\"https:&#x2F;&#x2F;hbr.org&#x2F;2009&#x2F;05&#x2F;what-only-the-ceo-can-do\" rel=\"nofollow\">https:&#x2F;&#x2F;hbr.org&#x2F;2009&#x2F;05&#x2F;what-only-the-ceo-can-do</a> is one of my favorite articles about the responsibilities of the CEO.<p><a href=\"https:&#x2F;&#x2F;hbr.org&#x2F;2018&#x2F;07&#x2F;the-leaders-calendar\" rel=\"nofollow\">https:&#x2F;&#x2F;hbr.org&#x2F;2018&#x2F;07&#x2F;the-leaders-calendar</a> is a fascinating study of where CEOs spend their time and what they actually do day to day.", "by": "dhouston"}, {"item_id": 21095977, "text": "Well, I&#x27;m not going to argue much with Andy Grove.  But my answer to &quot;What do executives do?&quot; is: Work on environmental problems.<p>Problems can be put into three buckets: 1) Can be solved by things 100% under your control. 2) Can be solved only by influencing others to participate, 3) Things that are part of the environment and can really only be mitigated.<p>Area 1, control, is the realm of the first line manager.  The FLM has the people, the budget, the FLM&#x27;s team has the know-how, so execute well and the problem is solved.<p>Area 2, influence, is the realm of the middle manager, and also sales and marketing.  You need to borrow resources from somebody else, argue for corporate re-allocation of resources, convince a sales prospect to become a customer, etc.<p>Area 3, environment, is the realm of the executive.  You have no control and no influence, unless you can <i>find</i> some levers and then delegate.  But some things will not have obvious levers.  Example: It rains.  No body will stop the rain.  But everyone can fix the holes in their roof. Likewise, companies have competitors and an economic environment in which they operate.  Predict and make plans.<p>When I was at Intel, one of the great things that senior Mids got to participate in was &quot;red teaming&quot; as competitors. Given all that Intel knew about a competitor, a team would be give a data dump and a short number of weeks to come up with a strategic plan for that competitor to Eat Intel&#x27;s Lunch.  Then they presented to Intel executive staff.  From what I heard, it was an excellent experience all around and very valuable to the company.  (Before you ask, no.... I was not ever in any danger of participating....)", "by": "dbcurtis"}, {"item_id": 21097987, "text": "Quote: &quot;One of the book&#x27;s claims, which I found shocking at first, was that in a large organization, executives don&#x27;t set strategy&quot;.<p>Yeah, let&#x27;s agree to disagree and let&#x27;s take a look at history. 1 - Microsoft. Bill definitely had a strategy, one that almost cost him his sanity at the end of 90&#x27;s, but nevertheless made Microsoft in only 25 years a behemoth. 2 - Apple. Steve definitely had a strategy when returned to Apple. Got all hardware licenses back and worked on iPhone until was the game-changer. 3 - Amazon. You going to tell me Jeff didn&#x27;t had any strategy? Yeah right.<p>You know who didn&#x27;t had a strategy after almost 100 years of strategies of its CEO&#x27;s? Kodak. Remember Kodak? Yeah, it took only 15 years of streams of CEO&#x27;s to be one per year with no strategy and a board full of idiots to make that company disappear from the face of Earth.", "by": "unnouinceput"}, {"item_id": 21091934, "text": "This was a stimulating read and I&#x27;ll be adding &quot;High Output Management&quot; to my reading list.<p>I&#x27;ve worked in organizations where the company strategy was poorly defined and this led to confusion and misalignment at the lower levels.  I remember talking to some of my coworkers, wondering whether we had an issue with our executive team.  It&#x27;s interesting to think that it&#x27;s not the role of the exec team to set strategy, and the issue may have been with the management layer below the exec team.  Then again, maybe the problem was with the culture&#x2F;value of diffuse ownership set by the exec team...", "by": "datadawg"}, {"item_id": 21100291, "text": "The management methodology The article presents is interesting, but a little too neat. It fails to address some of the obvious practical problems that would come from applying it (though perhaps the book does). In particular, what happens when two reports simply cannot agree?<p>Many business decisions are time-sensitive. They cannot be endlessly deferred until a consensus is reached. And even reasonable people, with access to the same information, can reach opposite conclusions that will never be reconciled. In these cases, somebody has to break the tie, as even a sub-optimal decision may be better than a non-decision.<p>Also, in the matter of strategy, it&#x27;s true that knowledge workers are better informed within their domain, but they are also usually blind to larger scale factors. The individual soldier knows the ideal outcome is to defeat the enemy, and is best informed as to how to  overcome a particular local strong point. But it doesn&#x27;t follow that he is best placed to make the tactical or strategic decision to attack or not. Nor does it follow that a war-winning strategy will spontaneously emerge.", "by": "stupidcar"}, {"item_id": 21096611, "text": "The duty of the general is to ride by the ranks on horseback, show himself to those in danger, praise the brave, threaten the cowardly, encourage the lazy, fill up gaps, transpose a company if necessary, bring aid to wearied, anticipate the crisis, the hour, and the outcome. - Onasander", "by": "p3rls"}, {"item_id": 21096511, "text": "This doesn&#x27;t seem useless, but it hardly seems worth 1000x the wage of a regular worker either.", "by": "vincent-toups"}, {"item_id": 21097036, "text": "The point about strategy vs culture reminds me of an article on here yesterday about how cephalopods have neural subsystems for controlling each limb separately, and they obviously have attention and intent - but it&#x27;s still impossible to say if they have &#x27;consciousness&#x27; such as wee know it. Similarly, it can be hard to tell if companies are run by intent from a central place or it&#x27;s mostly the enduring culture in the subdivisions that produce the actual results.", "by": "m12k"}, {"item_id": 21095921, "text": "I wonder to what extent this should also apply to e.g., schools or churches, or even parenting.<p>Conflict between kids? Make them decide together on a mutually acceptable outcome. Set values, don&#x27;t make decisions. Mediate. I guess the difference is you can&#x27;t fire your kids.", "by": "zamfi"}, {"item_id": 21096717, "text": "Like anything, there are good executives and bad ones. The good ones have worked in the domain for a long time, they have built a-lot of experience, and have good leadership qualities. The bad ones are professional &quot;management&quot; material, they seem to rely more on politicking than actually generating value. The latter make me think i could easily do their job, and it makes me resent the fact that i&#x27;m doing all the work and they are making much more money than me.", "by": "strikelaserclaw"}, {"item_id": 21100562, "text": "Whenever a conversation about executives come up, many tend to jump into the &quot;this is not fair&quot; band wagon. Below is a different take on senior executives that may help shed light on why some things are the way they are.<p>To become a senior executive, the individual must often pass through many trials and tribulations which entails risk taking. A portion of that comes with taking a leap into different verticals, inheriting and resolving other people&#x27;s mess, taking a strategic perspective on things, etc. But you must think, &quot;other&#x27;s also have to go through that&quot; and it is true, but for potential and new executives, it tends to happen more often and at a greater risk to the self and the organization. The risk they take also needs to account for competition, time without family&#x2F;friends, emphasis in the company not in the self, etc. All of these are risks, and when compounded can increase the compensation value of an executive. If the market functioned differently it is likely that a lot less people would be interested in taking that jump, specially in today&#x27;s economy, where most computer &amp; IT occupations have a similar median pay than a top executive [1][2] (USA numbers).<p>As they become the 0.01% of the 0.01% in their area of expertise, they are able to command better compensation for their time. By being part of that equation, you often have to jump into publicly traded companies and become a public figure (internally &amp; externally) which is viewed as a premium in market led opportunities (artists, sports players, etc).<p>A simpler way to visualize the demand aspect of it is to ask yourself: If you had $1m, would you prefer to put it in the hands of someone with reputation or in the hands of the average Joe passing by? Would you pay $300k to get the best doctor to treat your illness with a 5% higher odds of survival or would you be fine to do it with someone else for $50k?<p>Of course, there are still questions regarding market distortions, cronyism and many others that should be taken into account and potentially acted upon to create what society perceives to be fair. It is just important to be mindful of the overall picture.<p>[1] <a href=\"https:&#x2F;&#x2F;www.bls.gov&#x2F;ooh&#x2F;computer-and-information-technology&#x2F;home.htm\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bls.gov&#x2F;ooh&#x2F;computer-and-information-technology&#x2F;...</a>\n[2] <a href=\"https:&#x2F;&#x2F;www.bls.gov&#x2F;ooh&#x2F;management&#x2F;top-executives.htm\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bls.gov&#x2F;ooh&#x2F;management&#x2F;top-executives.htm</a>", "by": "Gpetrium"}, {"item_id": 21099342, "text": "Executives leverage their personal relationships with shareholders and other executives to enrich themselves at the expense of shareholders and taxpayers through lobbying or shady deals. That&#x27;s what they really do. All the other stuff they do is just a pretext to deflect attention away from what they&#x27;re really doing.", "by": "cryptica"}, {"item_id": 21099951, "text": "When a company does well it is usually because the mid-level management is effective. This article doesn&#x27;t say much about the hiring, training and promotion of an effective mid-level management team, which are all key tasks that must be managed well from the top.<p>On the other hand, when a company does badly, it is usually because top level management has made a bone-headed decision, e.g. makes a big investment in a product that fails in the market, fails to respond to a major change in the market that obsoletes current products, or makes a big acquisition that is a disaster.", "by": "Merrill"}, {"item_id": 21099033, "text": "I’ve always thought the film Margin Call got it so right:<p>John Tuld : Let me tell you something, Mr. Sullivan. Do you care to know why I&#x27;m in this chair with you all? I mean, why I earn the big bucks.<p>Peter Sullivan : Yes.<p>John Tuld : I&#x27;m here for one reason and one reason alone. I&#x27;m here to guess what the music might do a week, a month, a year from now. That&#x27;s it. Nothing more.", "by": "JohnJamesRambo"}, {"item_id": 21097653, "text": "This book [1], written by a renowned scholar of executivology describes exactly what an executive does.<p>[1] <a href=\"https:&#x2F;&#x2F;www.goodreads.com&#x2F;book&#x2F;show&#x2F;7177278-how-to-relax-without-getting-the-axe\" rel=\"nofollow\">https:&#x2F;&#x2F;www.goodreads.com&#x2F;book&#x2F;show&#x2F;7177278-how-to-relax-wit...</a>", "by": "decebalus1"}, {"item_id": 21097363, "text": "But wait! Where does my budget or authority come from? Andy Grove does not answer the question that underpins corporate life. How are resources allocated?", "by": "sgt101"}, {"item_id": 21096348, "text": "I&#x27;ve recently been very intrigued about executive pay.<p>Because your average work makes like, what, 1&#x2F;1000 of what an executive makes. But those 1000 workers help that executive earn very high compensation, but then I guess managing 1000 workers is 1000 times more valuable than the work those workers do.<p>But all that sounds like an idea an executive would invent to justify earning 1000x more than what an average worker makes.", "by": "debt"}, {"item_id": 21094791, "text": "Part of this doesn&#x27;t make sense.  It says the executive is supposed to have a meeting a ratify the one decision.  But right before that it says that the two people disagree.<p>It seems to imply that those two people are magically going to agree to something before the meeting.<p>Is the idea that they are forced to either compromise or cancel all of their plans?  It seems like a common outcome might be for them to pretend to agree and then go back to their own section and just do what they want.<p>I feel like there needs to be some kind of verification to ensure that different perspectives are actually being integrated rather than people just talking past each other.  Also, sometimes just mashing two ideas together creates a third idea that doesn&#x27;t work even though either one of the two original could work.  Also, even if they come up with a viable idea, someone has to check that they are actually implementing it.<p>I think the article might be a little bit of a simplification.  Sometimes an executive needs to integrate different perspectives and choose a direction that neither party could see.", "by": "ilaksh"}, {"item_id": 21103270, "text": "I almost asked this a few days ago: with all of the applications that deep learning AI&#x2F;ML etc. have been put to, how come none of it ever touches the C-suite?<p>This is to ask: why haven&#x27;t CFOs been automated?", "by": "rhizome"}, {"item_id": 21097648, "text": "See also <i>The Manager FAQ</i> by Peter Seebach, 2001:<p><a href=\"http:&#x2F;&#x2F;www.seebs.net&#x2F;faqs&#x2F;manager.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.seebs.net&#x2F;faqs&#x2F;manager.html</a>", "by": "teddyh"}, {"item_id": 21095565, "text": "But how can we quantifiably score the talent of executives?", "by": "alexandercrohde"}, {"item_id": 21103927, "text": "Execute misbehaving underlings", "by": "bigred100"}, {"item_id": 21099749, "text": "There is no question that executives do important stuff in the company. I&#x27;ve observed on several occasions their decisions that almost failed the company and the ones that succeeded and almost decimated much more experienced and rich competitors. The questions is - should they be payed x50 to x500 of the median yearly wage of the regular and senior staff in their own company? Their work may be x50 more important (debatable but possible) but it is definitely not x50 times harder, it is not even x10 times harder, it is at most x2-x3 times harder and slightly different. Question number 2 is - should they have almost complete financial and reputational immunity for their &quot;bad&quot; actions and decisions? (unlike regular staff)", "by": "Yizahi"}, {"item_id": 21103977, "text": "If it is a company that cannot bootstrap itself, they know people who know people (in order to raise money).  Otherwise, they have actual skills related to the business (because it is bootstrapped and one has to assume that an &quot;executive&quot; actually has their boots on the ground).  My other comment was shadow banned, I guess, for being snarky.  I didn&#x27;t realize that making fun of executives is a no-no.", "by": "flippinburgers"}, {"item_id": 21095413, "text": "This just seems to reinforce the argument that executives just take credit for the work of others when it is good and don’t take credit when the work is bad. What makes these people so special that only they can ratify good decisions. This just seems like a really hedged defense of bullshit hierarchies. Workplace democracy should be the direction we go.", "by": "GoodJokes"}, {"item_id": 21097833, "text": "They make money while everyone else works.  It is brilliant.", "by": "flippinburgers"}, {"item_id": 21096315, "text": "&gt; parallels with Canadian parliament, where theoretically all decisions must be ratified by the seemingly powerless Governor General, who represents The Queen<p>This sounds to me a lot like the executive is superfluous, much like the monarchy can be discarded", "by": "BrainInAJar"}, {"item_id": 21093496, "text": "&gt; To paraphrase the book, the job of an executive is: to define and enforce culture and values for their whole organization, and to ratify good decisions.<p>For larger orgs, sure. For small and quickly growing orgs, ie the majority audience  here, no.", "by": "techslave"}]