[{"item_id": 21106082, "text": "In this TV series, Stewart Brand rightly acknowledges MIT&#x27;s legendary Building 20, though there&#x27;s a lot more to say about it:<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Building_20\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Building_20</a><p>I had a chance to see Building 20, and do a student Web project on it, right before it was destroyed.  Brand contrasts Building 20 with IM Pei-designed E15, which I worked in, and which had even more bad elements than he itemizes, though there were also some redeeming elements.  The best thing about it -- other than the many students that filled it -- was that, sometimes, in the wee hours of the night, as you&#x27;re slaving as a grad student, the cold and hostile interior cutout, which spanned every floor, was filled with the sound of someone playing the grand piano on the lower level... and belting out vocals of Billy Joel classics.  I never interrupted and risked breaking the magic, but later learned the performer was someone who worked in IT, rather than a student&#x2F;researcher&#x2F;visitor, which I suppose is one loose sense in which the building was malleable wrt original intent.<p>I later worked in the fancy Frank Gehry-designed Stata Center that replaced some of Building 20, as well as served other purposes.  It&#x27;s a nice building, and some interesting conscious efforts were made, such as in the lobby&#x2F;concourse area, which I think are paying off.  There were a few glaring quirks that were designed in, or artifacts of the design, which seemed incongruous with the niceness of it.  There was also sometimes suboptimal allocation of interior space, when some people didn&#x27;t have enough space, but there were big chunks of underutilized space.<p>(This is partly relevant, and tangentially funny: One evening of late hours at work, several years ago, I was meeting with a professor in one of those underutilized sitting spaces, and a presumed undergrad student turned on an adjacent loud piece of machinery, which was placed poorly, next to professors&#x27; offices, and difficult to talk over.  Professor asks student to use the machine later, because we&#x27;re trying to talk.  Professor was tenured and exceedingly accomplished, but (I think this might&#x27;ve been a factor in his response) female and young, and apparently the male student was very new and unaware.  Rather than apologize and perhaps negotiate, he adopts an irritated, talking-down tone, &quot;And who are you?&quot;  She responds, no note of irritation, just a hint of cheerful, &quot;I&#x27;m Professor ___&quot;, and asks him to use the noisy machine later.)<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Ray_and_Maria_Stata_Center\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Ray_and_Maria_Stata_Center</a><p>I understand that the Stata building also helped unite some groups previously from 545 Tech Square and elsewhere, including Project MAC, the AI Lab, LCS, and the W3C.  Most of that greatness was before my time, but I read about it as a kid.  What seemed to be a series of remodeling of 545 Tech Square took place after Stewart Brand&#x27;s book was written, but, together with its previous twin building, could be used as a book cover illustration of building evolution over time.<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Technology_Square_(Cambridge,_Massachusetts)\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Technology_Square_(Cambridge,_...</a>", "by": "neilv"}, {"item_id": 21105138, "text": "The piece in the video where they talk about an old building that evolved over 500 years reminds me of when I lived in Germany and we would visit castles and take pictures as our hobby. Most castles start as a single tower on a high point of ground and grow from there.<p>So one of the things we would do is go around trying to identify the oldest tower, the place where this fortification started. It was generally going to be simpler and uglier and out of step with the rest of the architecture.<p>It was also often fairly centrally located. At Wurzburg, I think it was found in some inner courtyard.<p>At one time, I had the book called <i>How Buildings Learn.</i> The gist of it is that wonderful old buildings didn&#x27;t start out as wonderful old buildings. They grew into their wonderfulness as owners added onto them.<p>Time and living well in that space is what makes for wonderful buildings.<p>Jane Jacobs talks about the need for older buildings in a city and the need for buildings of various ages. She says that when you bulldoze an area and start over and build everything new you are usually doing great harm to the town.<p>Her description is that these areas &quot;Were always dead, but no one noticed until the body began to smell.&quot;<p>Which means it was never a good idea. People just didn&#x27;t figure it out until the newness and shininess wore off and the fact that it didn&#x27;t work and was falling apart in short order started to really show.<p>It was her explanation for why people were wrong about &quot;This area died.&quot; No, it didn&#x27;t die. It was never alive to begin with. You just didn&#x27;t immediately see it.<p>Buildings and cities need to grow and breath and live. They need to evolve organically. If you imagine they are static things, you don&#x27;t understand them and you can&#x27;t do right by them.", "by": "DoreenMichele"}, {"item_id": 21109602, "text": "I&#x27;ve read the book carefully, cover-to-cover: it&#x27;s a classic.  I was fairly disappointed with the TV series though.  I think the only thing I really got out of it was video of a few interesting buildings.  For getting a good understanding of the ideas that Brand was trying to convey I highly recommend going straight to the book and bypassing the TV series.", "by": "EdwardCoffin"}, {"item_id": 21106228, "text": "I also read the comments on youtube and one of them describes the series as a &quot;terribly poor example of architectural information - so many unqualified statements, generalizations and assumptions that are simply incorrect&quot;<p>From the same user:<p><i>&quot;Architects often concentrate more on the look of a building than its eventual use or function&quot;  That is a very bold statement..... To say that architects downplay the function of building is a ridiculous thing to say.</i><p><i>&quot;The central problem is that architects don&#x27;t want change in their buildings, so they make it as difficult as possible.&quot;  False.  Architects are legally responsible to act for the betterment of their client and the general public.  Being deliberately &#x27;difficult&#x27; would result in an eventual loss of their license.</i><p><i>&quot;Changes and remodeling is bound to be ugly.&quot;  Give me a break, have you seen the Louvre?  Or any other updated building, ever?</i>", "by": "TotallyGod"}, {"item_id": 21107795, "text": "Make sure you get through the initial description of the problems with contemporary architecture that led the book to be written and get to the meat of the matter: how to think about buildings over time.<p>Also, the book this comes from is wonderful.", "by": "madhadron"}, {"item_id": 21109323, "text": "The parallels between buildings are built to evolve, and software, are wonderful to think about", "by": "stevebmark"}, {"item_id": 21104582, "text": "Also a book!", "by": "asplake"}]