[{"item_id": 21099874, "text": "This looks great, and I look forward to finding time to try it soon.<p>However, I believe it&#x27;s misleading to call it &quot;open source&quot;.  The SPPL license is not generally considered to be an open source licence by any meaningful definition, and in particular does not meet the OSI definition and is incompatible with most licences that do.<p>I understand the need these days to protect against aggressive cloud providers, but there are other ways to achieve that without becoming completely non open source, such as the BSL<p>(See license.<a href=\"https:&#x2F;&#x2F;opensourceforu.com&#x2F;2019&#x2F;06&#x2F;cockroach-labs-changes-its-licensing-strategy-adopts-permissive-version-of-business-source-license&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;opensourceforu.com&#x2F;2019&#x2F;06&#x2F;cockroach-labs-changes-it...</a> )", "by": "martingxx"}, {"item_id": 21098601, "text": "I want to see this married with the Meltano project from Gitlab - it would create an unprecedented end-to-end data environment.<p><a href=\"https:&#x2F;&#x2F;meltano.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;meltano.com&#x2F;</a>", "by": "tomnipotent"}, {"item_id": 21097674, "text": "Segment has done an awesome job of building a great product but it is impossible to be provably secure and private given that they host all the data. Rudder can avoid situations such as the Segment Security incident that happened recently. <a href=\"https:&#x2F;&#x2F;segment.com&#x2F;security&#x2F;bulletins&#x2F;incident090519&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;segment.com&#x2F;security&#x2F;bulletins&#x2F;incident090519&#x2F;</a><p>Very excited about this project!", "by": "tankster"}, {"item_id": 21097937, "text": "As a longtime segment customer, I am excited to see this exist. Segment&#x27;s product is fairly good but their pricing model is really bad. We recently ran into an issue where they were billing us for almost 10x the number of users we were actually tracking. It was a nightmare that required a few months of back and forth with their support trying to get it fixed. In the end, they gave us a partial refund for the overages but we had to do a lot of technical work to resolve the issue ourselves.<p>It would be nice to have an open source alternative that doesn&#x27;t get you locked into an unpredictable pricing model that you have very little control over.", "by": "vollmarj"}, {"item_id": 21098852, "text": "We are in the mobile game industry. Due to the incredible high volume events data per user generates per day, we need to join certain events together to reduce the events amount send to our analytics platform. There is no other segment tool can do this for us. We have been working with Rudder Labs to solve this problem. They have been really helpful and act super fast to our requests and suggestions. With Rudder Labs SDK, we are able to join event data on the platform(which we choose to host internally) + all other segment tool features. Besides that, since we run a freemium game so that most of our users are free users&#x2F;non-payers, cost is another thing we have to consider, current segment market pricing apparently is way too high for us. Rudder labs solves this problem for us as well. Great deal!", "by": "torpedolaser"}, {"item_id": 21097484, "text": "One of the authors here. This post was a pleasant surprise!! Happy to answer any questions. Or please feel to reach out to me at soumyadeb@rudderlabs.com.", "by": "soumyadeb"}, {"item_id": 21098310, "text": "I am a happy Segment user, however their handling of a recent data breach did leave a bit of a sour taste. They took several days to get back to me with a definitive answer as to whether our customer data that we collected was compromised by the internal breach.<p>I am keen to look at competitive product where we may have more control over the data collected and can manage the risk ourselves.", "by": "cyberferret"}, {"item_id": 21098230, "text": "So what&#x27;s the pricing model? Your site lists &quot;pricing&quot; and shows no info.<p>- Are you charging for support?<p>- Do you&#x2F;will you have a paid enterprise tier that will increasingly be the only tier with a viable feature set?<p>- What&#x27;s keeping you from dumping on Segment&#x27;s market until you hit traction then ratcheting up to Segment&#x27;s pricing?<p>- Who are you? Who are your investors?", "by": "beager"}, {"item_id": 21098413, "text": "Is it really so difficult for engineers to create a task to process a Kafka topic? It takes one day to write a program to consume from a topic of events and push to an API like Amplitude, and you have total flexibility in how you push to those integrations.<p>Why would you use postgres for an event professing system? This seems like an inefficient architecture.", "by": "sundbry"}, {"item_id": 21099381, "text": "Interesting, we&#x27;ve built our in-house solution that is also Go based, also writing to a postgres db besides forwarding events, but much simpler, without a UI and comes with backend sdks already.<p>What I found interesting is that you wrote 3k&#x2F;events per second on a rather beefy 2xlarge machine. Our version is MUCH less demanding, I wonder if there isn&#x27;t a lot of performance left on the table here.<p>I&#x27;ll keep this in mind once we&#x27;ve grown out of our solution, though.", "by": "Roritharr"}, {"item_id": 21099553, "text": "I tought this was <a href=\"https:&#x2F;&#x2F;www.rudder.io&#x2F;en&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rudder.io&#x2F;en&#x2F;</a>", "by": "qurt"}, {"item_id": 21098172, "text": "This is awesome! Never know if anyone build things like Segment. I will try this alternative solution to our company and will keep update here about the result.", "by": "yodi"}, {"item_id": 21100531, "text": "This looks great, nice work.<p>Is there an easy way for someone to set it up on their cloud infrastructure?", "by": "fuzzyfroghunter"}, {"item_id": 21097998, "text": "One issue I had with Segment, I couldn&#x27;t run real-time transformation of the event to join data from our data tables.   We eventually got over it with AWS Lambda and sending it back to Segment. Segment recently announced functions to help on this, still could not get my hands on it.<p>Any plans on this?", "by": "indianCoder"}, {"item_id": 21099225, "text": "How does this compare to Snowplow?<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;snowplow&#x2F;snowplow\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;snowplow&#x2F;snowplow</a>", "by": "sails"}, {"item_id": 21097241, "text": "also, segment was the O.G. segment alternative <a href=\"https:&#x2F;&#x2F;github.com&#x2F;segmentio&#x2F;analytics.js\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;segmentio&#x2F;analytics.js</a>", "by": "mushufasa"}, {"item_id": 21100796, "text": "Segment IO is currently being blocked on browsers with adblock. Does this mean it will work even with adblock?", "by": "mychael"}, {"item_id": 21098355, "text": "We&#x27;re lucky to find and deploy this project early at our startup. Being a cybersecurity company, we cannot have out customers data leave our aws account.", "by": "drixta"}, {"item_id": 21097292, "text": "If every successful business is eventually copied by open source, can we really blame big companies for protective practices such as customer lock-in?", "by": "amelius"}, {"item_id": 21098138, "text": "very interesting and approacheable solution.<p>With regards to: \n&gt;&quot; Rudder runs as a single go binary with Postgres. It also needs the destination (e.g. GA, Amplitude) specific transformation code which are node scripts. &quot;<p>what would be a recommended approach, if I would like to keep the data internally, and not use external Analytics engine?", "by": "platform"}, {"item_id": 21098242, "text": "Good luck, but this is a huge amount of work to keep something like this running.  I hope it’s successful!", "by": "orasis"}, {"item_id": 21097767, "text": "The majority of risk lies outside of Segment and they are damned serious about the risk they own", "by": "dacompton"}, {"item_id": 21098341, "text": null, "by": null}, {"item_id": 21098342, "text": "This looks exciting", "by": "gauravagarwal"}, {"item_id": 21097948, "text": "this is so awesome! i have been waiting for it.", "by": "dinrat"}]