[{"item_id": 21087388, "text": "I think if law enforcement uses these DNA databases then their entire department should be required to submit each officer’s DNA and that of their immediate family members too. If prosecutors or defending attorneys want to use these databases, then the same should go for them. If a judge admits the use of DNA evidence for a case, then the same goes for them. Politicians by virtue passing these laws should get that same treatment.<p>Maybe the way to solve this issue is for law enforcement to be required to mail a letter to everyone who is in the database that they are a suspect in whatever crime being investigated each time law enforcement executed or delegates the execution of a search query. I mean that is how search works: you search everything or you compute hash functions on everything to avoid searching everything, but you’ve effectively tested whether or not everyone in the database is the suspect.<p>On a slightly different topic, how well are these DNA databases secured and maintained? A person’s DNA might not change, but the corresponding entry in the DNA database is subject to theft, manipulation, and data corruption. What’s stopping the presumption of innocence until proven guilty becoming the presumption of innocence until the DNA database reports a match? Arguably, people should treat DNA  databases with the same level of suspicion and concern as some view electronic voting: absolutely vulnerable and absolutely abusable until repeatedly proven to be not sufficiently many times.", "by": "tareqak"}, {"item_id": 21088056, "text": "New Hampshire Public Radio put out an amazing podcast about a murder that went unsolved for decades. A lot of effort by a lot of people went into unraveling the stories and identifying the victims, but genetic genealogy was pretty key. In the later episodes they also talk a bit about the question of unrestricted access and the consent of people in the databases.<p>If you&#x27;re interested in how powerful the techniques are (or are simply interested in how a very cold case was finally broken open), I&#x27;d highly encourage you to check out Bear Brook:<p><a href=\"https:&#x2F;&#x2F;www.bearbrookpodcast.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bearbrookpodcast.com&#x2F;</a><p>I hope I&#x27;ve kept this vague enough to avoid giving anything away for anybody who wants to go listen. It really is worth your time.", "by": "mauvehaus"}, {"item_id": 21087356, "text": "&gt;The value of these websites for law enforcement was highlighted last year when Joseph DeAngelo was charged with a series of rapes and murders that had occurred decades earlier. Investigators tracked down the suspect, dubbed the Golden State Killer, by uploading a DNA profile from a crime scene to a public ancestry website, identifying distant relatives, then using traditional genealogy and other information to narrow their search. The approach has led to arrests in at least 60 cold cases around the country.<p>It seems like a pretty big loss if these types of cases cannot be solved in the future.", "by": "RcouF1uZ4gsC"}, {"item_id": 21088662, "text": "I don&#x27;t understand the privacy concerns and most of the comments here. I see these DNA database searches as an amazing tool to find criminals and not in any way privacy infringing. And I wish it was more widespread, ideally everyone being required to submit their DNA.<p>Some arguments I&#x27;m seeing:<p>* &quot;Privacy&quot;: I don&#x27;t see this more private than the information contained on a driver&#x27;s license. It also does not expose anything that&#x27;s not otherwise already available to the police. I don&#x27;t see the difference (when it comes to privacy) between DNA and a fingerprint that you have to provide when getting ID&#x2F;drivers license.<p>* &quot;False positives&quot;: Yes, they&#x27;ll probably happen. But even if we go with that assumption there are additional ways to exclude most of them. And those that can&#x27;t be excluded get tested for an exact match and&#x2F;or additional evidence. This is no different than being a suspect in any other way.<p>* &quot;False convictions&quot;: As far as I understood it this will just be used to narrow down potential suspects, not to get a conviction.<p>* &quot;Police will lie do anything to convict the person just based off of this evidence&quot;: That&#x27;s a separate topic that needs to be addressed, but not by reducing tools and forbidding technology that can narrow down and find suspects.<p>Under worst case scenario is being a false positive result and maybe talking to the police (if you were in the same city, your age was correct, you were around&#x2F;close to area of the crime) and providing exact DNA sample so much worse than the fact that &quot;The approach has led to arrests in at least 60 cold cases around the country.&quot;? I say it&#x27;s not.", "by": "a254613e"}, {"item_id": 21089467, "text": "One thing I realized now after thinking about the impact of DNA databases is the long-term impact. We already live in a world where law enforcement and the criminal justice system as a whole can be biased for or against different kinds of people depending on race, gender, background, sexual orientation, sexual identity, and wealth. If law enforcement is able to collect DNA samples and store the DNA of those who are convicted, then they could do statistical analysis on the genetic make-up of criminals by crime. Some people already have concerns about insurance companies getting access to their DNA and discriminating against them using increased prices or refusing to insure them all together. Similar analysis could be used by law enforcement and governments to monitor and apprehend people they suspect might have a higher probability commit a crime. Again, law enforcement already pulls over certain groups of people while they are out driving more often than others without repercussions.<p>Improper use of both DNA databases and statistical analysis can realistically be used to bring about the rise of something that I’ve only ever read about: pre-crime. That we live in a time where big data gets bigger, mass surveillance becomes evermore inescapable, politics more divisive, and government more powerful yet less accountable just makes this one possible but extremely powerful tool of oppression.", "by": "tareqak"}, {"item_id": 21087251, "text": "I would think that police would need a warrant from every person that hits on the the database, not just the targets, but every person whose DNA is included in such a database.  If there are 50 million records of DNA included in the database, they would need 50 million warrants and show cause, otherwise its a violation of the fourth amendment.", "by": "jijji"}, {"item_id": 21088922, "text": "&gt; One study found that 60% of white Americans can now be tracked down using such searches.<p>Woah, this is a goldmine for law enforcement.<p>I&#x27;m curious what the false positive rate is currently. We&#x27;ve already seen the police, or more accurately their prosecution teams, overstate the scientific value of touch DNA [1][2]. This type of database, which some agencies are already building themselves [3][4], is only going to keep growing. Even for minor crimes.<p>Their ability to collect DNA properly as well as in a legitimate fashion connected to a crime should come under heavier scrutiny (if it hasn&#x27;t already) and no private database should just be handed to them.<p>For example: can we trust the DNA companies to have an appropriate chain of evidence?<p>We really need to avoid the beginning arrest scene in Brazil type of stuff... if they are going to do it at all, they better do it properly. Legal constraints are highly welcome.<p>1. <a href=\"https:&#x2F;&#x2F;www.propublica.org&#x2F;article&#x2F;thousands-of-criminal-cases-in-new-york-relied-on-disputed-dna-testing-techniques\" rel=\"nofollow\">https:&#x2F;&#x2F;www.propublica.org&#x2F;article&#x2F;thousands-of-criminal-cas...</a><p>2. <a href=\"https:&#x2F;&#x2F;www.nytimes.com&#x2F;2005&#x2F;05&#x2F;07&#x2F;us&#x2F;labs-errors-force-review-of-150-dna-cases.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nytimes.com&#x2F;2005&#x2F;05&#x2F;07&#x2F;us&#x2F;labs-errors-force-revi...</a><p>3. <a href=\"https:&#x2F;&#x2F;www.nytimes.com&#x2F;2019&#x2F;08&#x2F;16&#x2F;nyregion&#x2F;newyorktoday&#x2F;nypd-dna-database.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nytimes.com&#x2F;2019&#x2F;08&#x2F;16&#x2F;nyregion&#x2F;newyorktoday&#x2F;nyp...</a><p>4. <a href=\"https:&#x2F;&#x2F;www.nytimes.com&#x2F;2019&#x2F;08&#x2F;15&#x2F;nyregion&#x2F;nypd-dna-database.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nytimes.com&#x2F;2019&#x2F;08&#x2F;15&#x2F;nyregion&#x2F;nypd-dna-databas...</a>", "by": "dmix"}, {"item_id": 21093154, "text": "A different point: most murders are committed by people who are known by the victim, while DNA can reveal connections from strangers.<p><a href=\"https:&#x2F;&#x2F;www.bjs.gov&#x2F;index.cfm?ty=tp&amp;tid=941\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bjs.gov&#x2F;index.cfm?ty=tp&amp;tid=941</a><p>&gt; &quot;Stranger&quot; is a classification of the victim&#x27;s relationship to the offender for crimes involving direct contact between the two. Incidents are classified as involving strangers if the victim identifies the offender as a stranger, did not see or recognize the offender, or knew the offender only by sight.<p>Interestingly, there was a brief period in the US 1990&#x27;s where over 50% of murders were committed by strangers.", "by": "irq-1"}, {"item_id": 21088390, "text": "If anyone is interested in a list of perpetrators of crimes identified through genealogy databases [0]. Most famously the Golden State Killer, who likely would have remained unidentified [1].<p>[0]: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_suspected_perpetrators_of_crimes_identified_with_GEDmatch\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_suspected_perpetrators...</a>\n[1]: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Golden_State_Killer\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Golden_State_Killer</a>", "by": "kolanos"}, {"item_id": 21087645, "text": "A consideration I didn&#x27;t yet see mentioned in the comments: announcing rules like this might allay concerns some people have about submitting their DNA to databases, thereby increasing participation (and business).<p>The resulting increased participation is then subject to a number of major pros and cons for the individual and society -- now, and in the future.", "by": "neilv"}, {"item_id": 21087445, "text": "If a DNA is found on a felony crime site, I think all searches should be possible. If possible restrict it with a need for a warrant.<p>I’m trying to think but so far there seems no way to justify limiting searches.", "by": "bureaucrat"}, {"item_id": 21088015, "text": "Fun fact: Family tree DNA search skews towards white people, balancing out some of the disproportionately black federal criminal DNA databases.", "by": "gbrown"}, {"item_id": 21088234, "text": "This should be a law, not a rule. How do we push this into law, so there are consequences when the databases are abused?", "by": "detail-oriented"}, {"item_id": 21087189, "text": "Does it limit the DNA database companies from simply forwarding the data? Otherwise you just get the dumb &quot;police officer has lunch with exec &#x27;it sure would be nice if we had dna data for X&#x27;&quot; and other approaches they&#x27;ve taken to circumvent the law.", "by": "olliej"}, {"item_id": 21088210, "text": "I get why our behavior should be protected with privacy, to prevent bad actors from exploiting us. But DNA matching seems to be a reliable way to find criminals without impacting anyone’s standard of living.<p>Can someone explain why it’s bad to solve crimes with this data?", "by": "riazrizvi"}, {"item_id": 21090829, "text": "What about mothers searching for unknown fathers?  The civil law applications of DNA database searches could be considerable.<p>This would also have a criminal element: every pregnant underage mother is a potential statutory rape case.", "by": "pfdietz"}, {"item_id": 21087878, "text": "The policy should also require the FBI — prior to utilizing private genealogy sites — add the case details to Justice’s NamUs database and network. The FBI pretends it doesn’t exist, because the bureau doesn’t get to control it. Poor FBI.", "by": "GWSchulz"}, {"item_id": 21089370, "text": "I&#x27;m having a hard time finding privacy issues with such searches. When those databases are used to search for suspects in legitimate crime cases using legitimate DNA evidence, I fail to see where either the suspect or the culprit have a reasonable right or expectation to privacy.<p>There is an argument around not giving a government such power to abuse. But if a government is already inclined to use such databases illegally and to circumvent due process, they won&#x27;t really care about such legislation either.", "by": "bayesian_horse"}, {"item_id": 21088141, "text": "Can we get a constitutional amendment to codify this right?", "by": "jmpman"}, {"item_id": 21093288, "text": null, "by": null}, {"item_id": 21090329, "text": "I agree with these &quot;new rules&quot; but isn&#x27;t it odd how unelected DOJ officials get to effectively make new law out of whole cloth like this? I don&#x27;t recall seeing anything in the constitution about the law making powers of the DOJ.", "by": "fuzz4lyfe"}, {"item_id": 21091673, "text": "So majority of HN don’t like idea when private company censoring information from “right to be forgotten” claims, yet would love law enforcement solve less crime by using public data?", "by": "dzhiurgis"}, {"item_id": 21088933, "text": "I have read that 26 million Americans have taken these genetic tests, now encompassing 8% of the population. Not all of these are generally searchable. But approaching a critical mass for forensic genealogy.", "by": "peter303"}, {"item_id": 21088918, "text": "Great. To me the more interesting question will be how this evidence is handled at trial. DNA matching is a stochastic process. There is no line of logic involved. Therefore, when using it in court it can only be used in the context of probability of a match. Humans are notoriously bad at assessing probability, and there are some great TED talks out there on how bad we really are and how it’s already affected our non-genetically enhanced justice system. My greatest hope is not that DNA searches are banned, but that we treat DNA matches as circumstantial evidence that may help indicate a suspect but is inadmissible as evidence of guilt.", "by": "madrox"}, {"item_id": 21089816, "text": "Similar to other questionable methods of data collection, how likely is it that a form of parallel construction is used even with these laws in place?", "by": "treebeard901"}, {"item_id": 21092499, "text": "Not making a point, just stating that this method was how they got the golden state killer.", "by": "ulises314"}, {"item_id": 21087845, "text": "So the only people searching these databases will be the security agencies of every country that can break in?", "by": "killjoywashere"}, {"item_id": 21092975, "text": "Is the government of the USA even still legitimate if it just simply violates core Constitutional principles that the government is clearly and adequately prohibited from violating, while acting as if patching on minor laws and regulations rationalizes the violation of prohibitions to violate fundamental rights; the 4th Amendment prohibition on the government to search and seize without reason.<p>It&#x27; an absolute prohibition and not at all ambiguous, yet when the population is not willing and able to force the psychopathic tendencies of government the psychopaths that control the government will simply do as they wish.", "by": "JamesSchriver"}, {"item_id": 21087636, "text": "Something to hide?", "by": "williesleg"}, {"item_id": 21087566, "text": "Thank goodness! This whole situation has been crazy.", "by": "droithomme"}, {"item_id": 21087337, "text": "Ok, great. I get it, privacy. But there are murderers that could be caught, that would likely reoffend...", "by": "Muuuchem"}]