[{"item_id": 21086642, "text": "So octopuses are very intelligent, and very alien. Anyone who has even casually read or watched videos about them will know this.<p>But their potential is cut short by their incredibly short lives (like 5? years at the higher end) which seem to be caused by a very bizarre self-destructive behavior after mating (starving themselves, eating their own arms), which in turn is caused by an &quot;optic gland&quot; and removing that gland completely eliminates that self-destructiveness and increases their lifespan.<p>It makes you wonder if that gland was artificially engineered into them.<p>The sci-fi nerd in me likes to think there is a cosmic conflict between axial-symmetry species and radial-symmetry species, which may be overall more common in the universe given how life evolves at the microscopic scale, and Earth was chosen to give apes a chance.", "by": "Scapeghost"}, {"item_id": 21083876, "text": "Just saw this yesterday and feel it&#x27;s apropos for this thread:<p>Octopus Dreaming - <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=0vKCLJZbytU\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=0vKCLJZbytU</a><p>Some of the best imagery I&#x27;ve ever seen of chromatophores (and other *phores) in action.", "by": "jcims"}, {"item_id": 21089987, "text": "Anyone interested to read more about the octopus&#x27; brain, this article is worth reading:\n<a href=\"http:&#x2F;&#x2F;greymattersjournal.com&#x2F;dive-into-the-mind-of-an-octopus&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;greymattersjournal.com&#x2F;dive-into-the-mind-of-an-octop...</a><p>In a nutshell:<p>1) Octopuses have a &quot;vertical lobe&quot;, which is very similar in function and organization to our hippocampus.<p>2) Mammalian hippocampuses have the ability for something known as &quot;longterm potentiation&quot; (LTP), which is believed to play a crucial part in memory and learning. Experiments found a similar longterm potentiation mechanism in the vertical lobe of octopuses.<p>Quoting the article: &quot;The discovery of LTP in octopuses provides evidence for convergent evolution that has led to the selection of similar synaptic activity. Though not yet agreed upon in the scientific community, the existence of LTP in both mammals and octopuses strengthens the concept of LTP as a cellular basis for learning and memory and may be a general mechanism for associative learning&quot;.", "by": "irwt"}, {"item_id": 21083428, "text": "Good read!  Adrian Tchaikovsky explored octopus consciousness in the sci-fi novel &#x27;Children of Ruin&#x27;.  They really do seem alien.", "by": "pizzavore"}, {"item_id": 21083615, "text": "The thing that I keep wondering about is, why don&#x27;t octopuses have higher aspirations? Like building octopus cities, and forming an octopus empire. Or figuring out how to pass on information from generation to generation. Could an octopus be taught English?", "by": "youeseh"}, {"item_id": 21085649, "text": "&gt; The octopus conundrum is an instructive example of how an animal can be complex and intelligent, and yet we are, so far, unable to answer the question of its subjective experience or even whether the question has any meaning for that creature.<p>I&#x27;m not sure, but I think that the author is arguing that we can&#x27;t say for sure whether any other creatures are conscious. There are the mirror experiments, but ultimately, we know that humans are (in general) conscious because we (personally) are conscious.", "by": "mirimir"}, {"item_id": 21083376, "text": "There&#x27;s a bio professor at my university, Michael Dickinson, who is one of the world&#x27;s leading experts on flies, so much so that his email handle is &quot;flyman&quot;. His group is trying to understand the relationship between the fruit fly&#x27;s biological structure and it&#x27;s behavior. They do all these zany experiments with motion tracking where they observe a bunch of flies interacting and try to figure out what&#x27;s going on in their brains. Really cool stuff. I&#x27;ve always felt that if we could understand the genes -&gt; cells -&gt; systems -&gt; behavior pathway much better then our understanding of the world might be completely transformed... I think octopuses would be an especially interesting model organism to study.", "by": "gautamcgoel"}, {"item_id": 21084717, "text": "Also related: Thomas Nagel&#x27;s &#x27;What Is It Like to Be a Bat?&#x27; (<a href=\"https:&#x2F;&#x2F;warwick.ac.uk&#x2F;fac&#x2F;cross_fac&#x2F;iatl&#x2F;study&#x2F;ugmodules&#x2F;humananimalstudies&#x2F;lectures&#x2F;32&#x2F;nagel_bat.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;warwick.ac.uk&#x2F;fac&#x2F;cross_fac&#x2F;iatl&#x2F;study&#x2F;ugmodules&#x2F;hum...</a> ) wherein he argues that subjective experience transcends objective materialism.", "by": "gbjw"}, {"item_id": 21087746, "text": "&gt; <i>The octopus has a central brain and also an independent, smaller processor in each arm, giving it a unique mixture of centralized and distributed command.</i><p>This is the most interesting part. I read that an octopus&#x27;s brain can give their arms high-level commands, and the arms can execute some commands by themselves.", "by": "bcaa7f3a8bbc"}, {"item_id": 21084752, "text": "I did not appreciate life as a young person. It is only in recent years that I am absolutely enthralled by the beauty of life. Seeing how complex life is, it is surprising that it even exists. I sometimes question my own motivations about how I  frivolously I have lived my life without paying much attention to suffering in the lives of other living beings. I also feel powerless in front of the huge economic forces that I have to come to depend on for my sustenance. I wish we were better equipped to comprehend the suffering in another life. I know it only when I am told explicitly. I see all the painful ways we hunt and find it extremely painful. And much of civilization thinks of hunting as a sport. Causing pain to another species is sport!", "by": "hi41"}, {"item_id": 21084504, "text": "I’ve said this before here on HN when the octopus came up but I’ll say it again: these creatures are so damn smart I stopped eating them when I consume sushi. Many animals possess advanced intellect so I’ve limited my consumption of animals but it’s the octopus that has a special place in my eyes. What majestic creatures. The females find a rock to give birth to the next generation and slowly starve to death while doing so. As soon I learned that I thought of my own single mom while she didn’t give her life raising me or my sister she did sacrifice a lot.", "by": "gigatexal"}, {"item_id": 21085175, "text": "Whenever I read an Octopus article I come back to the conviction that if it weren’t for the early death thing, these are the creatures that would be failing to fight the climate crisis, and we would be — if not the creatures on the plate in the tapas joint, at least some scared and scurrying thing in the underbrush.", "by": "biztos"}, {"item_id": 21087457, "text": "Maybe this is the highest form of intelligence?<p>Octupuses also have a very short lifespan which seems apt: you don&#x27;t need societies, buildings, relationships etc if you have truly mastered the sole purpose of your existence really well - the nature of procreation and empowering the next generation to survive.<p>Human beings are actually awful at this it: makes me wonder if all social, cultural aspects are truly &quot;too complicated&quot; ways to achieve what octupuses have mastered through a much simpler process and potentially without needing arbitrary things like consciousness.", "by": "mindfulplay"}, {"item_id": 21083377, "text": "&gt; An octopus, with its richly complex behavior and its large eyes filled with focused attention, is a far more compelling inkblot test, so to speak, triggering a strong social perception in us. Not only do we know, intellectually, that it gathers objective information about its world, but we can’t help feeling that it must have a subjective awareness as well emanating out of those soulful eyes.<p>But the truth is, we don’t know, and the sense we get of its conscious mind says more about us than about the octopus. The experts who study octopuses risk becoming the least reliable observers on this point, because they are the ones most likely to be entranced by these wonderful creatures.<p>Conciousness debates are so fundamental yet so moot: One can only attribute conciousness based on observing behavior. There really isn&#x27;t a good &quot;line on the sand&quot; to distinguish who&#x2F;what is conscious and who isn&#x27;t for anything from humans to octopuses to microwaves to computer programs.", "by": "air7"}, {"item_id": 21084425, "text": "Are they the aliens, or are we the aliens? If octopus are conscious, do they look at us the same way we would look at aliens that came to earth with such incomprehensible technology that it looks like magic?", "by": "irrational"}, {"item_id": 21084095, "text": "This article is a reminder that science based articles can be engaging and incredibly illuminating. There is a sharp contrast between this article and other science writing that seems primarily occupied with impressing the reader with facts, to detriment of any kind of connection with the human (or perhaps octopus?) reading it.", "by": "xrd"}, {"item_id": 21084349, "text": "I&#x27;d say this to my friends (literally &quot;I believe octopi are aliens&quot;) and get laughed at.<p>I believe that for a lot of underwater life. Basically our oceans are a cesspool of ancient alien life that&#x27;s been collecting in there for millennia", "by": "ajharrison"}, {"item_id": 21085954, "text": "Is the question just whether invertebrates have consciousness? It may be a forcing function of our desire to impose consciousness on things but it really seems like my cat and my dog both have a level of consciousness.", "by": "cpt1138"}, {"item_id": 21089844, "text": "Sounds like this guy got pipped to publication by Peter Godfrey Smith&#x27;s <i>Other Minds</i>.<p>Can anyone who has read both comment on whether Graziano&#x27;s book contains much different?", "by": "conjectures"}, {"item_id": 21083797, "text": "I thought that cuttlefish were the established kings of this particular hill?<p><a href=\"https:&#x2F;&#x2F;www.xkcd.com&#x2F;520&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.xkcd.com&#x2F;520&#x2F;</a><p><a href=\"http:&#x2F;&#x2F;tailsteak.com&#x2F;archive.php?num=400\" rel=\"nofollow\">http:&#x2F;&#x2F;tailsteak.com&#x2F;archive.php?num=400</a>", "by": "teddyh"}, {"item_id": 21089887, "text": "&quot;The Hawaiʻian creation myth relates that the present cosmos is only the last of a series, having arisen in stages from the wreck of the previous universe. In this account, the octopus is the lone survivor of the previous, alien universe.&quot;<p><a href=\"http:&#x2F;&#x2F;rustyidols.blogspot.de&#x2F;2008&#x2F;08&#x2F;research-octopus-god.html\" rel=\"nofollow\">http:&#x2F;&#x2F;rustyidols.blogspot.de&#x2F;2008&#x2F;08&#x2F;research-octopus-god.h...</a>", "by": "anotheryou"}, {"item_id": 21083348, "text": "I wonder if anyone has managed to create some sort of sign language or writing or something to communicate with an Octopus.", "by": "ufmace"}, {"item_id": 21090534, "text": "&quot;Other Minds&quot; is an excellent book on this topic.", "by": "nmca"}, {"item_id": 21092764, "text": "How is the author sure that humans are conscious? If he is going by his own personal experience, then he can be sure only of his own consciousness.", "by": "ab8"}, {"item_id": 21087209, "text": "this might be off topic but I really loved the writing style of this author. This is the kind of journalism I would like to pay for. \nHe is dealing with a complicated subject but his prose is so lucid and devoid of jargon that helps us understand what he is saying.", "by": "TheMinorityGuy"}, {"item_id": 21083265, "text": "&gt;octopus<p>&gt;last 5 characters of the domain are ithub", "by": "CameronNemo"}, {"item_id": 21083464, "text": "Nice rip off of <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;Other-Minds-Octopus-Origins-Consciousness&#x2F;dp&#x2F;0374227764\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;Other-Minds-Octopus-Origins-Conscious...</a>", "by": "smrz"}]