[{"item_id": 21093857, "text": "I just prefer batteries-included and fewer decisions. Angular already compiles components at build-time using the Angular CLI, and the new upcoming (November) Ivy engine is going to produce bundles that will rival in size with any framework.<p>The webpack build that the Angular CLI uses internally is completely transparent, you don&#x27;t have to know Webpack at all. Just do ng build --prod and you have your optimized bundles will all the bell and whistles.<p>Webpack is even going to be replaced by Bazel but we won&#x27;t even notice it, all we have to do is ng update and live goes on the next day after the release.<p>The Angular ecosystem with the Angular CLI is just so stable and complete, with hardly any API changes in years, it&#x27;s just a joy to work with. The CLI even integrates with Sass and other CSS processors.<p>You can really focus on the application, and forget tooling. I think the take of Angular on batteries-included tooling &amp; their take on incremental upgrades are such a huge advantage over other ecosystems, AFIK nothing else comes even close.", "by": "vfc1"}, {"item_id": 21090437, "text": "The fact you can easily make yet another To Do list app isn&#x27;t very useful. If you can&#x27;t easily make a very simple app then something is <i>seriously</i> wrong with the framework.<p>A much more useful question is whether or not a framework makes it easier (or faster, or better, or something) to write a complex app. In the case of Svelte, all the hard stuff (eg state management, sync&#x27;ing data from APIs, etc) is outside of the scope framework. That make Svelte much smaller and simpler, but it makes writing a complex app harder (because you need to glue some other libraries together yourself; the framework isn&#x27;t doing it for you).", "by": "onion2k"}, {"item_id": 21090571, "text": "I&#x27;ve been distanced from web development for a year and you now have a cool new framework, ReactJS is surpassed by VueJS and probably some other packaging tools did something interesting and new opinions about how the same old things should be built are on the rise.<p>But I have a serious question: Why the web dev is still a relevant thing?  Don&#x27;t get me wrong, I won&#x27;t argue that the web is dead and all should move into AI or VR or something but I am under the impression that most of the problems that can be solved through a Web UI are mostly solved. Sure people come up with interesting business ideas all the time but they usually don&#x27;t require innovative Web UI tech and can be built just fine with 10-year-old frameworks.<p>How is the web world doing? Why would anyone keep creating cool new frameworks?", "by": "mrtksn"}, {"item_id": 21092129, "text": "&gt; Svelte has not yet received the attention it deserves. When it is mentioned, the focus is typically on its ability to produce bundled code that is significantly smaller than the alternatives. However, Svelte makes many tasks easier, including defining components, managing component state, managing application state, and adding animation.<p>Under the &quot;Why Consider Svelte?&quot; it only mentions bundle size and performance.", "by": "choward"}, {"item_id": 21093740, "text": "I recently started a project using svelte and the difference from React and Vue is so drastic for me that it isn&#x27;t even funny!<p>Now, I know how opinionated we all are and how the best thing is what we already know, but after working with Vue and React extensively (the company I currently work for uses Vue&#x2F;TS for a huge app, think over 1000+ .vue files) the particularity about svelte is that you hardly notice that you are using it!<p>Vue has the Vue way and React has prophet Abramov to light the way, but svelte is completely out of your way. You wanna follow MVC? go ahead, DDD? why not?<p>I have learned more HTML5 and CSS3 using svelte than any of the other frameworks because it encourages you to use it, because the wheel has been invented already.<p>Again, everybody has their opinion but for me svelte is the framework that has the least magic of all, the you can set it up without a incredibly complicated webpack config or obscure &#x27;create-react-app&#x27; that makes it very easy to start a project but you don&#x27;t really know what&#x27;s happening underneath.<p>And it just HTML and probably 5 or 6 extra JS things like $: and a different use for export in a component.<p>If you are already religious about your framework, good for you, but if you are open to ideas, take a look a svelte!", "by": "_benj"}, {"item_id": 21084573, "text": "I&#x27;m a primarily React-based developer, but have taken to using Svelte on side projects. Don&#x27;t get me wrong, I still like React, but Svelte is phenomenally easy to get started and wrap your head around. I&#x27;ve started suggesting it instead of React to people looking to learn front-end JS.", "by": "urthen"}, {"item_id": 21090790, "text": "I&#x27;m migrating one of my sites from jQuery (+ server-generated HTML) to Svelte. I like how Svelte+rollup make it easy to replace just a part of a website (take HTML from a file, put it into Foo.svelte, back in the original file insert &lt;script&gt;new App.Foo({target: document.body, props: { &#x2F;* data *&#x2F; }})&lt;&#x2F;script&gt; [0]). Instead of generating HTML, server-side scripts now generate JSON, which could be used later to make a proper API.<p>I don&#x27;t like handling of &quot;undefined&quot; and &quot;null&quot; values in properties[1]. It would also be nice to have optional properties so that warnings wouldn&#x27;t get emitted to JS console. Also, someone should investigate iOS bugs[2]. It would be bad if someone made complex site in Svelte+Sapper and only later discovered it lags on iOS.<p>Overall performance is okay, but it&#x27;s visible to a naked eye that Svelte parts render later than the rest of the website.<p>All in all, I would recommend giving Svelte devs few more months before moving to it. But definitely keep an eye on it, it has great ergonomics (maybe except for styling subcomponents, but some say it&#x27;s a code smell anyway).<p>[0] assuming you set output { format: &quot;iife&quot;, name: &quot;App&quot; } in rollup.config.js, imported bundle.js in the original file, and put export { Foo } in main.js<p>[1] <a href=\"https:&#x2F;&#x2F;svelte.dev&#x2F;repl&#x2F;f1f2bf4c50cf4a75ba6ea38c3390af5b?version=3.12.1\" rel=\"nofollow\">https:&#x2F;&#x2F;svelte.dev&#x2F;repl&#x2F;f1f2bf4c50cf4a75ba6ea38c3390af5b?ver...</a><p>[2] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;sveltejs&#x2F;svelte&#x2F;issues&#x2F;3581\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;sveltejs&#x2F;svelte&#x2F;issues&#x2F;3581</a>", "by": "pzmarzly"}, {"item_id": 21091470, "text": "Does anyone know what&#x27;s the status of Typescript support in Svelte is? This thread is understandably locked:<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;sveltejs&#x2F;svelte&#x2F;issues&#x2F;1639\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;sveltejs&#x2F;svelte&#x2F;issues&#x2F;1639</a><p>Still I&#x27;m curious.<p>Typescript and RxJS (or MobX) with Svelte as the afterthought (<a href=\"https:&#x2F;&#x2F;michel.codes&#x2F;blogs&#x2F;ui-as-an-afterthought\" rel=\"nofollow\">https:&#x2F;&#x2F;michel.codes&#x2F;blogs&#x2F;ui-as-an-afterthought</a>) would be a nice combo.", "by": "JTenerife"}, {"item_id": 21091173, "text": "I&#x27;ve been writing React professionally for 5 years straight and I&#x27;m absolutely sick of it.  I haven&#x27;t spent enough time with Svelte but I&#x27;m sick of React and all the noobs who swear by it.  I&#x27;m sick of it spinning around in circles and nobody getting anywhere.  I&#x27;m sick of terrible SPA&#x27;s consisting of a pile of bandaids stacked on top of one another.     I&#x27;m sick of testing it with tools like Enzyme.   If React were so great, I&#x27;d expect to see better things coming out of Facebook.  They do one thing well, steal and sell users data.  Everything else was bought.   Honestly, just sick of Facebook.   I was more productive writing stateful apps using C# and ASP.NET with jQuery.   In fact, 9&#x2F;10 we don&#x27;t need stateful UI&#x27;s nor React.<p>GraphQL sucks too.  Good luck setting up caching.   For instance, hey we forgot caching is important, now that the architecture doesn&#x27;t allow for it since it uses a single api endpoint... the talked about solution is to use localStorage or sessionStorage.  JS is a huge noobfest and those that think React is the answer to everything, probably haven&#x27;t been in this game long enough.", "by": "chrshawkes"}, {"item_id": 21091436, "text": "Whoa. Sounds interesting and promising. If anyone from Svelte is here listening I&#x27;d like to point out that this isn&#x27;t quite correct. WCAG actually specifies that __decorative__ images have no alt= or use alt=&#x27;&#x27;. But yeah, a warning can&#x27;t hurt. Kudos!<p>Svelte provides runtime warnings for accessibility issues. For example, &lt;img&gt; elements that have no alt attribute are flagged.", "by": "chiefalchemist"}, {"item_id": 21092292, "text": "You want simple? Try HTML, CSS, and JavaScript.", "by": "ConcernedCoder"}, {"item_id": 21092926, "text": "Svelte really resonates with me - as a previous AngularJS dev, tried to get into React and VueJS several times, but I did not want to learn a build system (grunt, gulp, webpack) and always have to stay up the date with the &quot;best&quot; ways to build. And I don&#x27;t have the time to invest in learning another tool.<p>The nice thing about Svelte isn&#x27;t necessarily the syntax.  It&#x27;s the fact that out of the box it builds without me having to learn how to build it.   That and the small bundle sizes and single file components sealed the deal for me.", "by": "turtlebits"}, {"item_id": 21090424, "text": "This is a framework I&#x27;ve been interested in for while. Need to find an excuse to use it", "by": "Bantros"}, {"item_id": 21090607, "text": null, "by": null}, {"item_id": 21094858, "text": "So for small apps, the final bundle size is significantly smaller since there&#x27;s no framework &quot;runtime&quot; code included. What about large apps though?", "by": "matmo"}, {"item_id": 21093669, "text": "Svelte is great, but I will probably use the new Blazor framework from Microsoft that compiles to WebAssembly. The benefit is that I can use C# instead of JavaScript.", "by": "ifthenelseend"}, {"item_id": 21092782, "text": "Does Svelte have a prebuilt set of components like ant.design?", "by": "sharmi"}, {"item_id": 21095416, "text": "Svelte is great. It&#x27;s a shame we need a framework to do that and that the standard HTML&#x2F;CSS&#x2F;JS platform can&#x27;t do that natively.", "by": "sunseb"}, {"item_id": 21091208, "text": "Looks interesting. Is there a list of libraries that are productions ready that can be used with it? I&#x27;m looking for Formik and ReactRouter equivalents at least.", "by": "sadlion"}, {"item_id": 21092552, "text": "One of the more popular Mastodon frontends uses Svelte.<p><a href=\"https:&#x2F;&#x2F;pinafore.social&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;pinafore.social&#x2F;</a>", "by": "Kye"}, {"item_id": 21094742, "text": "The template syntax is a bit weird. Not sure what would have been better but thats just a gut feeling.", "by": "brainzap"}, {"item_id": 21091482, "text": "Svelte is a real good shot vs the angularjs (v1) I used in 2015, but still, I will stick to imba ;)", "by": "maitredusoi"}, {"item_id": 21095769, "text": "I&#x27;ve never been so excited about a library since the React itself.", "by": "wintorez"}, {"item_id": 21093351, "text": "Looks like early Vue to me", "by": "jcmontx"}, {"item_id": 21090994, "text": null, "by": null}]