[{"item_id": 21106775, "text": "I&#x27;d like to take the opportunity to clear a misunderstanding that I&#x27;ve seen in several threads related to quantum computing.<p>—————————————————————————————————————————————————————————<p>The classes of complexity of interest here are P, NP, BPP, and BQP.<p>— <i></i>P<i></i> corresponds to the problems that can be solved by a classical computer (deterministic Turing machine) in polynomial time. For example finding a shortest path between nodes in a graph is in this complexity class.<p>— <i></i>NP<i></i> corresponds to the problems where “verifying a solution” is in P. In other words, it&#x27;s “easy” to check if a solution is actually valid. We know that P ⊆ NP which means that when it&#x27;s easy to find a solution, it&#x27;s also easy to check that a solution is valid (but we don&#x27;t know if the opposite is true). This class contains interesting problems such as prime factorization on which all the current Web&#x27;s security depends. It&#x27;s easy to check if a factorization is valid, but it&#x27;s hypothesized that it&#x27;s hard to actually find it. Now the interesting part is that we&#x27;re not <i>sure</i> it&#x27;s actually true, so the security house of cards might actually tumble at some point (if it hasn&#x27;t already secretly).<p>— <i></i>BPP<i></i> contains all the problems that you can solve in polynomial time (so like P) but with a chance of less than 1&#x2F;3 of being incorrect! In practice, we run the algorithm several times to reduce the probability of being wrong to less than 2^(−ck) (c is a positive constant, k is the number of times it&#x27;s run).<p>— <i></i>BQP<i></i> is probably the most interesting class here. It&#x27;s just like <i>BPP</i> but on a quantum computer. Now the interesting part is that we don&#x27;t know (yet) an efficient way of finding the prime factorization on a classical computer. But on a quantum computer, we have the infamous Shor&#x27;s algorithm which can solve this problem in polynomial time with a bounded error!<p>—————————————————————————————————————————————————————————<p>The current knowledge about complexity classes is that P ⊆ BPP ⊆ BQP. We don&#x27;t know how NP and BQP relate to each other.<p>What does this mean? We don&#x27;t know if quantum computers can solve harder problems <i>theoretically</i>. But they seem to do <i>sometimes</i> in practice to the best of our knowledge. Coming back to the Shor&#x27;s algorithm example, we don&#x27;t know any classical algorithm that can solve the prime factorization problem as efficiently. But this doesn&#x27;t mean that such an algorithm doesn&#x27;t exist!<p>Now you might think that all of this is only theoretical considerations that only mathematicians care about. After all, we don&#x27;t care if theoretically there might exist efficient classical algorithms for supposedly hard problems if we don&#x27;t find them anyway right? This is a valid observation. If big enough quantum computers become a reality one day, we&#x27;ll be able to solve some hard problems <i>right away</i>. However in the meantime, we might totally find efficient classical algorithms making quantum computers less useful. Actually, it has already happened last year[1]! A recommendation problem that we thought was intractable by classical means (but easy to solve with quantum computers) turned out to be solvable more easily than expected by a classical computer. This classical algorithm draws inspiration from quantum algorithms however. So if anything, quantum computing will force us to look at problems from another perspective and solve them in novel ways.<p>[1] <a href=\"https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1807.04271\" rel=\"nofollow\">https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1807.04271</a>", "by": "noname120"}, {"item_id": 21106322, "text": "Note that they have a quantum computer that can solve a very specific type of problem. (But it solves them exponentially faster than a classical computer). They don&#x27;t have a general purpose quantum computer, in particular, they can&#x27;t run Shor&#x27;s algorithm to factorize numbers and break a big part of encryption methods.<p>For a more detailed and better explanation than mine, you can read post of Scott Aaronson <a href=\"https:&#x2F;&#x2F;www.scottaaronson.com&#x2F;blog&#x2F;?p=4317\" rel=\"nofollow\">https:&#x2F;&#x2F;www.scottaaronson.com&#x2F;blog&#x2F;?p=4317</a> (HN discussion: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=21053405\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=21053405</a> (595 points, 5 days ago, 207 comments))", "by": "gus_massa"}, {"item_id": 21104051, "text": "<a href=\"http:&#x2F;&#x2F;archive.is&#x2F;QJ0ae\" rel=\"nofollow\">http:&#x2F;&#x2F;archive.is&#x2F;QJ0ae</a>", "by": "neonate"}, {"item_id": 21108374, "text": "No surprise coming from The Economist, this article has done the best job (that I&#x27;ve seen) of explaining these complex topics in a language accessible to most.  I now understand the significance of this new discovery and its limitations.  And I like how they&#x27;ve stayed humble with their tie-in to Watson&#x27;s famous prediction in the last sentence.", "by": "conchy"}, {"item_id": 21106492, "text": "These little steps towards usable QC keep coming. Is there a paper or doc that outlines what breakthroughs are still needed before we can consider ECC or RSA broken? Is QC interesting for signal processing? How would having a million Qbits in my iPhone change us?", "by": "bdamm"}, {"item_id": 21106811, "text": "I love the teleological formulation &quot;Proof emerges&quot;.", "by": "talaketu"}, {"item_id": 21107738, "text": "How &quot;big&quot; is a qubit?<p>How many can fit in a server rack, now and in the near future?", "by": "lonelappde"}]