[{"item_id": 21101004, "text": "As someone that writes Elixir at $DAYJOB, I was really looking forward to replacing some JS with LiveView. However, after having used it for a simple feature, I&#x27;m not entirely sure if I will continue to use it. I realize it is still pre 1.0 and that there is still a lot of work being done on it.<p>My biggest complaint is that if your server restarts for any reason (say, a rolling restart), you currently lose all state that was on the server[0]. There appears to be some kind of workaround for forms currently, but for anything more complex, I would need to write JS in order to attempt to not have my page get reset to the default view. So if I need to write JS already, I may as well just write JS (or something that transpiles or JS&#x2F;WASM) to have fewer moving parts.<p>[0] <a href=\"https:&#x2F;&#x2F;elixirforum.com&#x2F;t&#x2F;liveview-and-rolling-restarts&#x2F;23973\" rel=\"nofollow\">https:&#x2F;&#x2F;elixirforum.com&#x2F;t&#x2F;liveview-and-rolling-restarts&#x2F;2397...</a>", "by": "Ankhers"}, {"item_id": 21101279, "text": "PHP&#x2F;Laravel have something similar to this now called Livewire <a href=\"https:&#x2F;&#x2F;laravel-livewire.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;laravel-livewire.com&#x2F;</a><p>The author, Caleb Porzio (<a href=\"https:&#x2F;&#x2F;calebporzio.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;calebporzio.com&#x2F;</a>), was inspired by Phoenix LiveView to build something something like this for his preferred language&#x2F;framework.", "by": "francislavoie"}, {"item_id": 21100503, "text": "I have been meaning to play around with Elixir, Phoenix and LiveView for a while, it seems like it could replace client-side JS frameworks (e.g. React) for many use cases, especially the ones that already fully use server-side rendering.<p>Has anybody with lots of React experience made that switch? How is it going?", "by": "mxstbr"}, {"item_id": 21100697, "text": "This is an awesome example, thanks for sharing! Are you doing any sort of optimisation on the server side, or is it parsing the entire page of markdown on every key press? Have you stress tested this on really long content just out of interest?", "by": "mcintyre1994"}, {"item_id": 21101464, "text": "Demo looks awesome. Is that against localhost or an actual server? Latency seems nil.", "by": "hartator"}, {"item_id": 21105121, "text": "I’m curious why the author used phx-change function for the form, I believe a better way to do this would be the phx-keyup function attached the text field.", "by": "owens99"}, {"item_id": 21102338, "text": null, "by": null}, {"item_id": 21101645, "text": "There’s a big caveat: all state is on server which will bite you (in terms of RAM) if you’re not careful.<p>A small thread including my own experience here: <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;dmitriid&#x2F;status&#x2F;1153586545426862080\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;dmitriid&#x2F;status&#x2F;1153586545426862080</a> It’s fairly obvious, but is worth mentioning.", "by": "dmitriid"}]