[{"item_id": 21086167, "text": "Hello folks, this is Hamel from GitHub -- I’m one of the Machine Learning Engineers who worked on this project. The reason we are excited to host this data is that we believe the community will be able to innovate and advance the state of the art much faster if it is provided in a tractable format for machine learning researchers.  This data is already public, however there is specialized knowledge required to acquire, parse, dedupe, and clean code from many programming languages at a massive scale on GitHub. We strived to reduce these barriers to encourage greater involvement.<p>While we present the task of information retrieval as one possible use case of this dataset, we know there could be other practical applications of this data (i.e. code summarization).  While we went through great lengths to pre-process the data for the community, the data is still messy and often you will find that there might not be high-quality comments that are aligned with a code snippet we parsed.  However, we believe this is part of the excitement of the dataset it poses challenges that machine learning practitioners will have to address.<p>Code is very different than natural language with regard to its structure and syntactic rules and may benefit from different approaches relative to natural language processing.  Our baseline models and benchmarks mostly treat code as natural language, however we are aware that there could be an opportunity to innovate on this front.  If anyone creates any interesting projects from this dataset, please do get in touch.  Happy to answer any questions!", "by": "mloncode"}, {"item_id": 21086161, "text": "Shawn from Weights &amp; Biases here. We&#x27;ve been working with Github and Microsoft Research on this for just about a year now and we&#x27;re super excited to launch it today.<p>We&#x27;ve seen huge advances in human language modeling and translation due to the success of deep learning. Often new directions start with a really motivated team producing a new kind of dataset. Who better to do that for code as language than Github!<p>This started as a grassroots effort inside of Github, and went through many iterations. When it was presented to Github&#x27;s CEO six months ago, he correctly pointed out that we needed to go back and include Github&#x27;s most popular language (javascript). As the project went on many smart people chipped in, and we produced something that we think is truly useful.<p>Check out the paper here: <a href=\"https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1909.09436\" rel=\"nofollow\">https:&#x2F;&#x2F;arxiv.org&#x2F;abs&#x2F;1909.09436</a><p>We overcame plenty of challenges to pull this off. For example: how do you clean this data? how do you label it? We&#x27;ve got folks from Github, Microsoft Research and Weights &amp; Biases here to answer any and all questions you might have. Can&#x27;t wait to see where this goes!", "by": "slewis"}, {"item_id": 21087650, "text": "Code challenges like this are interesting - thank you for putting this together!<p>I do have a question about the set-up, if that&#x27;s alright. Netflix and others have found that shared tasks can lead to great models, but not necessarily ones that are suited for use in a production environment. Have you put much thought into how best to set up a challenge such at this to make the obvious &quot;ensemble everything&quot; solution be less worthwhile?<p>Similarly, have you put much thought into how to encourage the sharing of information between participants?<p>Thanks again.", "by": "s_Hogg"}, {"item_id": 21088711, "text": "Great effort in putting together this large corpus! While reading through your paper, I noticed the difficulties you faced in correctly annotating the code for their quality, correctness and hiring annotators for different languages. I can imagine how herculean this task could be.<p>I was wondering if you thought to include stackoverflow questions and answers, which have been vetted by thousands of programmers over a long period of time. Stackoverflow might even want to participate in this effort to provide a clean ground truth for this great project.", "by": "mishraka"}, {"item_id": 21093341, "text": "Code reuse search engines is something that Haskell is excellent for. With Hoogle you can search for a generic type signature and probably find the method you want.<p>Want to flatten an array of Maybes? Just search for [Maybe a] -&gt; [a] and you&#x27;ll find catMaybes and takeWhileJust.<p>This of course only works for Haskell because so much of a function is determined by it&#x27;s types. Doing this sort of thing in say JavaScript would be an absolute nightmare. Still, it&#x27;s an interesting train of thought.", "by": "CountHackulus"}, {"item_id": 21090098, "text": "I&#x27;ve been experimenting with my own custom markup for annotating code blocks.  I want to document code use cases and automatically generate an index of independent sandbox examples.  This approach doesn&#x27;t require AI but rather manual effort remembering to annotate novel uses in code and a standard convention for doing so.  One problem this solved is that I&#x27;ve written so much code that I lose track of where I experienced certain patterns and this would help me track that better.  This also helps to facilitate knowledge sharing across teams with access to the source.<p>Has anyone worked on something such as this and can comment or share ideas?", "by": "Dowwie"}, {"item_id": 21089600, "text": "I haven&#x27;t looked at this in detail, but where I could see this technology going is by doing a kind of lint.  We&#x27;ve got hand built linters for most languages and some of them are really good (Clippy in Rust is amazingly good -- it practically writes my code sometimes).  However, a tool that analysed my code, picked out things that were idiomatically strange and then suggested example code that might be better <i>would</i> be quite useful, I think.", "by": "mikekchar"}, {"item_id": 21088359, "text": "A phrase is never enough to describe what the task at hand is. It may work for simpler use cases like the results on stack overflow. Otherwise I do not see it doing better than a google search which leads me to stack overflow.", "by": "mkagenius"}, {"item_id": 21088761, "text": "&gt; <i>Searching for code to reuse, call into, or to see how others handle a problem is one of the most common tasks in a software developer’s day</i><p>I don&#x27;t disagree at all that this is how we code these days... but I distinctly remember a time when this wasn&#x27;t so. We had to do everything ourselves. We engineered our solutions based on various requirements and constraints, and most importantly, we had to figure it out ourselves. The only external help we had was with the APIs we used... and they had to be <i>studied</i> to be understood.<p>Even in recent times, the most fun I&#x27;ve had <i>programming</i> has been when it&#x27;s all come from my wee little head, rather than trawling for solutions and shoehorning&#x2F; reworking something similar.", "by": "cmroanirgo"}, {"item_id": 21088250, "text": "A little off-topic.<p>&gt; Our fully preprocessed CodeSearchNet Corpus is available for download on Amazon S3<p>I am surprised that Github went with S3 for this download. Isn&#x27;t there a Azure equivalent of S3 for large object storage ? This just shows the dominance of AWS.", "by": "psankar"}, {"item_id": 21094227, "text": "Looks like they&#x27;re using tokens as input as if it&#x27;s natural language. You have an AST, use it. I think the limitation is the lack of graph and tree based neural networks, but I don&#x27;t think you need a neural network to search code. You already have the AST. This could be solved with a traditional analytic approach, but it&#x27;s probably a lot of hard work.", "by": "zelly"}, {"item_id": 21093864, "text": "Something like this might be useful for making better &quot;documentation&quot; for things like API&#x27;s and man-pages.<p>Documentation tends to be either simplistic &quot;hello-world&quot; examples or everything-but-the-kitchen-sink dumps that take forever to consume. Neither of these is helpful to a practitioner that just wants to get through a basic task without starting a mini-research project, or getting burnt to a crisp on stackoverflow.<p>So basically, I am thinking this corpus could be used to filter for specific examples of usage within particular contexts and problem domains? Or maybe not?", "by": "crispyambulance"}, {"item_id": 21089513, "text": "Since the CodeSearchNet Corpus contains metadata such as owner&#x2F;repository, it would be nice to create a search tool for the data set itself. That way you could check if, by chance, some of your open source code is part of the corpus.<p>The data set is apparently ~20GB [0], so a cheap VPS instance might do the job of hosting the data in a searchable format.<p>[0] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;github&#x2F;CodeSearchNet#downloading-data-from-s3\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;github&#x2F;CodeSearchNet#downloading-data-fro...</a>", "by": "jakobgm"}, {"item_id": 21088531, "text": null, "by": null}, {"item_id": 21091630, "text": "I think this is fantastic and I&#x27;m excited to see what people come up with here.<p>It&#x27;s very disappointing to see a lot of the negative comments here, almost completely around licensing, despite the licensing being well explained.<p>You&#x27;d think this place was full of lazy bureaucrats.", "by": "AndrewKemendo"}, {"item_id": 21090915, "text": "I&#x27;m not trying to be a jerk here, but screw it.<p>I&#x27;m sure whatever it is you&#x27;ve done, I&#x27;ll probably use at Github at some point. However, from my 10 second scan of the page, I know absolutely NOTHING about what this is or what it can do for me. Is it just me or do I _constantly_ see example of developers making the worst marketers in the world? Where are the code examples or videos showing whatever it is this is and how it will help me. There is nothing on that page but a HUGE image and a bunch of text I can&#x27;t understand without 4 PHDs and a half a tab of Adderall.<p>It&#x27;s so frustrating see stories on Hacker News that are just piss poorly explained. You&#x27;ve most likely worked hard at this for a long time, why is it you can&#x27;t take 5 minutes to explain it in lay man&#x27;s terms for all to understand?<p>END RANT", "by": "thrownaway954"}, {"item_id": 21089241, "text": "I remember a search engine for developers called Symbolhound. Wasn&#x27;t fruitful for me bit I&#x27;ll never very forget it.", "by": "agsilvio"}, {"item_id": 21090658, "text": null, "by": null}, {"item_id": 21093063, "text": "Very cool! I wish I had more time!", "by": "baalimago"}]