[{"item_id": 21082581, "text": "I call them &quot;Secret Plans&quot;. You gotta save up the emotional energy and reward. On so many projects, you get the same neuro-chemical reward by talking about your project plans and how cool the result will be, as you do by making progress. By holding out, and only allowing progress itself to be a reward, and not just the talking, I usually get much further. The project may still die, but then I have something in my hands usually, and that&#x27;s more rewarding than a bunch of people who think I only talk about things and never start&#x2F;do any of them. . .", "by": "mbarronj"}, {"item_id": 21083606, "text": "Reminds me of a quote from Sara Blakely:<p>“I was very careful right away, it was a gut instinct that I had, to keep it to myself because I believe ideas are most vulnerable in their infancy, and it’s instinct to turn to your right or left in that moment and tell a friend, or tell your husband, and the moment you do that ego is invited into the mix, and then you end up spending all your time defending it, explaining it, and not pursuing it”<p>How I Built This podcast (9m20s)", "by": "nomilk"}, {"item_id": 21084470, "text": "This very much depends on how motivated you are by external validation. For some people, the fear of losing social capital by not following through on a public commitment is motivating enough to accomplish stretch goals.<p>Source: used this technique to overcome my own procrastination trying to launch my first app as a solo founder. It worked, and I went on to raised a million VC to see if I could scale up the vision of a social goals app.<p>The downside of relying on external validation, as I learned the hard way, is when your self improvement startup goes down in flames, you <i>really</i> feel like a fuckup.", "by": "mindgam3"}, {"item_id": 21082398, "text": "This article treats all types of announcements as being equal. Not so!<p>A hazy announcement like &quot;I&#x27;ll be doing more to fight climate change&quot; may indeed be empty virtue signaling that leads to nothing.<p>But what about a more precise announcement like: &quot;I&#x27;ll be writing a book on Topic X, which I plan to publish 15 months from now, and I&#x27;ll be completing one chapter on the 25th of every month until then&quot;? Now we&#x27;ve got intermediate deadlines, and deliverables, and at least the first stirrings of a coherent plan.<p>Announcements can work quite well, as long as you&#x27;re willing to commit with enough clarity that your friends and rivals will keep you honest.", "by": "GCA10"}, {"item_id": 21083270, "text": "I call this &quot;letting all the steam go to the whistle instead of the wheels&quot;", "by": "btbuildem"}, {"item_id": 21081520, "text": "I sometimes wonder if a similar mechanism might be at play when you imagine accomplishing your goal in a Walter Mitty sort of way.<p>There are many projects which I can envision completing, and which I know I have the technical skills for. But I gain a certain amount of satisfaction just from picturing the completed work, and in the end I don&#x27;t actually put in the effort to make it reality.", "by": "jniedrauer"}, {"item_id": 21084759, "text": "This is (mostly) wrong. Sivers himself seems to have regretted how his talk was interpreted and posted this semi-retraction: <a href=\"https:&#x2F;&#x2F;sivers.org&#x2F;zipit2\" rel=\"nofollow\">https:&#x2F;&#x2F;sivers.org&#x2F;zipit2</a><p>But identity-based goal or not, the conclusion that you make yourself less likely to achieve a goal by telling people about it defies common sense. I mean, here&#x27;s the peer-reviewed science saying my common sense is wrong -- <a href=\"http:&#x2F;&#x2F;www.psych.nyu.edu&#x2F;gollwitzer&#x2F;09_Gollwitzer_Sheeran_Seifert_Michalski_When_Intentions_.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.psych.nyu.edu&#x2F;gollwitzer&#x2F;09_Gollwitzer_Sheeran_Se...</a> -- but this is a psychology paper from 2009 so I&#x27;m willing to bet real money on common sense, despite seeing no obvious flaw with the paper.", "by": "dreeves"}, {"item_id": 21083755, "text": "I find this has cut both ways in my life. In piano, it was always my goal to play Chopin Ballade No 1. After ~5 years of playing, I heard it and KNEW I wanted to learn it. It was only around ~15 years in, when I got the gumption and a teacher who didn&#x27;t put the idea down, I signed up for a concert to play it, and I was FORCED to learn it. At that point, announcing to friends&#x2F;family enhanced my practice, because I knew it&#x27;d occur on X date and I knew the beastly passages would require dozens of hours of repetition each.<p>On the other hand, the number of pieces I have stated my intention to learn, and never done so, is far greater than the number of pieces I actually know. I think it&#x27;s just so easy to say &quot;I love this piece, I&#x27;m going to learn it.&quot; Well, that took 5 seconds to say, but it will take 100 hours to learn the piece.<p>So, for me, it comes down to how truly&#x2F;deeply motivated I am to begin with. If it&#x27;s something I truly want, announcing makes no difference. If it&#x27;s something I&#x27;m lukewarm on, I&#x27;m probably likely to announce something impulsively and commit myself to something I didn&#x27;t think through.", "by": "WhompingWindows"}, {"item_id": 21081921, "text": "I watched a TED talk about this years ago and recognized myself and my habits. I&#x27;ve since stopped announcing plans until I have a certain amount of concrete progress. Sometimes I still misjudge, and lose motivation. For me this applies for both small and big things.<p>Eg say I make plans to go to the gym tomorrow. If I tell someone I&#x27;m going to go to the gym, I am less likely to actually do it. If I keep my mouth shut I&#x27;ll probably follow through. I currently have an idea of something I&#x27;d like to do. It will take a lot of physical and emotional work. I&#x27;ve tried to make plans before and discussed them with some friends, and always after the discussions it never ends up happening. This time I&#x27;m not telling anyone until the plan is actually in motion.", "by": "drakonka"}, {"item_id": 21082249, "text": "I&#x27;m exactly opposite of that. If I announce plans, that adds an additional cost (embarrassment) to failing to accomplish them, which makes it less likely that I&#x27;ll procrastinate or abandon the effort.", "by": "JohnFen"}, {"item_id": 21083691, "text": "I really hate this article. Pretty much everything I&#x27;ve ever accomplished in my life is because I speak it into existence and hold myself accountable. But then again, if you&#x27;re the type of person who makes things happen, you don&#x27;t rely on crappy psychology studies to tell you how to live your life.", "by": "mrcoder111"}, {"item_id": 21084045, "text": "Note the followup link he posts at the end: <a href=\"https:&#x2F;&#x2F;www.bassam.com&#x2F;single-post&#x2F;CSI-TED-Talks-What-Derek-Sivers-Was-Really-Saying\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bassam.com&#x2F;single-post&#x2F;CSI-TED-Talks-What-Derek-...</a><p>Where it comes out in support of stating goals in some circumstances, and clarifies that what it&#x27;s really against is saying things like &quot;I want to be a lawyer&quot;, because then what that means is that you&#x27;ll be apt to behave consistently with <i>wanting</i> to be a lawyer, and not with taking the steps to actually become a lawyer. (Or how my yoga-instructor friend explained it, &quot;So then the universe responds, &#x27;ok, poof! You now want to be a lawyer!&#x27;&quot;)", "by": "tunesmith"}, {"item_id": 21083609, "text": "Caveat for team and organizations: often leadership announces grand initiatives with great fanfare and the lack of follow-up, perceived or real makes people cynical.<p>Unfortunately, you cannot avoid announcing your plans if you expect others to follow you - its possible people don&#x27;t understand what you want to achieve and end up just as frustrated. This is part of a leaders job.<p>I like what TA said about &quot;make sure not to say it as a satisfaction but as dissatisfaction&quot;- definitely keeping the focus on what you want to fix is better than the specific solution you&#x27;ve devised - you might end up finding a better solution anyway and people will help you do it.<p>Make announcements on small sub-plans often and follow-up even more often, so that people know feel that whatever you want to implement in your team&#x2F;organization is happening. Definitely tell them a long-term goal, but keep the focus on the next task that needs to be done. And make the &quot;small&quot; announcements at the moment you feel you are ready to answer all questions the team might ask you, but not earlier.<p>So, to be effective in an organization you need to do &quot;continuous announcing&quot; of small plans.", "by": "dimitar"}, {"item_id": 21082929, "text": "I don&#x27;t share ideas with many people anymore. Even ideas, and especially not goals. Any negative people are out, which unfortunately is too many.<p>The few that are trusted and have an analytical mindset are helpful for sound boarding, even if you don&#x27;t exactly get them to immediately quit their jobs and join you at <i>exciting-new-startup-here.tld</i>.<p>Finally, I try to spend more time in general with those directly contributing to achieve my goals, usually in the activity itself (e.g. work, training, study). Work can be harder to navigate because, well, I&#x27;m not responsible for firing ;-) but it is possible to at least move the needle.", "by": "mrslave"}, {"item_id": 21081578, "text": "That has the exact opposite effect on me. I actually use that method to shame myself into accomplishing what I&#x27;ve announced...", "by": "mzkply"}, {"item_id": 21081653, "text": "So true it happens to me many times. When I tell about the new idea or half done projects I feel less motivated to complete it.<p>So right now my lips are sealed on the current project that I am working and it&#x27;s coming in good shape as of now", "by": "SkyTreasure"}, {"item_id": 21083940, "text": "Wonder if the feeling of being overwhelmed by the work involved in carrying out said plans feeds into this somehow. I mean, it&#x27;s very easy to get carried away when planning things, and end up creating an absolutely enormous list of requirements you &#x27;need&#x27; to meet to finish the project, many of which may require knowing more about the field to proceed.<p>That&#x27;s certainly been an issue with my own projects, where the &#x27;plan&#x27; ends up being more in line with the current HTML 5 specification in terms of length.<p>Meanwhile whenever I don&#x27;t announce my plans&#x2F;write them down in any way, it works better because I just get on with stuff and stop get sidetracked by irrelevant details and extras.<p>Also, announcing plans publically gets everyone hyped up about something to the point its original creator may struggle to get said project to live up to its own hype.", "by": "CM30"}, {"item_id": 21081391, "text": "My experience confirms the decrease in motivation after anouncement of a new exercise routine, diet, or life plan. Keep it private unless you already have a 100% committment within yourself to follow through. I pre-announced that I was quitting smoking, but I was really ready, and haven&#x27;t smoked in 12+ years.", "by": "SubiculumCode"}, {"item_id": 21084408, "text": "The best thing I did last year was going to a gym 2 weeks before xmas and getting a membership and a trainer. I didn&#x27;t tell anyone, I didn&#x27;t make it my &quot;new year resolution&quot;, I just went and did it. I&#x27;m still happily chugging along about 10 months later.", "by": "magashna"}, {"item_id": 21081448, "text": "Depends on how you do it. Announce a launch date for your project and tell me you&#x27;re not 100% busting your ass to try and meet it.", "by": "RichardHeart"}, {"item_id": 21082852, "text": "While in general, I agree with not announcing plans until they&#x27;re finished, I do have two counterpoints<p>1) A year ago, I announced to in-person friends and on FB eliminating certain foods from my diet. Afterwards, it was easy because I could always remember I publicly announced it. Last year, it was chicken. This year, I added pork, soda, and processed meats. Haven&#x27;t touched them since.<p>2) If it&#x27;s very tangible and concrete then I find it works well. I announced writing daily for 30 days on my blog and successfully did it.<p>But yeah, general plans like I&#x27;m going to start a business or workout more usually fizzle out after the initial excitement.", "by": "peterxpark"}, {"item_id": 21087942, "text": "I find this incredibly transformative, more than I expected when clicking on the link.<p>Intuitively, I always believed that announcing my plans would sort of put me on the hook for completing them.  That if I announced something and later didn&#x27;t deliver, I&#x27;d feel ashamed.  Obviously avoiding shame wouldn&#x27;t be the only thing motivated me, but I figured I could add shame-avoidance to the list of motivations and make things overall stronger.<p>But this is definitely something to think about, and try to apply to myself.", "by": "kelnos"}, {"item_id": 21082826, "text": "I think the keyword in this article is intentions. Those should remain private, but anything else about your work can be discussed and managed and is frequently better to do so.<p>The modern concept of a self is a difficult thing. I don&#x27;t fully understand it. It seems to include a willingness to isolate and exile part of yourself. The boundary between what&#x27;s internal and external is the basis of a whole category of research, but the modern pop-psychology idea is just to run with it as if we could know.", "by": "friendlybus"}, {"item_id": 21085058, "text": "The article linked is not the one of the actual study. Here is the actual study: <a href=\"https:&#x2F;&#x2F;s18798.pcdn.co&#x2F;motivationlab&#x2F;wp-content&#x2F;uploads&#x2F;sites&#x2F;6235&#x2F;2019&#x2F;02&#x2F;gollwitzer-et-al-2009-when-intentions-go-public.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;s18798.pcdn.co&#x2F;motivationlab&#x2F;wp-content&#x2F;uploads&#x2F;site...</a>\nA cursory look shows the study talks about identity projection and actions (law students given extra material and asked to watch it, are less likely to watch it if they have told their observer they are going to watch it). However the difference is 1 minute of less watching and could be attributed to other factors.<p>Additionally, the same author has published research 5 years later (<a href=\"https:&#x2F;&#x2F;s18798.pcdn.co&#x2F;motivationlab&#x2F;wp-content&#x2F;uploads&#x2F;sites&#x2F;6235&#x2F;2019&#x2F;02&#x2F;ahn-et-al-2015-goal-projection-in-public-places.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;s18798.pcdn.co&#x2F;motivationlab&#x2F;wp-content&#x2F;uploads&#x2F;site...</a>) that explains goal projection in public places is helpful as &quot; is part of our everyday life and is fostered by high-goal commitment, perceiving others as similar, and ongoing goal striving.&quot;. So it is one thing to say you are going to be better at something by own self-study, but another when you are actually pursuing something and need help to achieve it. Announcing something allows you to connect with others sharing the same goal to get help or community, and shows you continue to be committed.<p>Feel free to read the studies and see if you can draw other conclusions, but this is not as black and white as the article claims.", "by": "dzink"}, {"item_id": 21081643, "text": "I always had some uncanny notion of this, and would keep my plans to myself.  For some things, it&#x27;s the way to go (like quitting your job and traveling). Probably b&#x2F;c you don&#x27;t need the external input; it only adds noise.<p>Yet I wouldn&#x27;t be so quick to discourage sharing and doing what it takes to stay motivated. External motivation is great, I wish I had more of it!<p>I reckon there is greater glory in stating what you will do and following through ftw... and yummy humble pie for you if you give up or fail.", "by": "angel_j"}, {"item_id": 21086884, "text": "I was torn on this. I don&#x27;t want to feel like I&#x27;m shouting into the void if I&#x27;m working on something creative, because I do want other people to see what I make eventually. It seems to be reasonable to say that criticism is helpful if you&#x27;re trying to get better at something (and take it in good faith). At some point that means releasing something to the public.<p>But I had been conflating finished work with the work needed to finish things. I&#x27;m also very tempted to reach out to people about what I want to get better at since I tend to seek validation externally. But only I can actually put in any effort towards my own goals.<p>Now my policy is to just shut up about it and put all that effort I could be spending speaking empty promises that haven&#x27;t been fulfilled into putting my head down and doing things myself. Reaching out to people comes after you have something to show.<p>At the same time I want to meet people who are creative and that means outing yourself as creative also if you want that connection. It&#x27;s hard putting in all that effort and being unable to talk to people about it.", "by": "nonbirithm"}, {"item_id": 21083072, "text": null, "by": null}, {"item_id": 21083815, "text": "Or as Al Swearengen put it on the best TV show ever, HBO&#x27;s <i>Deadwood</i>: &quot;Announcing your plans is a good way to hear God laugh.&quot;", "by": "smacktoward"}, {"item_id": 21081426, "text": "It definitely sets back the initial excitement or motivation behind a new idea, especially if it&#x27;s half-backed. Can confirm from experience.", "by": "dschuetz"}, {"item_id": 21082407, "text": "There&#x27;s another counter to this.  If you announce your plans but put a penalty on it for non-accomplishment it acts as a commitment device.<p>You should read about commitment devices in general but the idea is they FORCE you to do something you know you&#x27;re probably not going to do.<p>A good example is to tell your friend you&#x27;re going to run a marathon and if you don&#x27;t you&#x27;ll give her $1000.", "by": "burtonator"}, {"item_id": 21083137, "text": "Does reserving a domain name fall under the category of &quot;Announcing your plans&quot;?  If so, my experience absolutely correlates with this.  I might as well save my ideas to pocket.  At least that&#x27;s a free way to keep really interesting things I&#x27;ll never see again.", "by": "enobrev"}, {"item_id": 21088003, "text": "<a href=\"https:&#x2F;&#x2F;interruptions.net&#x2F;literature&#x2F;Wicklund-BASP81.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;interruptions.net&#x2F;literature&#x2F;Wicklund-BASP81.pdf</a>  Is my go-to reference article.  The idea of &#x27;symbolic self completion&#x27; resonates so strongly with my personal experiences that &#x27;talking depletes&#x27;.   The less said about what you&#x27;re working on, what your goals are,  how you want to be,  the better.<p>The book &quot;Ego is the Enemy&quot; also explains this effect. (It may have been the origin idea that led me to chase down the research paper in the first place)", "by": "audiometry"}, {"item_id": 21110830, "text": "So, do OKRs then make any sense?", "by": "indoor47"}, {"item_id": 21084501, "text": "The number of things that I have an impulse to accomplish vastly exceeds my physical ability to accomplish them.  This used to cause me great frustration but I’ve learned that I get a lot of value out of thought exploration, even if I can’t tell the difference between something I’ll want to stick with and something I’ll want to dump at any specific stage in the process.<p>If I announce my plans and am left without a need to follow through, that’s great. Apparently I didn’t really have a need for the thing, I just had a need for exploration, and I didn’t know that’s all I needed from the idea yet. I have plenty of things I want to do and can move on to the next thing.", "by": "furyofantares"}, {"item_id": 21082947, "text": "[Premature sense of completeness]\nSums it all. I&#x27;d also add that such negative behavior is encouraged in our society to the point where praise is given for anything said, which is not even done yet. Premature achievers as well indeed take the idea of making the first step further down the perdition road and assume it&#x27;s indeed even better to announce it publicly. I&#x27;ve always felt that speaking of what I plan to achieve is worthless because I knew I was seeking some gratification behind it, which sucked because why would you seek praise for what you haven&#x27;t done yet?", "by": "KangLi"}, {"item_id": 21082642, "text": "I do not find this to be the case at all.<p>My friends and coworkers are aware of my work on a particular ML task and are cheering me on. Every major hurdle and obstacle I&#x27;ve encountered is met with support and an unending eagerness to try my product.<p>I am so ready to get this out the door and I&#x27;m spending all of my free time on it. It&#x27;s going to be huge.<p>This has been a year long project that is the offshoot of another project that led me down this more exciting path. My investment is only getting more and more intense now that I&#x27;ve found the correct problem domain gradient to explore.", "by": "echelon"}, {"item_id": 21081732, "text": "I had never seen these ideas put down on paper but it is true for me.  My mind can be pretty satisfied with just thinking it knows how it would be if I accomplished something instead of actually doing it.", "by": "JohnJamesRambo"}, {"item_id": 21083235, "text": "Hm. I&#x27;ve heard the exact opposite e.g. if you want to keep yourself accountable about doing something then you should tell everyone you know that you&#x27;re doing it.", "by": "tempsy"}, {"item_id": 21088058, "text": "I think it&#x27;s just safe to say that it depends on what motivates you. It&#x27;s been known for a very long time that announcing plans creates a form of external accountability, which might be motivation for a number of people, but not for some.<p>So saying that announcing your plans makes you less motivated to accomplish them I think is too much of a blanket statement.", "by": "NoPicklez"}, {"item_id": 21085281, "text": "I don&#x27;t know about plans, but it does help to identify as &#x27;the person who...&#x27; as long as those are the attributes you want. The person who executes or the person who is in shape or eats well are all positive traits that can be cultivated and self-reinforce. For me, there is more general bang for the popsci buck in the above than announcing plans.", "by": "matwood"}, {"item_id": 21082644, "text": "I remember reading about this years ago (maybe this very article).  Announcing your plans seems to give you some of the satisfaction of having accomplished them, without actually doing anything.  So ... I don&#x27;t tell anyone if I&#x27;m planning a workout change, diet change, side project, etc, unless I figure I&#x27;ll need the peer pressure more than my internal motivation.", "by": "rootusrootus"}, {"item_id": 21085591, "text": "A thread from 2014: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=7496923\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=7496923</a><p>Discussed at the time (and submitted by the author): <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=660720\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=660720</a>", "by": "dang"}, {"item_id": 21085014, "text": "How about keeping a plan secret makes you more motivated to accomplish it.<p>In the opposite case, you were already rewarded before the successful action, in this case, you will only get the reward once it succeeds. It forces you to focus on accomplishing instead of on giving off the appearance that you will be successful.<p>Although often the former may depend on the latter.", "by": "zarro"}, {"item_id": 21081579, "text": "I&#x27;d word it differently:<p>&quot;Share your &#x27;go up&#x27; goals selectively... share your &#x27;go up&#x27; goals with everyone you possibly can&quot;<p>So, if you want to give up smoking, share that with everyone including your mailman.  They will help you on your path.  However, beware of sharing your &#x27;go up&#x27; goals - like starting a business - with others... they might drag you down.", "by": "Maximus9000"}, {"item_id": 21086024, "text": "But then again: dreaming about startups will help you avoid pursuing a crazy career with no guarantee that it will work out. I often dream about startups that I could do and vividly imagine how successful they’d be. It feels really good. Then I stop and tell myself that I’ll never do it", "by": "baxtr"}, {"item_id": 21084132, "text": "I&#x27;ve heard the exact opposite from a lot of people I respect. That announcing plans and communicating with your peers and getting support and accountability for your plans actually increases the likelihood of success.<p>But I mean, that doesn&#x27;t let you shit on the &quot;posers&quot; so whatever.", "by": "honkycat"}, {"item_id": 21082640, "text": "What about announcing deadlines and completion times that others will depend on? Won&#x27;t you feel more shameful if you can&#x27;t meet that and will work harder to meet that rather than secretly working to accomplish something with no repercussions?", "by": "sebringj"}, {"item_id": 21082343, "text": "The concept of &quot;vaporware&quot; seems relevant to this discussion. It&#x27;s easy to talk big and hype a product that doesn&#x27;t actually exist yet, but following through and getting the product shipped is a hell of a lot harder.", "by": "Porthos9K"}, {"item_id": 21087997, "text": "I definitely buy this. I&#x27;ve blogged about personal projects, and writing out plans for a project tends to take some wind out of its sails. It&#x27;s motivating to share progress, though.", "by": "doyoulikeworms"}, {"item_id": 21082982, "text": "I don&#x27;t disagree with the study results. I guess talking about a thing can be a substitute for doing it.<p>But as others have mentioned, publicly committing to a specific measurable goal can help others hold you accountable.", "by": "shanemhansen"}, {"item_id": 21091650, "text": "This is my personal way of doing things, if its my own plan where I wont need any outside parties, nobody hears about it", "by": "thatgerhard"}, {"item_id": 21084106, "text": "I&#x27;d be interested in seeing what happens when someone else announces your plans. You don&#x27;t get the same payoff, but still feel the obligation.", "by": "notjustanymike"}, {"item_id": 21081613, "text": "I generally find this is true. I work better on side projects and such if no one knows I&#x27;m doing it.", "by": "droobles"}, {"item_id": 21081421, "text": null, "by": null}, {"item_id": 21083254, "text": "How would this work in the context of work in a team? Say you have an idea for fixing a bug. Without telling the manager about your intent how could you actually work on it? The manager comes quickly to find where all your hours went doing what pursuit.", "by": "hi41"}, {"item_id": 21083349, "text": "Announcing plans is good because then you can actually get some satisfaction from it. You’re never going to accomplish anything anyway so you might as well take the happiness where you can get it.", "by": "viburnum"}, {"item_id": 21084210, "text": "yeah I have this feeling as well. At the same time if someone asking “what’s up?” and you say nothing, I feel like lying.", "by": "hartator"}, {"item_id": 21081872, "text": "53 days sober. Announced it at the start.", "by": "growlist"}, {"item_id": 21084314, "text": "Oh, thank God, I&#x27;m not crazy.", "by": "shadowmore"}, {"item_id": 21083312, "text": "How else can you get validation?", "by": "RocketSyntax"}, {"item_id": 21085635, "text": "#BuildTheWall\n#LockHerUp", "by": "ada1981"}, {"item_id": 21081355, "text": "poppycock", "by": "lerie"}]