[{"item_id": 21095694, "text": "Ah, corporate apologia.<p>&gt; Companies did move millions of office jobs to India, the Philippines and other places where they could pay workers less. But those job losses were more than balanced by growth elsewhere in the economy.<p>That&#x27;s like saying there will be an apple shortage but ignoring it because we grew more oranges.<p>&gt; But many companies discovered that labor savings were offset by other factors: time differences, language barriers, legal hurdles and the simple challenge of coordinating work half a world away. In some cases, companies decided they were better off moving jobs to less expensive parts of the United States rather than out of the country.<p>The thing is, rents and expenses continued to grow where these jobs used to be but wages stagnated. Offshoring is a contributor to wage stagnation, which would be acceptable if rents and expenses ebbed and flowed at the same pace. But wealth inequality and rent-seekers continue to squeeze the average person. The result is people who are underemployed or working multiple jobs.<p>&gt; Ms. Lund said she saw parallels between offshoring and automation: Both trends threaten one set of jobs but should make the overall American economy more productive, creating new job opportunities, albeit ones requiring different skills. And she said the pace of change should allow workers, companies and governments to adapt.<p>Learning new skills isn&#x27;t free. It will harm workers who have their jobs automated. Our employment system isn&#x27;t worker-friendly in this instance. Those displaced workers will still need to pay rent and buy food ALONG with buying new skills. They will probably end up underemployed.", "by": "dvdhnt"}, {"item_id": 21096415, "text": "I went on a date with a girl who does accounting for a VC firm in Menlo Park. She got career advice in ~2002 not to study CS because it would all be in India by 2015. My lucky-best decision was studying CS in 2002 right after the bubble burst, everyone was worried about outsourcing, and the smartphone revolution that led to 2009-present growth in tech hadn&#x27;t started. Talk about buying low.<p>I was recently talking to an Uber driver from Kenya who was saying rents in Nairobi, an African tech hub, aren&#x27;t that much cheaper than, say, Cleveland. So we&#x27;re past outsourcing...but Cleveland...", "by": "dehrmann"}, {"item_id": 21095751, "text": "That didn&#x27;t happen <i>yet</i>.<p>I think the biggest takeaway from gig economy &quot;gig brokerage&quot; platforms is that many people would rather take direction from an app than a human manager (conjecturally, for psychological reasons). If more traditional companies (retailers, businesses with other large output-oriented workforces, etc.) figured out a way to introduce this sort of algorithmic management model that works for them to either hide or replace management while also augmenting it, I feel like a great deal of middle-management bureaucracy could end up eliminated.", "by": "barbecue_sauce"}, {"item_id": 21095789, "text": "The impedance mismatch is just too high.  I haven&#x27;t been doing this <i>that</i> long, and I&#x27;ve already seen multiple cycles of outsourcing functions, dissatisfaction with the quality, speed, and communication overhead of the outsourced services, then bringing the functions back in-house locally.  Then a year or two passes, new directors or VPs come in, and the cycle begins again.<p>It&#x27;s a lot of churn.  One result is that I see with my enterprise customers is that they end up with a lot of the more expensive, experienced people getting thinned out in each of these cycles - IBM is one that is somewhat infamous for this.<p>The other that I see is a death of specialization.  There aren&#x27;t really dedicated network engineers, or ops specialists, or DBAs, or security experts in most companies anymore; everybody is a short-timer that is thrown into the mix and making things up on the fly.  And these are Fortune 500 companies, not fly-by-night SMBs.", "by": "thrower123"}, {"item_id": 21096441, "text": "I&#x27;ve always been irked by the assumption that more jobs = good when most people, especially white collar workers, go to work everyday knowing that their job is almost certainly replaceable or one that probably doesn&#x27;t actually need to exist in the first place e.g. a &quot;bullshit job&quot;.", "by": "tempsy"}, {"item_id": 21095736, "text": "I&#x27;d been expecting &quot;peak office&quot;. &quot;Peak factory worker&quot; was in the 1970s in the US. I&#x27;d expected that, with everything being computerized, total office employment would decline as well. Didn&#x27;t happen.<p>Why is an interesting question.", "by": "Animats"}, {"item_id": 21095627, "text": "The reason it didn&#x27;t happen is because many white-collar jobs require a good understanding of our culture and language, which isn&#x27;t required for factory jobs.", "by": "planetzero"}, {"item_id": 21095664, "text": "Wow, to think it&#x27;s been almost 30 years since I wasted money on <i>Decline and Fall of the American Programmer</i>. Too bad it was the first Yourdon book I&#x27;d read, because it was also the last.", "by": "mikestew"}, {"item_id": 21096040, "text": "Except.. it did happen.", "by": "ArtDev"}, {"item_id": 21095997, "text": null, "by": null}, {"item_id": 21095828, "text": "Hey I work for Nexient. Kind of cool to be in an article in the NY Times, less so perhaps for the ire directed at outsourcing.<p>I&#x27;m just a devops person. Would it be considered a majorly huge faux pas if I mentioned any details about Nexient&#x27;s careers? If so, I&#x27;ll edit and remove that previous sentence.", "by": "bloopernova"}, {"item_id": 21095643, "text": "paging Mr. Yang...", "by": "habnds"}, {"item_id": 21095707, "text": "A good strategy is to off-shore jobs in a function that is to be eliminated. When it comes time to close the operation down, there isn&#x27;t as much mid-level management inside the company opposing the closure. It also minimizes community and political backlash.", "by": "Merrill"}]