[{"item_id": 21099698, "text": "Their test setup isn&#x27;t realistic at all and looks more like a way to make the article sound interesting. Several big errors:<p>- They are testing a handheld radio that receives a single SDR signal. In reality a plane has two separate radios (different antenna locations) receiving a signal from a powerful antenna array at the end of the runway, that you try to squeeze your SDR signal in between. So the real attack is far different from their test setup, because you&#x27;re going to have several conflicting signals instead of only one that they calculate in the test.<p>- If you overpower the real signal, which needs a really strong transmitter, the monitoring equipment at the airport will easily detect it. That alerts the tower and they will not allow a plane to use the approach. This monitoring is even in place in simple en-route navigation beacons (VORs)<p>- They claim to be able to make a plane land short of the runway, but every ILS approach has an altitude check by the pilots that&#x27;s independent of the ILS signal. It works by checking the altitude based on air pressure (not spoofable) at a specific location (based on a system separate from ILS, usually DME or GPS) to the altitude at which the ILS puts the plane. If the two don&#x27;t match, the pilots will break-off the approach. That check is not a nice to have, if you skip it at a flight-test (every 6 months) you would fail.<p>- Their calculation needs to know where the plane really is. That&#x27;s easy to pull from the API of X-Plane (the hobby computer game they use as their simulator) but you don&#x27;t know in the real world, unless you can see the plane. If you can see the plane, the pilots can see the runway and they&#x27;re not going to be flying a CAT II or CAT III approach.<p>They also claim that no system exists to counteract this, but aircraft GPS systems all have mandatory error checking. If you fake a GPS signal, the receiver will compare it to the other signals and either ignore the fake signal (just like it will ignore a faulty satellite)  or if not possible to calculate a correct position refuse to fly the approach.<p>Another alternative already available for years is MLS (microwave landing system), that has a digital signal to tell the plane its position relative to the runway. You cannot fake that without making it obvious to the receiver that you have two conflicting signals and again refusing to fly the approach.<p>A DoS attack on airplane landing systems is absolutely possible by jamming either ILS, MLS or GPS signals. But making an airliner land next to the runway is really not as easy as this article makes it sound.", "by": "t0mas88"}, {"item_id": 21100104, "text": "The article fails to mention ILS integrity monitoring systems. They are mandatory for Cat II and Cat III operations.<p>ILS degradation is a well-known risk and concerns are mostly associated with environmental effects like signal reflections from other aircraft or airport vehicles. 1979 FAA report &quot;Far Field Monitor for Instrument Landing Systems&quot; explores the issue in depth: <a href=\"https:&#x2F;&#x2F;apps.dtic.mil&#x2F;dtic&#x2F;tr&#x2F;fulltext&#x2F;u2&#x2F;a079663.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;apps.dtic.mil&#x2F;dtic&#x2F;tr&#x2F;fulltext&#x2F;u2&#x2F;a079663.pdf</a>", "by": "mopsi"}, {"item_id": 21099244, "text": "The authors miss the simple defense of the air traffic controller politely asking the pilot where the heck they think they&#x27;re going and a quick exchange that would result in all flights diverted and the FCC chasing down the van  (or fleet of vans) with big radio transmitters and antennas.", "by": "colechristensen"}, {"item_id": 21099267, "text": "&gt; <i>even supporting cryptographic authentication on ILS signals would still leave systems vulnerable to record and replay attacks</i><p>Not necessarily? It should be possible to encode at least a timestamp so that a replay wouldn&#x27;t work; or even implement a challenge-response so that each plane has their own signal? Not trivial of course but possible...?", "by": "bambax"}, {"item_id": 21099158, "text": "It is an interesting vulnerablity.<p>But the one advantage of ILS against such attacks is that each site is separate and to try this at scale would require lots of co-conspirators.  It&#x27;s not similar to a GPS or other system-wide exploit.   Also, I guess you would need a highly directional antenna setup to be able to track a plane and overwhelm the legitimate ILS signal (i.e. why is that weird van parked here).<p>Attempt this at even one airport and you&#x27;d have law enforcement &#x2F; FAA on you very quickly with a penalty of getting sent to federal ass-pounding prison for tampering with life-critical navigation systems.", "by": "supernova87a"}, {"item_id": 21099439, "text": "A man was charged for jamming mobile phones signal while driving[0], so it&#x27;s not hard for the authority to find the perpetrator.<p>[0] <a href=\"https:&#x2F;&#x2F;www.theverge.com&#x2F;2014&#x2F;5&#x2F;1&#x2F;5672762&#x2F;man-faces-48000-fine-for-driving-with-cellphone-jammer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theverge.com&#x2F;2014&#x2F;5&#x2F;1&#x2F;5672762&#x2F;man-faces-48000-fi...</a>", "by": "a012"}, {"item_id": 21110252, "text": "this should NOT be publicized. hundreds of people&#x27;s lives are at risk and there are no workarounds for GA", "by": "anorphirith"}, {"item_id": 21102369, "text": "This is going against ILS systems, but the world is changing.<p>GPS WAAS is allowing approaches to minimums to almost any airport, even ones that do not have an ILS.<p><a href=\"https:&#x2F;&#x2F;www.faa.gov&#x2F;about&#x2F;office_org&#x2F;headquarters_offices&#x2F;ato&#x2F;service_units&#x2F;techops&#x2F;navservices&#x2F;gnss&#x2F;library&#x2F;factsheets&#x2F;media&#x2F;WAAS_QFSheets.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;www.faa.gov&#x2F;about&#x2F;office_org&#x2F;headquarters_offices&#x2F;at...</a>", "by": "eternalny1"}, {"item_id": 21104331, "text": "You may find this interesting <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=CXv1j3GbgLk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=CXv1j3GbgLk</a> in particular about the bleed of ATSB data from virtual world into real world.<p>It&#x27;s a semi-hypothetical Defcon presentation on insecure wireless communications directly with the aircraft.", "by": "wiseleo"}, {"item_id": 21099224, "text": "There is already a replacement for ILS developed and in use at a couple of big US airports and some international ones.<p>It consists mostly of a GPS station at an airport that broadcasts error corrections to aircraft who then use their corrected, satellite sourced GPS location data to land.<p><a href=\"https:&#x2F;&#x2F;www.faa.gov&#x2F;about&#x2F;office_org&#x2F;headquarters_offices&#x2F;ato&#x2F;service_units&#x2F;techops&#x2F;navservices&#x2F;gnss&#x2F;faq&#x2F;laas&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.faa.gov&#x2F;about&#x2F;office_org&#x2F;headquarters_offices&#x2F;at...</a>", "by": "colechristensen"}, {"item_id": 21101554, "text": "This is basically the plot of Die Hard 2 (1990), where bad guys take over the instrument landing system and make a plane crash on landing. <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Die_Hard_2\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Die_Hard_2</a>", "by": "kens"}, {"item_id": 21102485, "text": "&quot;Activate the instrument landing system but recalibrate sea level minus 200 feet.&quot;", "by": "forfengeligfaen"}, {"item_id": 21099272, "text": "This does not strike me as ethical disclosure. It would, as the author himself describes it, take a redesign of every craft, before making this research public would be safe.<p>He put a smiley face by the suggestion to use a drone transmitter FFS.", "by": "elif"}, {"item_id": 21103227, "text": "THIS is exactly what I&#x27;m talking about when I created my RadioInstigator tablet.<p><a href=\"https:&#x2F;&#x2F;hackaday.com&#x2F;2019&#x2F;06&#x2F;05&#x2F;mobile-sigint-hacking-on-a-civilians-budget&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;hackaday.com&#x2F;2019&#x2F;06&#x2F;05&#x2F;mobile-sigint-hacking-on-a-c...</a><p>Radio in all its forms has been considered a &quot;safe&quot; way to send and receive digital data. That was only because attacking signals was traditionally only in the hands of nation-states. The hardware and know-how was erudite and tremendously expensive. That quaint idea is no longer true.<p>Locally, our city is installing IoT water monitors that chirp out consumption every 1&#x2F;2-1h. A simple replay attack could cause peoples&#x27; water bills to go in excess of $30k. Our power meters are similar.<p>The tornado siren alert structures also sit on 400MHz spectrum, and are trivial to remotely trigger with no way to turn off. The system was built to trust any radio signal that it understands, full stop.<p>So seeing that planes are also attackable this way is obvious to me. Of course the authentication&#x2F;authorization&#x2F;auditing&#x2F;encryption&#x2F;signature part of the stack cost money, so was not included.<p>What do we do? Well, <i>We</i> (royal) fix the grid in all places to do things right. Individually, be wary and very careful in the radios you put in your vicinity.", "by": "crankylinuxuser"}, {"item_id": 21103376, "text": "The comments in here are pretty solid.  I would just add a couple of points:<p>1)  Spoofing both localizer and glideslope signals will not be easy.  The glideslope transmits from an antenna beside the runway abeam the touchdown aim point, while the localizer antenna is at the far end of the runway.  It would be difficult to overpower both at the aircraft without being detected by integrity sensors at the airport (possibly even &quot;near the airport&quot; in countries concerned with spoofing).  You can&#x27;t just light up a plane with signals of similar strength; the spoofer must be many many dB stronger.<p>2)  Crews are trained to watch the plane and overall situation closely.  Not only do they want to see the needles centered, but there are checks of altitude versus distance along the approach.  That&#x27;s DME distance versus altitude, VNAV profile, and &quot;reasonable&quot; radar altimeter data.<p>3)  Any instability caused by the spoofing is likely to trip the on-board integrity sensing and cause an INOP alert on modern aircraft.  Also, a hinky-jinky ride on an ILS that&#x27;s been crudely spoofed may induce the crew to execute a missed aporoach.<p>3)  With (augmented) GNSS and integrated, multi-mode navigation on modern aircraft, the crew will see a deviation from the correct path.<p>4)  The (enhanced) ground proximity warning system would detect a movement trend toward &quot;terrain other than the runway.&quot;<p>Of course, if the target is not a well equipped, modern aircraft, spoofing the ILS may work.<p>Alright, that&#x27;s my 2 cents as a radio and cypherpunk with multiple Boeing type ratings...", "by": "nutcracker46"}, {"item_id": 21099663, "text": "ff", "by": "plxity"}]