[{"item_id": 21097557, "text": "Physician here.<p>The problem with this law is it takes the medical reimbursement contract system and then shoots the physicians in the back.<p>When insurance companies are trying to get people to join their network, they offer competitive rates.  Once they are large enough, they start to exert downward pressure on physician reimbursement to both existing and new medical service providers (hospitals and physicians).  The only way to counteract their pricing power is to be willing to walk.  Physicians do not like going out of network; the insurance companies make it incredibly painful, refuse to pay you, and instead send the check to the patient who is expected to deposit it and forward it to the patient (if they pay at all).<p>However, what has happened post-ACA is massive consolidation across the medical services sector so that large staffing companies would deliberately go out of network to force better rates strategically.  It was no longer the individual physicians choice whether or not to out of network; rather their employers&#x27;.<p>However, these laws are a huge gift to the insurance companies.  They remove the physician&#x2F;hospital&#x27;s ability to negotiate, and already, we are seeing insurance carriers refuse to negotiate or offer rates greater than 125% of Medicare.  It also completely eliminates the incentive for insurance carriers to even bother creating a provider network.  This is not the intent of the law and fundamentally is acting as a wage-cap.<p>Medicare rates are intentionally set by fiat and often below the cost of goods sold.  125% of Medicare is an arbitrary &quot;sounds good&quot; number that is not helping anyone but the insurance companies.<p>Instead, a better version of the law would be to have payments indexed to the FAIR health claims database [<a href=\"https:&#x2F;&#x2F;www.fairhealth.org\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fairhealth.org</a>].<p>Yes, I agree the medical reimbursement system in the US is not ideal; however, this is tantamount to price fixing which in EVERY thread on compensation for software engineers, people think what Google&#x2F;Apple&#x2F;et Al did to prevent wage increases and poaching was unethical and unfair to workers.  I don&#x27;t think this is any different.", "by": "riahi"}, {"item_id": 21097173, "text": "I once got a surprise bill from in-network ER because they invited a specialist for consultation, That specialist sent me a separate bill later.<p>No one told me upfront it will cost additional $450 to hear from the specialist that &quot;sometimes kids are having stomach pain for no any reason&quot;.<p>Edit: Additional information - Blue Shield CA HMO, Cedars-Sinai ER , circa 2012. $150 ER co-pay, later $10,000 bill fully paid by insurance + $450 specialist bill not covered by insurance.", "by": "coolspot"}, {"item_id": 21097317, "text": "It should go further. End the in-network &#x2F; out-of-network crap. One price per procedure that is the same for all customers. All providers should accept all insurances. The system we have is insane.", "by": "imgabe"}, {"item_id": 21097979, "text": "Just today I called my local hospital asking them how much they were going to charge me for an ultrasound <i>Id already preformed</i>. I’m in the middle of a qualifying life event and the new insurance retroactively kicks in.<p>I need to know how much this will cost to decide which plan is better, mine or my spouses.<p>The lady didn’t know how much they would charge. This is the only industry where they don’t know how much they’re going to chi argue me <i>after the procedure</i><p>An orange farmer has a price for his oranges months before his orange trees blossom.<p>These geniuses can’t figure out the price after they delivered the product.<p>BS", "by": "zbsnsbskd"}, {"item_id": 21097267, "text": "Here’s the report the NYT drew much of their data from: <a href=\"https:&#x2F;&#x2F;health-access.org&#x2F;wp-content&#x2F;uploads&#x2F;2019&#x2F;09&#x2F;ha-ab72report-092619.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;health-access.org&#x2F;wp-content&#x2F;uploads&#x2F;2019&#x2F;09&#x2F;ha-ab72...</a>", "by": "floatingatoll"}, {"item_id": 21097438, "text": "This is extremely welcome and much needed change BUT please, everyone reading this, pay attention to the fact that IF you get healthcare through your employer (aka &quot;Group&quot; health plan), this regulation MIGHT NOT APPLY to you and your plan if your employer did not purchase the plan through the ACA marketplace!<p>Group health plans are, EXEMPT, from most state regulations. I know it does not make sense and sounds unbelievable but unfortunately your employer has more lobbying power than you do!<p>As a result you, the employed, could still be on the hook for hundreds of thousands of dollars in surprise medical bills with little recourse (because you are employed and don&#x27;t qualify for financial relief) and can have your wages garnished, which WILL be exercised by the provider if you refuse to pay the bill.<p>The providers are OON precisely because they make more money that way and there&#x27;s little reason for them to be in-network (they have nothing to gain by being in network!)<p>So if you go to the ER today in an ambulance - that&#x27;s highly likely to be OON - and have your XRays and&#x2F;or CT scans read by a radiologist that&#x27;s also highly likely to be OON and attended to by specialists that are also highly likely to be OON, you ARE on the hook for everything unless you&#x27;re lucky enough to have a CA state regulated health plan.<p>Most individual plans purchased through the ACA marketplace are required to be in compliance with the regulations of the state that the employee is resident of.<p>Group health plans are not.<p>If your employer did not purchase the plan through the ACA marketplace, even if the plan is ACA compliant, it might not be required to comply with the regulations of the state that the employee is resident of as long as it&#x27;s in compliance with current federal regulation of health benefits.<p>This can take a lot of employees by surprise, specially employees of multistate employers where the employer chooses the cheapest plan in compliance with current federal regulations without necessarily looking into state level details.<p>I put in some details here: <a href=\"https:&#x2F;&#x2F;www.quora.com&#x2F;In-the-US-the-majority-of-people-under-65-years-old-have-health-insurance-through-their-employers-What-is-the-logic-behind-tying-health-insurance-to-an-employer&#x2F;answer&#x2F;Subhobroto-Sinha-1\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quora.com&#x2F;In-the-US-the-majority-of-people-under...</a><p>I really hope each of you take measures to decouple health insurance from employment.<p>How do we, in this day and age, still think, an employer has the right to solely dictate the standard of care we receive?<p>Please, if you think it&#x27;s logical to so severely and tightly couple health insurance with your employer, let&#x27;s have a discussion.", "by": "subhobroto"}, {"item_id": 21096983, "text": "tl;dr version, law works as expected and takes money out of the pockets of people who were over charging. They are mad and so they are throwing around as much FUD as they can dig up in an effort to keep this from spreading.<p>I know, the question of &quot;over charging&quot; is a difficult one to answer. All of the evidence on people willing to be doctors in California suggests that there are plenty of suppliers who will work willingly in the new system. That says to me it is working as intended.", "by": "ChuckMcM"}, {"item_id": 21097404, "text": "had a child born in a hospital in the bay area before this law and had the anaesthesiologist send a bill that looked he typed it on his typewriter. Wasn&#x27;t even one of the official one&#x27;s you see from a dr&#x27;s group. No website, no email, just the guy&#x27;s personal #.", "by": "sabujp"}, {"item_id": 21097246, "text": "Socialized healthcare works.  Capitalistic healthcare works.  This ungodly mess we&#x27;ve created in the US that combines the worst aspects of both doesn&#x27;t work.  When everything is secret and there&#x27;s no actual competition between providers but also no regulatory controls to prevent abuse you get the worst possible results.", "by": "Causality1"}, {"item_id": 21097175, "text": "You had me at &quot;angering doctors.&quot;  If that was all the law did it would still be worth it.", "by": "gok"}, {"item_id": 21097396, "text": "While I agree with the sentiment behind the article I think it is disgustingly and unnecessarily subjective. They have stripped their readers of the basic human desire to make up our own minds about what they read. Shame on them. The irony with my comment it that it is not in the least bit objective. Shame on me.", "by": "davidhyde"}]