[{"item_id": 21100287, "text": "Mirror: <a href=\"https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20190928130035&#x2F;https:&#x2F;&#x2F;fant.io&#x2F;p&#x2F;hacking-voi&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20190928130035&#x2F;https:&#x2F;&#x2F;fant.io&#x2F;p...</a>", "by": "fwr"}, {"item_id": 21100152, "text": "Reminds me the time we integrated a web survey with giftbit (api driven gift card service). While developing this for our client I had this nagging sense that we needed to rate limit or block multiple submissions by a single email but the client wanted it to ship ASAP and not take the extra time to have some validation flow.<p>Day 1 - 8 legit surveys each getting $50 amazon card\nDay 2 - just over a hundred with 90+ being the same gmail account. \nDay 3 - out of credits, campaign over.<p>Between this and the Voi write up I think it’s important to have a dark mind in the room to avoid stuff like this being so trivial. Some hacks you hear about and the first thought is about how gifted or smart the hack&#x2F;er was, other times you just think how dumb the developer was. I’ve been on both sides of this and while I’m not proud of it I think the stories like these keep people on their toes.", "by": "social_quotient"}, {"item_id": 21101469, "text": "This doesn’t feel like much of a “hack”, it just leveraged the fact that an email address is all that’s needed to create an account and get a promo code. in the end he just has 1000s of accounts with $10 of promo credits each. His plan is to switch accounts every time he runs out of credits, seems like the easiest solution from Voi’s perspective would be to expire promo credits after a few weeks.", "by": "femto113"}, {"item_id": 21102052, "text": "Was the content on the site taken down? It appears by clicking on the link that we are being directed to the blog itself not the blog post.", "by": "zitterbewegung"}, {"item_id": 21100332, "text": "I&#x27;d be willing to pay any reasonable amount to use one of these for short trips, but please make a model using bigger wheels or any bump in the road would either destroy them or my back, probably both.", "by": "squarefoot"}, {"item_id": 21102230, "text": "Lots of these scooters in Malmo, Sweden and I see local kids getting rides for free by &quot;ending the ride&quot; while pulling down the throttle as the scooter is being unlocked.<p>I&#x27;ve never done it, I&#x27;ve just heard about it, quite a lot.", "by": "dijit"}, {"item_id": 21106416, "text": "I read this on LinkedIn a few days ago and what immediately struck me is how irresponsible the post is. 90 day disclosure deadlines and the practice of responsible disclosure is well established.<p>In the author&#x27;s own timeline it&#x27;s clear he gave Voi 9 days to respond before publishing all the details. This kind of conduct reflects poorly on the whole security community and I assume someone told the author this, resulting in the unpublishing of the post.", "by": "K0nserv"}, {"item_id": 21099935, "text": "Would the author be in trouble by posting this? I really hope he would not.. I&#x27;m just afraid there&#x27;s some sort of clause upon registration against this sort of hacks..", "by": "blacksoil"}, {"item_id": 21102923, "text": "IMO cert pinning isn&#x27;t all that important.<p>The number of painful outages caused by cert pinning versus the actual security benefit isnt worth it IMO. But the truth is that random app dev doesn&#x27;t have their shit together enough to do pinning right.<p>Don&#x27;t believe me? AWS recommends the same<p><a href=\"https:&#x2F;&#x2F;aws.amazon.com&#x2F;blogs&#x2F;security&#x2F;how-to-prepare-for-aws-move-to-its-own-certificate-authority&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;aws.amazon.com&#x2F;blogs&#x2F;security&#x2F;how-to-prepare-for-aws...</a><p>If you&#x27;re Chase, or PayPal, sure. But if you&#x27;re random startup with a crappy app, don&#x27;t bother IMO.", "by": "cheeze"}, {"item_id": 21100324, "text": "Post seems to be deleted.", "by": "raihansaputra"}, {"item_id": 21101318, "text": "Original removed, web archive: \n <a href=\"https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20190928130035&#x2F;https:&#x2F;&#x2F;fant.io&#x2F;p&#x2F;hacking-voi&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20190928130035&#x2F;https:&#x2F;&#x2F;fant.io&#x2F;p...</a>", "by": "eskpe"}, {"item_id": 21101353, "text": "Original article<p><a href=\"https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20190928113147&#x2F;https:&#x2F;&#x2F;fant.io&#x2F;p&#x2F;hacking-voi&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20190928113147&#x2F;https:&#x2F;&#x2F;fant.io&#x2F;p...</a>", "by": "xkcd-sucks"}, {"item_id": 21100288, "text": null, "by": null}, {"item_id": 21100149, "text": "If you&#x27;re gonna commit multiple crimes, at least do it for a significant amount of money. This is just not worth it, and trivial to get caught.", "by": "bufferoverflow"}, {"item_id": 21102140, "text": "&gt; One would think that the more well-funded companies had thought more about their tech and would be good at preventing fraud. However, that isn&#x27;t the case.<p>There is a mostly Western idea that money means you have considered everything right and are rewarded from that<p>This is such a huge distortion and I don&#x27;t understand it, almost seems like it is a necessary religious doctrine to make people comfortable with pursuing this system", "by": "rolltiide"}, {"item_id": 21100295, "text": null, "by": null}, {"item_id": 21100500, "text": "Please don&#x27;t make these &quot;Potential improvements&quot;<p>- use SSL pinning.<p>- block different GMail emails from the same Google user.<p>- prevent different users from using the same credit card.<p>These are user hostile. I see no legitimate reason to do so. Though limiting coupon use with same base email&#x2F;card&#x2F;.. is reasonable.<p>- require more information than just an email address.<p>Maybe you need to (e.g. theft) but coupon reuse prevention is overreaching.<p>- don&#x27;t email the promo codes in plain text. ... It could also be built as a deep link into the app<p>Is this assuming iOS use and opening the mail on the phone?<p>EDIT:<p>If you disagree, please state the reason.<p>To elaborate:<p>Paying for your kid, spouse or friend from a single card seems reasonable. Not everyone has lots of cards.<p>As for email canonicalization: What if you lose access to your account, want one for kids, separating work&#x2F;personal .. don&#x27;t do it by default unless you do have a good reason. You&#x27;re just adding minor inconveniences and possibly serious vulnerabilities (using random email forwarders along with typical email password resets).<p>Certificate pinning to deny user access - your APIs should be secured by making them secure and it will actually work. Data itself (also) belongs to the user, not (only) to the service provider. Some may disagree, but laws in some countries state so.", "by": "labawi"}]