[{"item_id": 21099418, "text": "Congratulations to the EU commission and the EU parliament on achieving the exact opposite of what they wanted to do despite being told this would happen and despite it actually already happening in Spain and Germany. It&#x27;s not like this is any kind of surprise, it&#x27;s the only logical thing that could&#x27;ve happened. I am still extremely bitter about the dirty way this  law was passed, the lies, the deliberate lies by the commission, the nasty response EU politicians had at protesters and the absolute contempt they had for young people saying they we&#x27;re entitled children trained by internet giants to expect free things. I watched the debates in parliament and there were MEPs who actually said that. The horsetrading France and Germany did over Russian gas in order to get a deal on this law. That disgusting blog post the EU commission published calling people who disagreed with them bots and brainwashed and positioning themselves literally as knights out to slay the google dragon. It&#x27;s all horribly corrupt and cynical. I&#x27;m  sure many young people got the message that their leaders view them with such absolute contempt and open hatred and I fear the consequences for Europe.", "by": "pavelludiq"}, {"item_id": 21099449, "text": "I really wish traditional news media, aka those people that are supposed to dissaminate the news, would get a grip and stop breaking the internet and their core business altogether one of these days. If you lose revenue because google shows a few sentences of the introduction your content is not worth it to readers. But no, instead of better content and easier ways to consume it, we get more clickbait and whining about fake news.<p>At least on the level of local newspapers in Germany it&#x27;s a complete disaster for me personally. It&#x27;s not even that I wouldn&#x27;t want to pay people that go out and report on local happenings, it&#x27;s just that I don&#x27;t want to add another 10-20EUR subscription for the 1&#x2F;2 articles I&#x27;d want to skim that&#x27;s actually relevant content and not some made up outrage or simply agency content.", "by": "tastroder"}, {"item_id": 21099434, "text": "Users will have less incentive to click on links without a little preview. Publishers will scratch their head about numbers getting worse. Smart publishers will enable previews. Soon, everyone will enable previews.<p>Well done!", "by": "Traubenfuchs"}, {"item_id": 21099538, "text": "I am in favour of this.\nIf a site is doing the work of providing content (news, sport game scores, weather, ...) and Google passes by, scrapes the most important information and shows it on their own site, a large swath of users will never visit the content provider.<p>The one providing the content has rights to his content.", "by": "oaw-bct-ar-bamf"}, {"item_id": 21099519, "text": "Reminds me of when news publishers tried to do the same in Germany and then lamented the drop in click through rate.<p>Lobbyists for magazines and newspapers got the EU to put this law into effect and I&#x27;m glad they&#x27;re going to be the ones who suffer the worst. If your news story is so short it can be explained in a thumbnail and the two lines Google shows, you don&#x27;t have anything of value to protect.", "by": "jeroenhd"}, {"item_id": 21100085, "text": "After reading the comments (on HN) and the law I think this is a good thing. I’m rather confused by the visceral response by some people on HN.<p>It may be an unpopular opinion, but Google was stealing. They were showing enough information no one was clicking the links. What this means for content creators is that you couldn’t make revenue.<p>If I search for something on Google I get so much information above the fold (and ads), I pretty much never see a real site. That’s a serious issue, because Google isn’t creating that content. Worse, their using their monopoly to push the AMP framework to make it easier to get snippets and actually serve your content on their servers.<p>No, this doesn’t have to be the end of the world. Almost all decent sized websites add their own preview and snippets (which Google can display). So all it does is enable further controls to publishers.", "by": "lettergram"}, {"item_id": 21099436, "text": "Almost there... just a small effort and Google News will look like Hacker News.", "by": "rq1"}, {"item_id": 21100540, "text": "This reminds me of the daily posting on reddit in the GPDR subreddit. People are shocked that the countries outside the EU are not respecting the GPDR. Or more shocked that a website would rather not do bushiness with or block people in the EU from seeing their website. Most times a website put up bannersaying &quot;yadda yadda cookies...privacy...agree&#x2F;disagree?&quot; and that&#x27;s that.", "by": "dghughes"}, {"item_id": 21099564, "text": "EU is the nightmare for every startup with all that laws. No time to develop the product, because there is a lot of bureaucracy that take all your time.", "by": "ifthenelseend"}, {"item_id": 21102986, "text": "This law is pointless ,\nit was tried  in germany and spain,\nresult,google news  closed down.\ngoogle news   provide a  service  ,\nfree , no ads.\nif a newspaper wants to get  paid for links  or snippets,\nit should  expect that most websites   will opt out.\nThe result   is less traffic to  newspaper websites,\nsee google reader, google plus etc \nno one can force google  to provide a  service, \neven if it has  millions  of users.\nIf it   does, not  fit  in google,s  plans the service  \nwill disappear  .\nIT  WOULD Be  disastrous   if google actually paid for  a  snippet,\nIT,S ,  a slipperly  slope,\nnext thing   is    google will  have to  pay to  link \nto Any european  news  or list them in the  search results.\nSay i,m looking  for   news on brexit,\ni should  not have to go to  30 different  websites,\ngoing to google news   is a  much better option.<p>The european  newspaper companys     remind  me of   of  \nmusic companys   in the 90,s   ,\nthey were  facing  declining sales of cds,  ,\nmusic piracy,\nthey launched  apps  or   various mediocre incompatible  music  service,s  \nwith drm  some of which only worked  on phone,s  or pc,s  \nor various devices, and used  various    ,\nIt required   steve jobs   to  appear  and apple to invent the  ipod     and itunes ,\na simple service   ,buy  music, buy albums,  ,1 song for 99 cents  ,all music  in mp3 format.\nThen  streaming  came along    and the music  industry   \nis actually  making more  money every year  as   people  \nget used to paying subscriptions  for apple music, spotify etc\nThe  News  industry  needs     a tech  genius    \nto come along  who knows  how the web works  ,\nwhat users  want,  what they  will pay for  ,\nMaybe   have   a  website,\nNew,s .fr,\nnews,germany.com,\nnews,spain.com  etc\nWhere  any  news paper  or blog    can post links  to  news storys  or any  article.\nWIth  ads  if they  want   ,\nAny news paper with  a website can  post on  the  \nwebsite,  it would   be run by  a  semi independent board,\nso its not under  the control  of just one  company .", "by": "riclad1"}, {"item_id": 21101588, "text": "&gt; The change means French users will only see the headlines and not the first few lines or a thumbnail image for news content unless European publishers specifically request to show previews, the company said.<p>I&#x27;m guessing some publishers will give permissions and eventually forcing others to follow suit when they start losing traffic.", "by": "pkaye"}, {"item_id": 21099580, "text": "Google has also started classifying non-news sites as being news sites and no removing snippets from them. I have already had to manually change the designation in the Google Search Console on a couple of sites that I look after this week after Google flagged them. I&#x27;d recommend that site owners check in the search console to see if they are affected.", "by": "theboulevardier"}, {"item_id": 21100432, "text": "I&#x27;m a bit confused by this because Google News has only been showing headlines since their last redesign. I guess they will stop showing images as well? I think that would be an improvement.", "by": "skybrian"}, {"item_id": 21103074, "text": "How does Google rank pages with and without  nosnippet?", "by": "andrerm"}, {"item_id": 21100206, "text": "This is why more countries need to break away from the EU.", "by": "remotecool"}, {"item_id": 21101397, "text": "I&#x27;m surprised it didn&#x27;t happen sooner and all over the world.", "by": "OrgNet"}, {"item_id": 21106396, "text": "Websites do have enough possibilities to restrict legal access to their content. Google is respecting entries in robots.txt for search restrictions.<p>If some media lobbyists are whining about Google not paying for their news snippets they talk about it like they are forced to show snippets from their site on Google but in fact, they are not. They just want to cash grab successful internet companies and initiate a smear campaign against them like it is done in several newspapers in Germany in the last few weeks.", "by": "Equanimous"}, {"item_id": 21099369, "text": "Is this the fallout of Article 13 we&#x27;re starting to see?", "by": "Kenji"}, {"item_id": 21100163, "text": "Not that Google News is any good. My newsfeed is basically far-left propaganda.<p>I would almost go as far as to say that this is a good thing for France.", "by": "nkkollaw"}, {"item_id": 21099471, "text": "How the eu fights American big tech. Compare it with how China fights American big tech ...", "by": "chvid"}, {"item_id": 21099501, "text": "Good, I believe media outlets will benefit, unless Google deliberately undermine their business model in some way. As a deterrent for others.", "by": "mola"}, {"item_id": 21099574, "text": "This would have been a logical part of robots.txt from the beginning. Under an earlier Google this would probably not have been allowed to escalate this far.", "by": "xorcist"}, {"item_id": 21099595, "text": "This is good. More clicks to the news sites and google is more like Reddit now. But it is sad that there had to be a law for that. Gooogle should give the option to remove anything but the title from the page result (is this possible?).", "by": "buboard"}, {"item_id": 21102399, "text": "Google is still a new phenomena, and we are still trying to come to terms with it as a society.  It&#x27;s the first global monopoly, and it&#x27;s on <i>information</i>.  Holy cow, that&#x27;s just strange.<p>I applaud the EU for at least attempting to grapple with the potential existential threat that Google represents, rather than rolling over and pretending nothing is wrong as the US does; or censoring, as China does. Even though I think the specific solution is probably unhelpful, it&#x27;s <i>much</i> better than pretending that everything is as it should be, and crowing when newspapers get their &quot;comeuppance&quot; when Google punishes them by reducing their traffic.", "by": "rendall"}]