[{"item_id": 21102453, "text": "The list of limitations of the jailbreak is itself interesting as it shows the benefits of defense at depth: even if you have this exploit you need physical access, Secure Enclave is still inaccessible etc.<p>Compare to the &quot;firewall&quot; approach which is crunchy on the outside but nice and soft on the inside.  Snowden showed the NSA intercepting unencrypted internal comms between google&#x27;s and yahoo&#x27;s respective datacenters.  And our IoT devices are often exploited vectors.<p>Interesting the Apple wouldn&#x27;t even consider their own <i>device boundary</i> adequate.  Compare to others who (used to?  Still do?) keep, say, fingerprint data in the filesystem.  Some people say code structure reflects organizational structure; I wonder if apple&#x27;s own corporate structure (with internal inter-project secrecy, which I consider insane) lead in part to this approach: &quot;I can&#x27;t trust those other organizations writing system code to use the security features I put in so I&#x27;ll consider them a kind of adversary too&quot;", "by": "gumby"}, {"item_id": 21103632, "text": "The article makes repeated mentions of the lack of persistence (rebooting the phone removes the exploit), suggesting this makes it very little of a security threat.<p>However, most people reboot their phone very rarely: the occasional software update a couple times a year; if the battery runs out (which people usually go to pains to avoid); or for some people, to try to fix a misbehaving phone.<p>The exploit does require physical access to the phone for a few minutes. But in situations where that can happen, and the owner doesn&#x27;t have the suspicion or knowledge to reboot, I think an exploit could easily run for one or several months.<p>Paired with enough clever software modifications made possible by the jailbreak (like a lock screen that collects passcode input), a malicious instance of this could do plenty of damage.", "by": "pweezy"}, {"item_id": 21100797, "text": "I’m wondering about the economics of this release. I don’t know if Apple has any bug bounty program and whether it would apply here, but I’m pretty sure <i>someone</i> would have paid a lot of money for this.<p>Hence my question: why make it public? What’s the backstory?", "by": "Ecco"}, {"item_id": 21100132, "text": "I’ve heard some people taking about using a raspberry pi zero or some other microcomputer to apply the exploit on boot, which sounds quite interesting.<p>As someone who used to jailbreak back in the day, this news was really exciting. However looking at it in a mature way than I did back then, it’s also slightly worrying that a whole class of iOS devices have a severe and unpatchable security flaw.", "by": "jpxw"}, {"item_id": 21100272, "text": "This is great news. After a decade of stagnation [1], an exploit that in theory allows Linux (and Android) to be ported to iPhone, iPads, Apple Watches, and I believe, Apple TV.<p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;OpeniBoot\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;OpeniBoot</a>", "by": "shasheene"}, {"item_id": 21100492, "text": "So somebody could make a battery case that also jailbreaks your phone (if you trigger DFU mode)?", "by": "herf"}, {"item_id": 21100389, "text": "While this is great for the concept of jailbreaking, in practice I think it will be mostly academic. The devices this supports are already old, which doesn’t give much excitement to the process. The ecosystem of libraries, apps, stores, etc. around jailbreaking is in a dismal state, if it really even exists anymore.<p>I really don’t expect a thriving marketplace to spring up again like we had in the old days.<p>I do think it will be very useful for people doing security research, as it will allow them to access the full running images of supported devices.<p>EDIT: Since people seem to be wildly missing my point, I clearly need to spell it out: The community and the ecosystem is what made jailbreaking great, and while this very cool work done, this isn&#x27;t going to usher in a new golden age of jailbreaking because the community and ecosystem isn&#x27;t there.", "by": "orev"}, {"item_id": 21100259, "text": "It seems if I read the article correctly that you can&#x27;t use this to capture the PIN and further unlock the data, but I don&#x27;t understand how Apple can make the phone secure against that (that is assuming I have understood the article).", "by": "rwmj"}, {"item_id": 21102687, "text": "-<i>If you are doing tracking in real time, you can see what&#x27;s happening. If you want to, say, explore what happens when your phone goes to a website, you can&#x27;t do that if you don&#x27;t have a jailbreak because Apple doesn&#x27;t give you the specific permissions that you need to see things happening at such a low level on your phone.</i><p>How is this different than MITMproxy, Burp Suite, Charles combined with setting iPhone to proxy the traffic through your machine?", "by": "punnerud"}, {"item_id": 21100086, "text": "&gt; The exploit allows only tethered jailbreaks, meaning it lacks persistence. The exploit must be run each time an iDevice boots.<p>Could it be made to persist?<p>&gt; Checkm8 doesn&#x27;t bypass the protections offered by the Secure Enclave and Touch ID.<p>Could it be made to bypass the Secure Enclave?", "by": "MuffinFlavored"}, {"item_id": 21100102, "text": "So it is necessary to know a device&#x27;s PIN to apply this jailbreak?<p>The article refers to Secure Enclave and how its protection cannot be bypassed, but it&#x27;s unclear whether the PIN itself (and entering the DFU mode) is protected by the Secure Enclave.", "by": "factorized"}, {"item_id": 21104265, "text": "If apple knew about this exploit (given the patched the boot ROM on the newer phones), will iPhones that ship after a certain date have this fixed?", "by": "sargun"}, {"item_id": 21102177, "text": "I&#x27;m not really into the jail breaking &#x2F; free software &#x2F; right to repair side of this issue. I&#x27;m more interested in jailbreaking iOS devices because I believe they are incredible alternative to Raspberry Pi. If you consider how cheaply you can find a used iPhone 4S and what it&#x27;s capable of, vs. a Raspberry Pi (as much as I love them) the engineering of the iPhone SOC really becomes stark in comparison. I&#x27;d rather be writing Swift code and loading it onto an iPhone.<p>I believe an old iPhone could potentially make for a great DIY drone mainboard&#x2F;controller.", "by": "ryanmarsh"}, {"item_id": 21100606, "text": "The right to repair must include the right to root.", "by": "arminiusreturns"}, {"item_id": 21100754, "text": "It’s been a while since I used jailbreak on an iOS device, but I remember the “benefits” being pretty skimpy. “You can install anything you want”, sure, except at least back then there wasn’t much compelling about that. And the whole thing is too much of a hassle.", "by": "draw_down"}, {"item_id": 21100232, "text": "This is probably the same exploit used by three letter agencies to get into locked iDevices. It was known long before checkm8 became public.", "by": "pearjuice"}, {"item_id": 21100394, "text": "Potential business opportunity - iPhone &quot;virus scanner&quot; device or service?", "by": "clamprecht"}]