[{"item_id": 21099173, "text": "I do think there is something hypocritical in us pointing fingers to Brazil for destroying the Amazon forest. In Europe, most forests have been destroyed in the past centuries, all for economic gain. If we are so concerned, why not rebuild those forests. Apparently we are not that concerned, we still make the same choice for economic gain, just like Brazil does.", "by": "mpol"}, {"item_id": 21099183, "text": "While the basic message is probably true the way the article is so economical with the facts that it rightly belongs in the trash.<p>The one example it cites is for a species of moth from the Balkans. Last time I checked the Balkans were still part of Europe so this species of leaf-mining moth could be expected to colonise more northerly parts of the continent as the climate warmed. So no real surprises there. It&#x27;s probably happened in the past and yet we still have horse chestnut trees.<p>Other weasel sentences such as &quot;The study said 42% of the 454 tree species in Europe, which include some found elsewhere, could die out on the continent.&quot; So &quot;some found elsewhere&quot;. What percentage are found elsewhere? Where exactly is elsewhere. Some species are probably very widespread indeed so losing a few at the edges of their range are inconsequential.<p>The real story here is Europe&#x27;s fragmented habitats means that a lot of trees are going to have a hard time adjusting to climate change - there&#x27;s nowhere to go. Pollution puts a lot of stress on trees - remember acid rain? While there is a real problem with imported insects, fungi, etc. none of that is mentioned.<p>A lazy article, written by a lazy journalist who just threw in &quot;extinction&quot; to spice things up and sow fear, doubt and uncertainly.", "by": "smackay"}, {"item_id": 21101420, "text": "On top of the &#x27;natural&#x27; threats mentioned in the article there are two specific EU policies that threaten trees in the EU even more.<p>The EU has a policy to get the member states to reach a certain percentage of &#x27;renewables&#x27; in the energy basket or face stiff fines. So far so good. However, commercial logging managed to get &#x27;wood pellets&#x27; on the list of &#x27;renewables&#x27;. The result? Forests and roadside trees are being &#x27;harvested&#x27; like there is no tomorrow because it helps meet the quota.<p>The EU set up a program for returning surfaces to more &#x27;original&#x27; vegetation. Much of Europe&#x27;s forests in low forested areas are created 2 or 3 centuries ago to serve as hunting grounds for the aristocracy. &#x27;Nature&#x27; organizations (pretend green lobbies in reality) are now strip cutting forests in the name of &#x27;planting more native species&#x27; and even &#x27;landscape diversity&#x27; in regions that barely have tree left.  &#x27;Coincidentally&#x27; raking in nice subsidies to do so with a positive financial return, allowing them to buy more land to &#x27;converse&#x27; raking in more subsidies...<p>Yeah, I know you can see the excessive airquotes, but I&#x27;m mad as hell.", "by": "PeterStuer"}, {"item_id": 21100921, "text": "An interesting point came up this past summer when discussing allergies in cities. The trees that are planted in cities tend to be male since female trees will bear fruit and are messy.<p>I wonder if the lack of diversity (yes even in trees!) is causing problems. If there were a mix of male and female would trees be able to evolve or at least grow more offspring.", "by": "dghughes"}, {"item_id": 21100727, "text": "I consider myself somewhat of a permaculturist, but I try to stay pragmatic. Genetically modified seeds are something we should be heavily looking into — and people who care about the environment should support that research, rather than shouting, “something, something, Monsanto.”", "by": "gdubs"}, {"item_id": 21099236, "text": "On another article, a user is wondering why there isn&#x27;t a public uproar and why isn&#x27;t absolutely everyone writing to their representing politicians about car rental companies ripping them off of 15€ for their Hamburg-Milan cross country holiday family car trip. I dare everyone reading this to actually take the time and write to their politicians to act against climate change and urbanisation. Time is up already.", "by": "mrpopo"}, {"item_id": 21099164, "text": "Can anyone explain me what is the danger of losing 60% of the species? As soon as we maintain the same volumes in tree, it is overall fine, isn&#x27;t it?", "by": "pl-94"}]