[{"item_id": 21102597, "text": "Here&#x27;s the direct download link:<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;winitzki&#x2F;sofp&#x2F;raw&#x2F;master&#x2F;sofp-src&#x2F;sofp.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;winitzki&#x2F;sofp&#x2F;raw&#x2F;master&#x2F;sofp-src&#x2F;sofp.pd...</a>", "by": "baby"}, {"item_id": 21105648, "text": "Can anyone please comment on the book as a learning material for practical functional programming? All of the comments here are going on tangents (which is ok, but please also comment on the source material).", "by": "nafizh"}, {"item_id": 21102260, "text": "I put together a list of links that helped me get a hang of things on my journey understanding the theories behind languages and their design - <a href=\"https:&#x2F;&#x2F;docs.google.com&#x2F;document&#x2F;d&#x2F;1hFch8y9RVab9A7U6ocUzfmPQVOJSEoki4AF7Z2vE6X8&#x2F;edit?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.google.com&#x2F;document&#x2F;d&#x2F;1hFch8y9RVab9A7U6ocUzfmPQ...</a><p>The list isn&#x27;t ordered or complete yet. I just started the doc today. I&#x27;ll be adding stuff as I move along.", "by": "lewisjoe"}, {"item_id": 21102001, "text": "It hang my PC and I had to use the reset button. The CPU load went 100% and never fallen back (I waited for about 15 minutes). The PC became so extremely slow I couldn&#x27;t even log-in to another Linux console.<p>I retried on Windows an it (the download button) worked just fine however.", "by": "qwerty456127"}, {"item_id": 21103173, "text": "Perhaps pedantic, but mathematics is not science, and neither is functional programming.<p>See: <a href=\"https:&#x2F;&#x2F;undsci.berkeley.edu&#x2F;article&#x2F;mathematics\" rel=\"nofollow\">https:&#x2F;&#x2F;undsci.berkeley.edu&#x2F;article&#x2F;mathematics</a><p>&gt; Mathematics is such a useful tool that science could make few advances without it. However, math and standard sciences, like biology, physics, and chemistry, are distinct in at least one way: how ideas are tested and accepted based on evidence. Math doesn&#x27;t rely on testing ideas against evidence from the natural world in the same way that other sciences do. Mathematical ideas are often accepted based on deductive proofs, while ideas in other sciences are generally accepted based on the accumulation of many different observations supporting the idea.", "by": "amelius"}, {"item_id": 21102141, "text": "The web page kills a chromebook.. wtf", "by": "boznz"}, {"item_id": 21104439, "text": "This is a real question for anyone who might know: Have mathematicians as a whole ever thought about moving from the age-old formulas using various Greek symbols to something more akin to a programming language? What I mean is, instead of writing π to instead use &quot;pi&quot;, or &quot;summation()&quot; rather than using the capital sigma? Functions like sin(), cos(), etc. already look like that, I wonder why the derivative sign and others haven&#x27;t been changed. Superscript and subscript as well, and prime marks. It all seems superfluous.<p>I guess what I&#x27;m asking is there an alternative to traditional mathematical notation that&#x27;s commonly used?", "by": "russellbeattie"}, {"item_id": 21102354, "text": "i haven&#x27;t read this book but in undergrad I skimmed his linear algebra and it was great. it&#x27;s still the clearest introduction to wedge and exterior products I&#x27;ve ever seen.", "by": "mlevental"}, {"item_id": 21101736, "text": "<i>It requires a certain amount of mathematical experience and is not suitable for people who are unfamiliar with school-level algebra, or unwilling to learn difficult concepts through prolonged mental concentration and effort.</i><p>Why do materials on functional programming always have to be at least somewhat condescending towards the reader?<p>Or maybe: why such sentences seems to appear only in them?", "by": "Tade0"}, {"item_id": 21102490, "text": "Bad link?", "by": "Sam_Harris"}]