[{"item_id": 21100399, "text": "I once got a chance to chat with a psychologist who worked for the Rangers.  I ran into him at the Schlitterbahn water park south of Austin, and talked while we waited for family members to finish their rides.  He was involved with tracking down members of MS-13, the Latino gang. They&#x27;re known for being particularly violent, so he was pretty eager to find them and get them prosecuted.<p>One piece of Ranger history I didn&#x27;t know was that their badges are made from Mexican 5-Peso silver coins.<p><a href=\"https:&#x2F;&#x2F;www.americancowboy.com&#x2F;people&#x2F;history-texas-ranger-badge-26798\" rel=\"nofollow\">https:&#x2F;&#x2F;www.americancowboy.com&#x2F;people&#x2F;history-texas-ranger-b...</a>", "by": "chiph"}, {"item_id": 21100563, "text": "<i>Pressed about his life story, Little traced the urge to kill to his youth. He said he got his first erection in kindergarten when he watched his teacher touch her neck. Later in grade school, he dreamed of killing a girl who stroked her neck while teasing him.</i><p>He said it, but I have trouble believing that.  There had to be something before that, perhaps something too far back to remember?", "by": "e40"}, {"item_id": 21105501, "text": "There was recently an article about the alien-ness of octopi, but to read about a guy doing this, he seems more unhuman than even those. Someone who can find life that disposable just for a bit of fun, will always be utterly beyond me.<p>Just a note, I understand that serial killers almost exclusively stick with their own ethnic group. If you watch the (short) video, that becomes very apparent here. The photos in the article don&#x27;t show that so well, the video does.<p>&quot;were almost all prostitutes, drug addicts or those he didn’t think would be missed.&quot;<p>Christ, the ultimate throwaway culture. Well done James Holland, you did a job I could not face.", "by": "tempguy9999"}, {"item_id": 21103779, "text": "Pretty sure he made all of them up.<p>I can&#x27;t find any confirmation he didn&#x27;t.<p>He certainly made most up. It would be seriously easy to match someone you actually murdered to the real incident if you wanted.<p>Even 20 would still impossible without solid matches by now.<p>Given the number, he will eventually match in an unknown case reasonably well, so I&#x27;d like to know more about the one &#x27;match&#x27;<p>Life isn&#x27;t a movie. The fact they think he has a photo graphic memory only goes to show they are easy to fool.", "by": "aaron695"}, {"item_id": 21100575, "text": "Kind of sickening how he builds up his ego and tells him he loves him. Seems like that kind of treatment could potentially skew the accuracy of the confession.<p>“Hmm, I like being loved and praised and fed milkshakes here in prison, I’m going to keep talking, even if it isn’t true!”", "by": "archeantus"}, {"item_id": 21101419, "text": "Totally unrelated to the article (which I enjoyed), but the LA Times website continuously jumped up and down on my iPad. I suspect ads reloading above or below the fold. Incredibly annoying!", "by": "bdittmer"}, {"item_id": 21101635, "text": "It&#x27;s amazing how can a professional solve this cases where others couldn&#x27;t. Why there is so much hate towards women in US? I mean, particularly, these serial killers. Cases like this are rarely seen in South America, where violence has other drives (many times much less psychological).", "by": "stebann"}, {"item_id": 21100383, "text": "He only talked cause he had nothing to lose. The ranger didn&#x27;t really have much to do with it", "by": "dunkmaster"}]