[{"item_id": 21100978, "text": "This is amazing news. Many of the articles about &quot;a cure for cancer&quot; that get posted here and elsewhere don&#x27;t pan out, but this is the real deal. Obviously the goal isn&#x27;t 50% survival - it&#x27;s 100% - but we&#x27;ve come a long way.<p>I was diagnosed with melanoma in 2010. At the time, the standard of care for melanoma was remove it surgically... and then cross your fingers and hope it doesn&#x27;t come back.<p>During the 3 month interval between when I was first diagnosed and when we learned that the cancer had spread, that changed. The first paper showing an overall survival benefit for melanoma patients (by dosing them with ipilimumab) was published in the NEJM in June 2010. Although ipilimumab (marketed as Yervoy) wasn&#x27;t approved by the FDA until the next spring, I was able to get access to a very high dose of the drug through a clinical trial.<p>The trial was weird in a couple ways. First, I can get on clinicaltrials.gov, pull up the results of my study, and calculate that if I&#x27;d been put in the placebo arm of the trial, there&#x27;s a 25% chance I wouldn&#x27;t be here to write these words. That&#x27;s a strange thing to know.<p>Second, the side effects were really unusual and unpleasant. I didn&#x27;t have to endure the acute toxicity you get from chemotherapy, so that was a blessing. On the other hand, immunotherapies (like both of the drugs referenced in this study) mess with immune regulation mechanisms that apparently aren&#x27;t supposed to be messed with. My personal experience ranged from the mundane to the miserable: fatigue, severe acne, absolutely excruciating eye infections, and other stuff I won&#x27;t get into here. I&#x27;m still dealing with some of these issues almost a decade later, but the key point is that I&#x27;m here to deal with them!<p>Ipilimumab was the first step; James Allison recently won a Nobel prize for discovering the protein that it targets. Nivolumab (marketed as Opdivo) actually gives even better performance, so nivo is the standard and is sometimes supplemented with Yervoy (or so I understand; I&#x27;m not a physician.) I can only imagine what the side effects of the combination therapy are like. Remarkably, both drugs were developed by Bristol-Myers Squibb.", "by": "mrosett"}, {"item_id": 21103426, "text": "I was diagnosed with stage 4 melanoma in Feb 2017. At my fourth treatment (every three weeks) of pembrolizumab, my PET and CAT scans were clear. I continued treatment for 12 months, and still get scanned every four months. Still clear 3 weeks ago. My doctor says he now gets to use the c-word with cancer patients. Minimal side effects for me. I wish for my cohorts that more reliable treatments come soon.", "by": "civil_engineer"}, {"item_id": 21100253, "text": "Its worth saying that some of the side effects of the newer immunotherapies are bizarre, idiosyncratic, and unpleasant, in a different way from chemotherapies. This is definitely good news, but patients undergoing treatment for melanoma are still extremely complex to manage.", "by": "stuartbman"}, {"item_id": 21100488, "text": "We could greatly increase the survival for most cancers if we could detect them much earlier.<p>“ If it is caught in the early stages then the chances of survival are good, but as the cancer becomes more aggressive and spreads throughout the body (known as metastatic cancer) then survival plummets”<p>Craig Venter:<p><a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;iUqgTYbkHP8?t=15m37s\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;iUqgTYbkHP8?t=15m37s</a>", "by": "melling"}, {"item_id": 21100090, "text": "&gt; The findings of the study will be presented at the European Society for Medical Oncology meeting in Barcelona, Spain, and published in The New England Journal of Medicine.<p>Anyone have a link to a preprint? Can&#x27;t find one anywhere. Hard to comment without seeing the actual source.", "by": "breck"}, {"item_id": 21101105, "text": "These drugs were originally developed by a company called Medarex, based on academic research. Bristol Myers bought Medarex in 2009 I think.<p>From what I understand, Bristol Myers almost didn&#x27;t develop the drugs. Back then the idea of targeting the immune system to treat cancer wasn&#x27;t a mainstream idea.  It&#x27;s a very good thing they moved forward with them!", "by": "aaavl2821"}, {"item_id": 21101495, "text": "Yeah, my buddy survived it once, then it came back again as stage 4 and he beat it using immune based therapy.  Now his adrenals and thyroid are dead.  It&#x27;s better than dying, but it&#x27;s not free.<p>Edit: also, my buddy was the only guy in the study group who didn&#x27;t drop out.  He just happened to be a massive pill-head(opiates), and smoked a ton of pot, which probably helped get him through the side effects.<p>Immune therapies are worlds better than traditional chemo&#x2F;rad, which often ended up giving you an entirely different kind of cancer years later, but they are not without side-effects.", "by": "01100011"}, {"item_id": 21100299, "text": "The title says half of people survive advanced melanoma, but the article says 52% of patients live for 5 years. Are these medically the same?", "by": "clircle"}, {"item_id": 21102865, "text": "Fantastic!  I&#x27;ve had a few skin-cancer spots removed from my arms.  (Failed to use sunscreen in my younger years.  Avoid this fate!)<p>I&#x27;m very glad to read this article.", "by": "RickJWagner"}]