[{"item_id": 21095990, "text": " What I don&#x27;t get about the Vision Fund is how so many of its investments lack (pun intended) vision.<p>Other than the ARM, Nvidia, and a few billion in biotech (about $3 billion[1]) investments, so much of the fund has gone into pretty &quot;obvious&quot; traditional startups.<p>If I had a $100 billion fund, I wouldn&#x27;t be swinging for these singles and doubles (which Uber and WeWork were by the time Softbank got involved, although these companies can still provide value to customers).<p>Vision Fund should&#x27;ve been out-competing Google X to become the financial backer of basically the next Bell Labs. Instead of 3% biotech and 20% Uber and WeWork and Wag, I&#x27;d have flipped those two numbers.<p>The biggest loss from the Vision Fund is the opportunity cost of all the great disease-eliminating, fundamental-science research that could&#x27;ve had much greater upside than WeWork. And I never hear that opportunity cost discussed.<p>EDIT: I&#x27;ve added an additional comment with more supporting arguments for taking bigger risks but more ambitious risks when managing large sums: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;edit?id=21096651\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;edit?id=21096651</a><p>[1]: <a href=\"https:&#x2F;&#x2F;finance.yahoo.com&#x2F;news&#x2F;softbanks-vision-fund-deploying-100-billion-185127309.html\" rel=\"nofollow\">https:&#x2F;&#x2F;finance.yahoo.com&#x2F;news&#x2F;softbanks-vision-fund-deployi...</a>", "by": "loganfrederick"}, {"item_id": 21096033, "text": "I applied to this company right at the beginning of there expansion. The person that interviewed me said he had been sleeping on couches for the last year or so, (around 2017) and working insane hours. They gave me a php coding test to implement some kind of pub&#x2F;sub. I finished it. Had no real way of submitting it other than emailing it to the interviewer as a zip.<p>The moment the interviewer told me they worked with a php stack. I asked why they&#x27;d chosen to go with php given that the product was so new they could&#x27;ve chosen any newer tech. stack (JavaScript framework) and probably been better off. The interviewer didn&#x27;t really response to my question.<p>The entire conversation with said person, was them talking at me for about 30 minutes. They said the company was going to try to pivot to developing some service surrounding their lock box service for the keys to get into people&#x27;s houses for the dog walking.<p>It seemed very &quot;directionless&quot; and gave me a very bad taste in my mouth. They never got back to me or anything. Which was fine by me since I wasn&#x27;t going to pursue them any further.", "by": "fantasticFerret"}, {"item_id": 21095858, "text": "You’ve got to applaud Masayoshi Son for his tenacity at the very least. Lived through the Dot Com Crash, caused the next one 20 years later.<p>That’s a big achievement in my book. How many people can really say they’ve been able to do something like that?<p>[Edit] I should probably add a caveat that Masayoshi Son isn’t the dumb one here. No, he’s actually quite the genius, managing to convince Saudia Arabia to basically give him $45 billion and then spinning that all the way into $100 billion with the Vision Fund. I’m genuinely giving praise to the man here. He saw an opportunity and took advantage of it.", "by": "lawrenceyan"}, {"item_id": 21097383, "text": "Messy is right. It&#x27;s as if <i>competently running a business people want to continue patronizing</i> keeps slipping everybody&#x27;s minds. No bootstrapped business thinks they can get away with this many gaffes in a row. Because on the very first screw-up, you lose some amount of money, <i>and it&#x27;s your own money,</i> and it hurts, and you learn. In a startup funded like this, money is just the stuff you throw at stuff, and there&#x27;s always more where that came from. Obviously the whole VC-funded hyper-growth thing doesn&#x27;t guarantee success, has a low success rate in fact, but I&#x27;m starting to wonder whether those investments actively prevent success in some cases.", "by": "rdiddly"}, {"item_id": 21096153, "text": "These on demand - fulfilled by gig contracting platforms can _only_ provide value if there has been a big technological change that undermines expertise in a job. Uber works because of google maps knowing a faster route than even the 20 year veteran tax driver.<p>There hasn&#x27;t been a revolutionary technology in dog walking, just people who need cash but dont know pets.<p>There hasnt been a revolutionary technology in grocery shopping, just people who need cash and dont care about the quality of your basket.<p>etc.", "by": "maerF0x0"}, {"item_id": 21096537, "text": "I think Softbank&#x27;s main problem is that they fund opportunity without considering execution at all. It&#x27;s very possible that a dog walking service could be a multibillion opportunity (millennials&#x2F;gen Z choosing to have pets over kids in greater numbers and working FT), but was there really anything special about this specific team that would lead anyone to believe they could execute with a $300m injection? I don&#x27;t think so.", "by": "tempsy"}, {"item_id": 21097107, "text": "I used to work at Wag a for a few months, leaving shortly after the new CEO was brought on and they received the SoftBank investment.  The fact that things got worse since then is not surprising.  Management was already pretty disorganized, they were bad at managing funds (the salary discrepancies were very real), and putting it mildly it was just an unpleasant place to be.  There was a staggering amount of turnover, especially with tech roles, in the short time I was there - one minute someone would get called into a meeting and that was the last I saw of them.  I cant imagine the technical debt they&#x27;ve been accruing from having a carousel of developers.<p>I know they wanted to position themselves as the one stop shop for dog everything (not just walks but sitting&#x2F;boarding, training, food delivery, etc) which is what I think helped them raise the funds, but I think they&#x27;ve taken too long to resolve the issues around their bread and butter of dog walking.  The fact that the Viners and Meltzer are all since left as well is pretty telling.", "by": "jejunebug"}, {"item_id": 21096181, "text": "&gt;Mike Walsh, a general partner at Structure Capital, which was an early investor in Wag, described the brothers to CNN Business as &quot;so smart&quot; that it&#x27;s &quot;almost difficult to communicate&quot; with them.", "by": "Edmond"}, {"item_id": 21095805, "text": "Hot take - when it&#x27;s all said and done (e.g. when the whole fund gets returned) the vision fund is going to devalue more companies than it is going to value them. If they&#x27;re charging a management fee then they&#x27;ll still make money but their LPs aint gonna be happy in the long term.", "by": "mbesto"}, {"item_id": 21096491, "text": "Reading the title has affirmed to me that we are living in a bubble (and it doesn&#x27;t look good). I just can&#x27;t get it through my head how an investment of that size will EVER pay off. A major reason people buy dogs is because they want to get out and walk more. If they can&#x27;t they outsource it to a teenager you or your friends know, there&#x27;s no need for a middleman in most cases. (If it was baby-sitting I could understand more it as there is far less flexibility.)<p>WeWork&#x27;s valuations have also seemed strange to me, when they don&#x27;t have any assets of infrastructure to warrant such a high value. There&#x27;s very little stopping others renting office space, in fact a friend of mine has done just that.", "by": "velox_io"}, {"item_id": 21096075, "text": "The big issue with the product is that after the first transaction, no-one has any incentive to use your marketplace.<p>There is a company in my country doing this. They are probably not worth zero tbf but they have a massive issue with people just cutting them out after the first transaction.<p>And what is the problem with just building a brand? I employ a bunch of dog walkers, I do checks on them, I build a trusted brand...the $300m is a solution without a problem.", "by": "hogFeast"}, {"item_id": 21097647, "text": "&gt; Wag looked like tech&#x27;s next Big Thing<p>Uhh, what? No, it didn&#x27;t. Even the bull case never imagined it as anything like a &quot;next big thing.&quot;", "by": "the_watcher"}, {"item_id": 21097096, "text": "i know there is this meme about all software companies just bundling and unbundling things, but can we please stop putting tens of milllions into startups that are literally just:<p>&quot;App for Y that know allows you to work like before but without labour rights&quot;<p>and invest money into stuff that actually deserves to be called an invention. Idk cure cancer, flying cars, making infrastructure cheaper, something that actually gets productivity up in the long term", "by": "Barrin92"}, {"item_id": 21095849, "text": "Be aware:  audio will start playing out of your speakers if they are on.", "by": "freedomben"}, {"item_id": 21097365, "text": "The lesson I think is to be learned here, is that without passion, even money cannot help.<p>If CEO and top executives really cared about a startup for dogs, they would have come up with solutions for the most recurring problems (e.g. dogs getting lost, or mistreated). How hard is to make a leash with GPS in it and track it in an app? Or to give mandatory basic training to any new contractor?<p>Also the way they treated the customer service employees is disgusting.", "by": "aledalgrande"}, {"item_id": 21096035, "text": "Plan to get taken for a walk, end up getting taken for a ride. Figures.", "by": "jacquesm"}, {"item_id": 21098400, "text": "I don&#x27;t think that a good company can grow from a massive investment that early. The VC fund wants the company to spend the money and grow value quickly, not sit on it for years. That puts pressure on leadership to waste time and money worrying about building out offices, hiring top talent, contracting with big agencies, etc. None of that work has anything to do with building a quality product, growing a functional culture, or paying attention to what customers are saying. It suspends financial reality for both leadership and rank&#x2F;file; instead it encourages waste.<p>Does closing a $250K contract matter? In a scrappy startup, that contract is a huge win. In an overfunded startup, its often considered a distraction.", "by": "reilly3000"}, {"item_id": 21096034, "text": "If you&#x27;re Saudi Arabia with a silly amount of money in cash, are you looking for 10-100x return out of this, or are you simply looking for a place to park liquid funds that won&#x27;t lose as much as leaving it in German government bonds.", "by": "jpollock"}, {"item_id": 21096671, "text": "Too bad companies like Bird, Wag, and WeWork get so much access to secondary market capital. Otherwise they would have had to IPO, and I could have shorted these companies like the flee-ridden dogs they are. Hey, at least I got to make big money on Lyft and Uber!<p>This VC backed communism is definately coming to an abrupt end. Once Son is chased out of town, the fun times will be over.", "by": "mruts"}, {"item_id": 21095803, "text": "This is fucking insane. $300M for a dog walking company, a dog walking company.  A dog walking company.   A fucking dog walking company.", "by": "nosleeptill"}, {"item_id": 21099228, "text": "There are so many spontaneous adds on this freaking page I can&#x27;t even read the article because the text jumps away to make room for god know what product they want me to buy...<p>Man, what a trend this has grown to be.", "by": "Izmaki"}, {"item_id": 21096787, "text": null, "by": null}, {"item_id": 21096757, "text": "How the hell are they loosing money they take a big cut from a service that they invest 0 money into outside of marketing. If the app worked half decently their cs expenses would be low.", "by": "qaq"}, {"item_id": 21096585, "text": "I used to always look amusingly at their billboard on 101, as they seemed like an Uber for dogs and the next Webvan.<p>Till I realized how much money they have raised... And I...<p>Was..<p>Speechless....", "by": "yumraj"}, {"item_id": 21096684, "text": "Anyone have insight into Nuro? I was thinking of applying but now need to second guess joining any SoftBank co.", "by": "tempsy"}, {"item_id": 21097409, "text": "I&#x27;ve sold out.<p>I don&#x27;t care about the last 10% potential. This market is fucked", "by": "swarnie_"}, {"item_id": 21096047, "text": "Is it possible for investment funds to become insolvent?", "by": "buboard"}, {"item_id": 21097169, "text": "Best title ever.", "by": "0xADADA"}, {"item_id": 21096789, "text": "The new Pets.com?", "by": "zeruch"}, {"item_id": 21096132, "text": "How would have JavaScript made them better off?", "by": "switch007"}]