[{"item_id": 21093503, "text": "love it!  i spent YEARS playing and coding for MUDs and ran a few games as a solo admin&#x2F;coder. imo it is so very satisfying to watch the global chat channels after a new feature&#x2F;area&#x2F;weapon&#x2F;mob gets rolled out...and what the community thinks of it. i can recall more than one occasion where a well planned quest resulted in interesting dynamics after players started interacting with it. an example; one quest would add an &quot;invisible&quot; token object to a player&#x27;s inventory. quest stages would check for and modify the state of the token when it was &quot;present&quot;. in this particular MUD there was PK...and eventually someone decided to carry the corpse of someone on the quest into an area where you must have the token to enter...and they &quot;walked&quot; right in. none of us had thought of that potential &quot;use-case&quot;...and it exposed a really interesting game play mechanic that we never knew existed...the equivalent of cutting off the guards finger to pass biometric locks in a spy story...<p>...damn...its hard not to want to start another MUD...<p>EDIT: i know this post is NOT a MUD project...but the solo-MMO dev story just struck a nostalgia chord in me", "by": "crtlaltdel"}, {"item_id": 21094082, "text": "A number of years ago I completed an MMO project by myself (art, programming, marketing, etc). It was fun! Real-time server was in Python Twisted, lots of Cython to speed up the deepest parts of the game loop. Django for the main website. The client was Flash (this was back in 2013, when it was still kinda a thing), which meant anyone could jump in really quickly, but technically that was challenging for a real-time 2D Zelda-style game because you were limited to TCP rather than UDP and the server has to be 100% authoritative since opening up Flash swf&#x27;s or sniffing packets is so very easy. The server could support 250 people, and I had some fun tooling that let me spin up virtual players to stress-test it. Fun to remember!<p>The thing with MMO projects that really gets you is, even after you&#x27;ve got a mature client and server you still need to put together enough content, which if you&#x27;re level designing&#x2F;writing&#x2F;painting everything yourself, is an enormous quantity of work. If you don&#x27;t want players to run out of quests and whatnot you&#x27;ve probably got to lean towards a sandbox experience, and this MMORTS is a particularly interesting way to go.", "by": "DizzyDoo"}, {"item_id": 21093506, "text": "I really admire the determination of the One Man. Scrolling to the oldest updates reveals that his has been a passion since at least 2010. What a mark of constitution and fortitude to keep this passion burning. It is remarkable what his 2010 self knew and what his 2019 has learned in those years. This is his opus. Keep up the good fight!", "by": "blorenz"}, {"item_id": 21098183, "text": "MMOs are happily two orders of magnitude easier to write today. Before game engines you can license or get for free really existed, it was just you, the compiler, and a text editor, which rapidly turned into many people, the compiler, your editors, and pain.<p>I worked at Turbine off and on from 2001-2012, and was the MMO game engine tech lead in the time period up to when Lord of the Rings Online and Dungeons &amp; Dragons Online shipped (2003-2005). Both were based on the same game engine core, which was a more or less complete rewrite of everything in the game engine (client and server) from the original Asheron&#x27;s Call. Many of the concepts carried over, but the implementation was completely different. To this day, I still think this &quot;G2&quot; engine got many things right in its internals that many other game engines (MMO or otherwise) didn&#x27;t really get, probably because everyone who worked on it was crazy but actually pretty nice and reasonable to work with. Some friends who ended up working at Unity or Epic from Turbine that I&#x27;ve talked with think the same. It certainly made many questionable assumptions as well.<p>I got quite burned out from the rewrite (well over 1 million lines of C++ redone between 5-6ish people) and went part time&#x2F;remote in 2006, left in 2007, came back in 2009 part time&#x2F;remote again to help port the stuff to PS3 and Xbox 360 for projects that eventually got cancelled. My last six months (I stopped giving a shit at this point) was doing nothing but porting much of the client code to Mac OS X, which consisted of fixing endless compiler errors and patching up library&#x2F;API differences in hundreds of thousands of lines of client code. This was actually kind of therapeutic because much of it was mindless.<p>I do smile a bit when realizing that code I wrote on ~16 years ago is still plugging along in some datacenter somewhere and on people&#x27;s PCs, long after the company and the people who worked on it have scattered to the winds. Many of the core team that worked on it back in that time period went on to found some companies (game or otherwise), are working at places like Google and Facebook, or remained in the industry at Epic Games and Unity and various game studios.", "by": "jhj"}, {"item_id": 21094974, "text": "An interesting story about a one man MMO project (well, he enlisted help of his wife along the way), is the postmortem for Eternal Lands. It was a popular read on now defunct Devmaster.net website.<p>It&#x27;s available through Web Archive here: <a href=\"https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20110303214710&#x2F;http:&#x2F;&#x2F;www.devmaster.net&#x2F;articles&#x2F;mmorpg-postmortem&#x2F;part1.php\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20110303214710&#x2F;http:&#x2F;&#x2F;www.devmas...</a><p>It&#x27;s an interesting throwback to the era before common availability of production-grade game engines like Unreal or Unity, back when everyone worked on their own Direct3D&#x2F;OpenGL engine.", "by": "skocznymroczny"}, {"item_id": 21093608, "text": "I remember ages ago it was common to see the advice &quot;don&#x27;t try to create your own MMO&quot; as they were one of the most complex game dev projects you could do.<p>Are MMOs any easier to make now given the libraries and cloud services that exist today?", "by": "seanwilson"}, {"item_id": 21093675, "text": "Odd that <a href=\"http:&#x2F;&#x2F;theimperialrealm.com&#x2F;index.html\" rel=\"nofollow\">http:&#x2F;&#x2F;theimperialrealm.com&#x2F;index.html</a> and <a href=\"http:&#x2F;&#x2F;theimperialrealm.com\" rel=\"nofollow\">http:&#x2F;&#x2F;theimperialrealm.com</a> are two different destinations. The former is the home page which contains an intro video and more information about the game itself, while the latter is the blog.<p>He has two index files; index.html and index.php. The server sends index.php by default, which is where the blog is.", "by": "justusthane"}, {"item_id": 21093927, "text": "This is a great example of marketing the dream of game development.  You can make the argument that Star Citizen is a completely different version of the same thing-- I mean in that it is not the game you love it is the making of it.  This guy is tapping into what we (on this forum) all love about game design, all the projects people have started or tried in our lives.  It is such a drag to make games with huge teams, with marketing and technical compromises, design by committee.  It drains the joy of developers and it bores a lot of the audience.  This is the dream of one person pursuing their passion.", "by": "georgeecollins"}, {"item_id": 21098932, "text": "Hello Hacker News, I wondered why my traffic went all bonkers today.  To answer some of your questions:<p>Yes, it is difficult to keep up with modern game tech, but I have lots of friends in the AAA industry who let me know what&#x27;s going on at the bleeding edge, and I pick my battles.<p>No, you couldn&#x27;t make a game like Miranda with any off-the-shelf game tech I have seen.  Game engines usually only allow one avatar per player, Miranda can have hundreds, theoretically thousands.  Miranda is also seamless and single-sharded.<p>The renderer does have soft shadows, but you&#x27;re right they don&#x27;t always show up really well. I&#x27;ll take a look at that.<p>The next update is coming pretty soon with a whole lot of gameplay additions, I just started the playtesting and debugging phase today.<p>Thanks for visiting.", "by": "OneManMMO"}, {"item_id": 21093320, "text": "How do MMOs maintain and update state for tens of thousands of players and then push those updates from the server back to clients efficiently?", "by": "xwdv"}, {"item_id": 21095876, "text": "I also made not one, but two &quot;almost&quot; OMMMOs (One Coder MMO?):<p>2001! <a href=\"http:&#x2F;&#x2F;www.rupy.se&#x2F;raywalk&#x2F;magequest.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.rupy.se&#x2F;raywalk&#x2F;magequest.html</a> (the graphics&#x2F;sounds are &quot;borrowed&quot;)<p>2011. <a href=\"http:&#x2F;&#x2F;aeonalpha.com\" rel=\"nofollow\">http:&#x2F;&#x2F;aeonalpha.com</a> (my neighbor made the music&#x2F;sounds in exchange of a 960Ti for his Hackintosh)<p>Both use Java, the first one is a mix of Applet&#x2F;Application that you can try by running this file:<p><a href=\"http:&#x2F;&#x2F;www.rupy.se&#x2F;raywalk&#x2F;client.jar\" rel=\"nofollow\">http:&#x2F;&#x2F;www.rupy.se&#x2F;raywalk&#x2F;client.jar</a><p>The second is Application only so you download it here:<p><a href=\"http:&#x2F;&#x2F;aeonalpha.com&#x2F;aeon.zip\" rel=\"nofollow\">http:&#x2F;&#x2F;aeonalpha.com&#x2F;aeon.zip</a><p>I&#x27;m working on my third OCMMO:<p>2021? <a href=\"http:&#x2F;&#x2F;ahoy.rupy.se\" rel=\"nofollow\">http:&#x2F;&#x2F;ahoy.rupy.se</a>", "by": "bullen"}, {"item_id": 21098367, "text": "This reminds me of Shattered Galaxy <a href=\"http:&#x2F;&#x2F;www.sgalaxy.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sgalaxy.com&#x2F;</a> which is a game I played 20 years or so ago which was way ahead of it&#x27;s time.", "by": "foxhop"}, {"item_id": 21097608, "text": "Looks nice! MMO RTS nonetheless!<p>A word of advice: if you want to make an easy immense graphical update, add shadows to your vehicles. Even just a dumb, circular flat alpha gradient under each vehicle. You would not believe the amount of immersion this adds.", "by": "Iv"}, {"item_id": 21094857, "text": "This is very cool. In the same vein, I recommend Project Gorgon from Eric Heimburg and Sandra Powers -- a two person MMO, but still pretty cool. Check it out here: <a href=\"https:&#x2F;&#x2F;projectgorgon.com\" rel=\"nofollow\">https:&#x2F;&#x2F;projectgorgon.com</a>", "by": "BryantD"}, {"item_id": 21093758, "text": "Looks awesome! I actually created a MMO prototype before, just by myself. A lot of people told me not it&#x27;s impossible to do, but it was actually fairly easy.<p>I used Babylon.js for the 3D game&#x2F;controls, and I imported free 3D assets from various asset stores for the content. The backend was a simple socket server written in Node.js with socket.io connected to the web frontend via JS using the standard WebSockets API. I got realtime character movement, turning, &amp; jumping implemented pretty quickly. Content became a bottleneck so I stopped developing, but I hope to finish it up sometime in the near future.<p>Good luck!", "by": "craze3"}, {"item_id": 21095842, "text": "The toolkits are getting complete enough to allow individuals or very small teams to roll out an MMO, if you&#x27;re willing to pay the bills for Spatial OS. Full VR support, even. Big-world support. Powered by Expensive Google Cloud.<p>One of the first: Community Garden.[1]<p>[1] <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=h2XEbJOWkxc\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=h2XEbJOWkxc</a>", "by": "Animats"}, {"item_id": 21093775, "text": "Wow, looks like he&#x27;s been at it for a decade. I&#x27;m curious how much game development technology has changed over this time and if it outpaces development.", "by": "dpedu"}, {"item_id": 21093418, "text": "I think a mmorts is pretty unique. If you manage to spice up those menus a little bit and get the balance right (some) people will buy it for sure", "by": "timwaagh"}, {"item_id": 21095630, "text": null, "by": null}, {"item_id": 21097720, "text": "Back in the day, I used to play a MMO called Faldon, which was developed mostly by one developer. I&#x27;m still astonished by such projects being done by one person, since game development requires so many skills; MMOs takes this to the next level.", "by": "Pmop"}, {"item_id": 21096200, "text": "for those interested in &#x27;one-person&#x27; MMO projects, check out Xenimus.<p>It&#x27;s a long-running MMO (from around the Ultima Online era of games) that is developed and ran by a single person.<p>The amount of effort involved in such an ordeal is mind-boggling, personally.", "by": "serf"}, {"item_id": 21094257, "text": "Super cool, I&#x27;ve had plans for games I want to build out over a long period of iterations percolating for a while now. I will keep following this project for sure.", "by": "wuliwong"}, {"item_id": 21094411, "text": "This guy remembers the old gamefaqs boards and probably luelinks", "by": "cptaj"}, {"item_id": 21093377, "text": "Lovely to see Blender in a screenshot for the top link :)", "by": "Topgamer7"}, {"item_id": 21095419, "text": "krunker io\nIs good example of one man building mmo game", "by": "umen"}]