[{"item_id": 21109988, "text": "This killed my friend&#x27;s dad. He was on a bunch of heart drugs and had a pacemaker and everything, but was generally stable. One day, grapefruit comes up in conversation with his doctor, who sternly advises him &quot;never eat grapefruit, it&#x27;ll mess with your meds!&quot;, so he stops eating the grapefruit he&#x27;d been having for breakfast every morning for years.<p>Which promptly hoses up the finely-adjusted dosages, his symptoms suddenly get real weird, the situation spirals out of control, and he&#x27;s dead in 4 days.<p>Doctors, please don&#x27;t rush out of the room. Take time to talk to your patients, and take twice as much time to listen to them. I&#x27;m sure he would&#x27;ve mentioned that detail if he&#x27;d had time to find the English words.", "by": "myself248"}, {"item_id": 21110178, "text": "This bit my brother once, on a trip to visit our grandparents. Grandpa would eat a half grapefruit every morning, believing that the acidity would alkalize one&#x27;s system in response and lead (along with frequent alternative chelation treatments) to better health. We didn&#x27;t drink the chelation shakes, but we did eat the grapefruits, since they were there and prepared.<p>Over the two-week visit, my brother got harder and harder to be around - he&#x27;d always been surly, and he struggled with grandpa&#x27;s wife, but we&#x27;d never experienced the level of emotional turmoil he went through on that trip. He self-harmed, sliced his arms up deeply. I stitched him up with the sewing kit that the resort had mercifully left in the room for us, and we kept the wounds dressed with neosporin until they healed.<p>The next stop on the trip was a visit to grandpa&#x27;s wife&#x27;s sister, a professor of neuroscience. She just happened to mention the interaction between antipsychotics and grapefruit, and it was like a light went on in my brother&#x27;s mind. He stopped eating grapefruit and returned to his usual mental state within a few days.", "by": "presidentender"}, {"item_id": 21112072, "text": "One thing glossed over in these articles is that the impact is mostly on this enzyme as it exists in the intestines.<p>There’s less impact on this enzyme as it exists elsewhere in the body (primarily the liver).", "by": "Scoundreller"}, {"item_id": 21108224, "text": "Interesting to see this now. As a teenager I experimented with DXM (<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Dextromethorphan\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Dextromethorphan</a>) as a hallucinogen. You could buy it in powdered form over the internet for a while, or one could just take corricidin pills or find certain cough syrups that didn&#x27;t have acetaminophen. Anyways, it was well known on usenet&#x2F;IRC at the time that drinking grapefruit juice prior to ignesting the drug would enhance its effects.", "by": "ziroshima"}, {"item_id": 21109454, "text": "Similarly, piperdine in black pepper can function as a bioavailability enhancer<p><a href=\"https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pubmed&#x2F;21434835\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pubmed&#x2F;21434835</a><p>I read an interesting online report that claimed co-administration of black pepper and certain essential oils would produce psychoactive effects.", "by": "cwkoss"}, {"item_id": 21108167, "text": "I might have expected colchicine (<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Colchicine\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Colchicine</a>) to be on the list.<p>It&#x27;s a fairly harsh drug with a narrow therapeutic window. Getting the right dosage is already hard enough, as there are some unpleasant (and common) side effects, and it can also be pretty dangerous to your health. Add something like grapefruit that throws off the concentration, and things get that much worse.<p>EDIT: This HN story link was updated. The list I was referring to above is the old link: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Grapefruit–drug_interactions\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Grapefruit–drug_interactions</a>", "by": "adrianmonk"}, {"item_id": 21108576, "text": "I take atorvastatin for high cholesterol; it says don&#x27;t eat grapefruit on the side of my medication bottle. I never really thought about why, but this gives me more reasons to avoid it. Although now I have a huge craving for grapefruit juice, of course.", "by": "drefanzor"}, {"item_id": 21108400, "text": "I wonder why it took the medical profession so long to become aware of the effect. Piperonyl butoxide, another cytochrome C inhibitor, has been used as synergist in insecticides since before the war, so it should have occurred to someone that the plentiful polyphenols in citrus juice could act as cytochrome C inducers&#x2F;inhibitors and would have a measurable influence on the pharmacokinetics of stuff.", "by": "HarryHirsch"}, {"item_id": 21110518, "text": "My hay fever medication (called Teldanex in Sweden) was withdrawn from the market in 1998 due to some fatalities when combined with grapefruit. So it must have been well known long before 2012. I remember feeling quite lucky I wasn’t into that particular fruit... :P", "by": "bjornsing"}, {"item_id": 21108547, "text": "If you&#x27;ve had a liver transplant, grapefruit is on the list of things that you can never eat again -- it messes with the anti-rejection drugs that you have to take to suppress your immunological system.", "by": "imroot"}, {"item_id": 21109308, "text": "Its useful for getting the most bang for your buck ouy of expensive medications.", "by": "hmx48"}, {"item_id": 21108794, "text": "Also, I know that *mycin antibiotics can decrease liver metabolism of statins, and increase their side effects. In particular, rhabdomyolysis (muscle damage).[0]<p>So I suspect that grapefruit isn&#x27;t the only issue. In that there may well be interactions among the drug classes listed.<p>0) <a href=\"https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pmc&#x2F;articles&#x2F;PMC4006404&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pmc&#x2F;articles&#x2F;PMC4006404&#x2F;</a>", "by": "mirimir"}, {"item_id": 21108962, "text": "Alcohol? In student days, I was always fond of a greyhound: vodka and grapefruit juice. Placebo effect, or diminished liver capacity?", "by": "dr_dshiv"}, {"item_id": 21109252, "text": "I usually Lemon Tek when I take psilocybe: <a href=\"https:&#x2F;&#x2F;www.mushmagic.com&#x2F;blog-magic-mushroom-lemon-tek-a-way-to-trip-harder-n41\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mushmagic.com&#x2F;blog-magic-mushroom-lemon-tek-a-wa...</a>", "by": "neom"}, {"item_id": 21110053, "text": "I avoid grapefruit-anything. I’m on two pretty standard drugs, and they shouldn’t have any reactions, but I’d rather not take that chance anyway.", "by": "journalctl"}, {"item_id": 21109273, "text": "Shouldn&#x27;t there be a warning label in the Grapefruit section of supermarkets?", "by": "amelius"}, {"item_id": 21107925, "text": "Caffeine is on the list.<p>So a breakfast of coffee and grapefruit is a medically proven stimulating start to the day?", "by": "benj111"}, {"item_id": 21107837, "text": "Here&#x27;s a 2012 article from the NHS website on this topic which I think is more readable than the Wikipedia entry:<p><a href=\"https:&#x2F;&#x2F;www.nhs.uk&#x2F;news&#x2F;medication&#x2F;prescription-drugs-and-grapefruit-a-deadly-mix&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nhs.uk&#x2F;news&#x2F;medication&#x2F;prescription-drugs-and-gr...</a>", "by": "open-source-ux"}, {"item_id": 21108612, "text": "Also Fresca is packed with grapefruit juice.", "by": "british_india"}]