[{"item_id": 21110986, "text": "Interesting that the writers of this article are a company that sells a library to help developers detect their app running on jailbroken devices. <a href=\"https:&#x2F;&#x2F;blog.trailofbits.com&#x2F;2017&#x2F;10&#x2F;12&#x2F;ios-jailbreak-detection-toolkit-now-available&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.trailofbits.com&#x2F;2017&#x2F;10&#x2F;12&#x2F;ios-jailbreak-detect...</a>", "by": "nerdbaggy"}, {"item_id": 21110990, "text": "Yay!<p>I have fond memories of my friends (and eventually me, on the family iPad) jailbreaking our devices and doing stuff with them.<p>A <i>lot</i> of the things I saw from jailbreaks were incorporated into later iOS updates- I&#x27;m curious (and excited!) to see what develops out of this wave.", "by": "HeWhoLurksLate"}, {"item_id": 21111044, "text": "Honestly, if there&#x27;s a real security risk, I&#x27;m surprised Apple hasn&#x27;t recalled the phones or offered to repair them. Unpatchable firmware flaws are (or should be) no different from hardware flaws in this respect.", "by": "jasonhansel"}, {"item_id": 21111237, "text": "Prior discussion:<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=21099996\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=21099996</a>", "by": "js2"}, {"item_id": 21111540, "text": null, "by": null}, {"item_id": 21111022, "text": "I jailbroke my old iPhones but that was in an earlier less featureful iOS era. I wonder what hackers will be able to provide such that I&#x27;d do it on an SE. Curious now as much as I am skeptical.", "by": "CalChris"}, {"item_id": 21111332, "text": "Are there potential disadvantages involved with “demotion” to enable JTAG? From what I understand the process is permanent (eFUSE?) but it seems like a fun thing to play around with", "by": "ryeights"}, {"item_id": 21111239, "text": "This will delight the one person in ten thousand who wants to jailbreak their own phone, and the border police in Australia (mandatory scans of phone required on demand), or China, or stalkerware retailers, or repair shops who like to rat around on customers&#x27; phones.<p>Guess which will be the more common use?", "by": "rodgerd"}]