[{"item_id": 21103260, "text": "Timely, I&#x27;ll add it to my reading list. I&#x27;ve just (yesterday) finished &quot;The Corporation that Changed the World&quot;[1], that combines history of EIC and current (well, 2006) corporations and globalisation. It jumps about a fair bit (intentionally), as he draws lessons from the now mostly repealed regulations to stop EIC happening again, but well worth a read overall. Not afraid to dig into history of an utterly out of control corporation. A darker rendering than others I have seen with some surprises. Might have been even more interesting had he published a year after the 08 banking crisis.<p>We&#x27;ve failed to remember Adam Smith&#x27;s take on the corporation into modernity, just the Wealth of Nations. One for me to dig into further, as his actual views on companies don&#x27;t seem to match up with what we think he thought. :)<p>There were calls to wind EIC in, or wind it up going all the way back to the 1610s, and to give India back almost from the moment they arrived. Which continued constantly until it was finally forcibly wound up. All those dodgy stock splits, Theranos and Enron type frauds, countries wondering how to tame the out of control tech titan? EIC got there first. Just as willing to defraud Britain as anywhere else. As the first English joint stock company. As a near independent sovereign corporate with powers of justice, war and currency.<p>Ain&#x27;t nothing new then.<p>[1] <a href=\"https:&#x2F;&#x2F;www.goodreads.com&#x2F;book&#x2F;show&#x2F;844131.The_Corporation_That_Changed_the_World\" rel=\"nofollow\">https:&#x2F;&#x2F;www.goodreads.com&#x2F;book&#x2F;show&#x2F;844131.The_Corporation_T...</a>", "by": "NeedMoreTea"}, {"item_id": 21102784, "text": "&gt; In the course of this, in what seemed to many of its wisest minds an act of willful self-harm, the English had unilaterally cut themselves off from the most powerful institution in Europe, so turning themselves in the eyes of many Europeans into something of a pariah nation. As a result, isolated from their baffled neighbors, the English were forced to scour the globe for new markets and commercial openings further afield. This they did with a piratical enthusiasm.<p>Cor, perhaps it was deliberate, but I was so sure this was leading up to a comment on the current political climate.", "by": "OJFord"}, {"item_id": 21102659, "text": "My wife and I used to debate which were the most important inventions in history but both of us agreed that the joint stock corporation was in the top 5 along with the wheel, gear, and control of fire.", "by": "gumby"}, {"item_id": 21105758, "text": "For a more honest perspective, see;<p><i>&quot;Empire in Asia: How We Came by It. A Book of Confessions&quot;</i> by W.M.Torrens<p><a href=\"https:&#x2F;&#x2F;archive.org&#x2F;details&#x2F;empireinasiahow00torrgoog&#x2F;page&#x2F;n11\" rel=\"nofollow\">https:&#x2F;&#x2F;archive.org&#x2F;details&#x2F;empireinasiahow00torrgoog&#x2F;page&#x2F;n...</a>", "by": "rramadass"}, {"item_id": 21106204, "text": "I recommend reading this book as a supplement. <a href=\"https:&#x2F;&#x2F;www.amazon.in&#x2F;Inglorious-Empire-What-British-India&#x2F;dp&#x2F;1849048088\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.in&#x2F;Inglorious-Empire-What-British-India&#x2F;d...</a>", "by": "iamsb"}, {"item_id": 21104966, "text": "I&#x27;ll stick this here for anyone wanting to know the real history of EIC and not some fancy, all-so-rosy version presented by EIC apologists. As a constant reminder of the atrocities, plunder, destruction of culture and tradition carried by EIC in the garb of &quot;Industrialization&quot; and establishing &quot;Democracy&quot; for which Britain has never apologized:<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=f7CW7S0zxv4\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=f7CW7S0zxv4</a>", "by": "shripadk"}, {"item_id": 21105439, "text": "For a more general overview of world trade during the early modern era, I recommend Fernand Braudel:<p><a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;Wheels-Commerce-Civilization-Capitalism-15th-18th&#x2F;dp&#x2F;0060150912&#x2F;ref=mp_s_a_1_4?keywords=fernand+braudel+civilization+and+capitalism&amp;qid=1569737710&amp;s=gateway&amp;sprefix=fernand+&amp;sr=8-4\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;Wheels-Commerce-Civilization-Capitali...</a>", "by": "lkrubner"}, {"item_id": 21102804, "text": "India was one of the richest countries in the world, if not the richest before the East India company and Islamic, Dutch and British invasions. It used clay pots, not plastics and its population of 200 milloin plus had plenty of fertile land to develop agriculture and cotton - the oil of the time. It was the land that gave the world yoga, Ayurveda and the numerical system. Not to mention Indian food. Britain called it the jewel in the crown for this reason, no other country gave it more wealth than India. You could argue that the British are incredibly innefficient in one regard that they survived it&#x27;s meagre population of 10 million people off the back of this and made them wealthy whilst making a larger country impoverished. India didn&#x27;t need the industrial revolution, Britain did. India had natural leaf plates, Britain&#x27;s and west gave it an industry that it now has to rely on which is driven by coal production and climate change driving industries. What a mess", "by": "amriksohata"}, {"item_id": 21102912, "text": "...And then they became just vulgar drug dealers in China. &quot;Honorable&quot;.", "by": "29athrowaway"}]