[{"item_id": 21095625, "text": "A little bit meta here, but I know it&#x27;s going to come up: somebody is going to complain that Twitter is the wrong way to write this content. How they loved it but were infuriated to read it in snippets. Pre-emptively, I&#x27;m copy-pasting an earlier comment of mine on this:<p>&gt; Heh, from foone themself: <a href=\"https:&#x2F;&#x2F;threadreaderapp.com&#x2F;thread&#x2F;1066547670477488128.html\" rel=\"nofollow\">https:&#x2F;&#x2F;threadreaderapp.com&#x2F;thread&#x2F;1066547670477488128.html</a><p>&gt; Not to humblebrag or anything, but my favorite part of getting posted on hackernews or reddit is that EVERY SINGLE TIME there&#x27;s one highly-ranked reply that&#x27;s &quot;jesus man, this could have been a blog post! why make 20 tweets when you can make one blog post?&quot; CAUSE I CAN&#x27;T MAKE A BLOG POST, GOD DAMN IT.<p>&gt; The short story is they are quite open about having ADHD, and that&#x27;s what causes the long twitter rambles, but also what makes it very difficult to assemble it into a blog post. Every once in a while foone&#x27;s wife will edit a popular thread into a blog post, examples: <a href=\"https:&#x2F;&#x2F;foone.wordpress.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;foone.wordpress.com&#x2F;</a><p>&gt; If this seems like a particularly good story to you, maybe you&#x27;d like to edit it into a draft for a blog post and gift that to foone?<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=19884445\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=19884445</a><p>And yeah, as soon as I saw &quot;SNES Cartridges and Enhancement Chips&quot; and the twitter domain, I felt about 90% sure it wouuld be linking to a foone tweetstorm.", "by": "patrickyeon"}, {"item_id": 21095771, "text": "Fun fact about the SuperFX chip: it was turned into its own commercially-licensable IP core (the &quot;Argonaut RISC Core&quot;, or &quot;ARC&quot;), which became its own business, similar to ARM Holdings: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Synopsys#ARC_International\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Synopsys#ARC_International</a><p>Other fun fact: for a long while, Intel used an ARC core in its Management Engine.<p>That&#x27;s right—not only can your motherboard run rootkits; it can also run StarFox ;)", "by": "derefr"}, {"item_id": 21096404, "text": "Along these lines, Tom7 invented* &#x27;reverse emulation&#x27; which effectively uses a Raspberry Pi as a co-processor, allowing him to run [spoilers ahoy!]an SNES emulator on an NES.[&#x2F;spoilers]<p>The talk is brilliant:\n<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=ar9WRwCiSr0\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=ar9WRwCiSr0</a><p>* - as far as I know...", "by": "sdenton4"}, {"item_id": 21095457, "text": "With regards to compression chips; If someone can substantiate this vague recollection I have it would be great.<p>I seem to recall Nintendo charged a per-unit royalty based off of the ROM size of the cartridge, which would make including a dedicated decompression chip reasonable, particularly since they are likely fairly simple to design anyways.<p>[edit] In addition, the two games listed as using the S-DD1 were 32M,it and 48M,it roms (there were very few 48 Mbit roms and 32Mbit was considered &quot;large&quot;), so these were already fairly expensive cartidges.<p>Found a pic of the Star Ocean PCB; note that the S-DD1 takes up less PCB space then even 1 of the two ROM chips:<p><a href=\"https:&#x2F;&#x2F;snescentral.com&#x2F;pcbboards.php?chip=SHVC-LN3B-01\" rel=\"nofollow\">https:&#x2F;&#x2F;snescentral.com&#x2F;pcbboards.php?chip=SHVC-LN3B-01</a><p>[edit2] The SF Alpha PCB was much simpler by comparison:<p><a href=\"https:&#x2F;&#x2F;snescentral.com&#x2F;pcbboards.php?chip=SHVC-1N0N-01\" rel=\"nofollow\">https:&#x2F;&#x2F;snescentral.com&#x2F;pcbboards.php?chip=SHVC-1N0N-01</a>", "by": "aidenn0"}, {"item_id": 21095543, "text": "There was also a Super FX 2 which powered Doom, among a few other games. Notably Winter Gold looked quite good given the platform&#x27;s limitations: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=9uQlCZVb_Ro\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=9uQlCZVb_Ro</a>", "by": "makerofspoons"}, {"item_id": 21096000, "text": "This thread mentions the Super Gameboy. There&#x27;s a deeply fascinating series of blog posts about the Super Gameboy that everyone should read:<p><a href=\"https:&#x2F;&#x2F;loveconquersallgam.es&#x2F;post&#x2F;2350461718&#x2F;fuck-the-super-game-boy-introduction\" rel=\"nofollow\">https:&#x2F;&#x2F;loveconquersallgam.es&#x2F;post&#x2F;2350461718&#x2F;fuck-the-super...</a>", "by": "jordigh"}, {"item_id": 21095394, "text": "Software implementations of these chips can be found here<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;byuu&#x2F;higan&#x2F;tree&#x2F;master&#x2F;higan&#x2F;sfc&#x2F;coprocessor\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;byuu&#x2F;higan&#x2F;tree&#x2F;master&#x2F;higan&#x2F;sfc&#x2F;coproces...</a>", "by": "CodeArtisan"}, {"item_id": 21095576, "text": "This strategy was used in most cartridge-based systems that became popular enough to warrant the engineering effort. The original NES had &quot;mappers&quot; which accomplished similar feats, mostly expanding ROM &#x2F; RAM but also interesting actions like triggering interrupts when the PPU (Picture Processing Unit, nowadays called GPU) took certain actions. <a href=\"https:&#x2F;&#x2F;wiki.nesdev.com&#x2F;w&#x2F;index.php&#x2F;Mapper\" rel=\"nofollow\">https:&#x2F;&#x2F;wiki.nesdev.com&#x2F;w&#x2F;index.php&#x2F;Mapper</a><p>All of this was to squeeze more performance and make more advanced games.", "by": "seibelj"}, {"item_id": 21095646, "text": "Sega had their own version for the Genesis, the SVP: <a href=\"https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Sega_Virtua_Processor\" rel=\"nofollow\">https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Sega_Virtua_Processor</a><p>Virtua Racing was the only game released with it, but there were others planned for it originally. That is, until Sega decided to use the same technology for the 32X, which added a lot of power but was a terrible commercial failure.", "by": "codesushi42"}, {"item_id": 21096704, "text": " In theory, could you make some ultra-modern SNES game using a modern ARM chip or such in the cart? Still some basic system limitations, but running pretty much everything on the add-on chip?", "by": "tibbon"}, {"item_id": 21095478, "text": "Fascinating! Did any later gen systems besides the Nintendo 64 use these chips? Would it be possible to use a similar configuration in Switch cartridges?", "by": "claudeganon"}, {"item_id": 21098311, "text": "Wow I feel like gaming back in those days was the Wild West. So cool to edge up the competition with custom hardware", "by": "ct520"}, {"item_id": 21096769, "text": "Does anybody knows how emulators cope with such games? Can you find them as ROM files?", "by": "arebours"}, {"item_id": 21095636, "text": "It took Star Ocean forever to be emulated properly because of that co-processor chip!", "by": "rolltiide"}, {"item_id": 21097814, "text": "&gt; Rather than try to emulate the Game Boy on the SNES, they just included the CPU in the cart!<p>There’s no way you could do that anyhow", "by": "tanr54ok"}, {"item_id": 21095759, "text": "&gt; used by the Japanese-only RPG<p>What is the name of that game?", "by": "fireattack"}, {"item_id": 21096301, "text": "Ok - everyone should feel free to publish as they prefer. On the other hand lashing out at critics is unproductive.", "by": "kjar"}, {"item_id": 21099470, "text": "If anyone is interested in learning a little more about the 6502, Ben Eater recently did a video about it [0]. Also just in general if you hadn&#x27;t heard of his channel and are reading this comment, you&#x27;ll definitely enjoy what he does.<p>[0] <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=LnzuMJLZRdU\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=LnzuMJLZRdU</a>", "by": "fapjacks"}, {"item_id": 21099796, "text": "There&#x27;s actually a couple variants of Pilot Wings with different math coprocessors that act ever so slightly differently:<p><a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;foone&#x2F;status&#x2F;1126996260026605568?lang=en\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;foone&#x2F;status&#x2F;1126996260026605568?lang=en</a>", "by": "BuildTheRobots"}]