[{"item_id": 21098880, "text": "&gt; The Blue Fugates are shown in this colorized black and white photo. Date unspecified. Original source unknown, via ABC News<p>It’s somewhat dishonest to illustrate an article on color with a photo that was colorized by someone we don’t know at an unknow date-- i.e. we don’t know anything about how they decided which shade of blue to apply on their faces. So the only interesting information caried by the photo, the shade of the blue color, has no source.<p>Also, this appears to be largely copied from this ABC News article: <a href=\"https:&#x2F;&#x2F;abcnews.go.com&#x2F;Health&#x2F;blue-skinned-people-kentucky-reveal-todays-genetic-lesson&#x2F;story?id=15759819\" rel=\"nofollow\">https:&#x2F;&#x2F;abcnews.go.com&#x2F;Health&#x2F;blue-skinned-people-kentucky-r...</a>", "by": "hk__2"}, {"item_id": 21096493, "text": "A fascinating article, but it&#x27;s a bit frustrating that there are no colour photos. I tried searching the internet and found photos of other blue-skinned people but none of them had this genetic cause  (mostly it was silver &quot;supplements&quot;).", "by": "mkl"}, {"item_id": 21097437, "text": "The diagram explaining recessive genes uses blue for unaffected and red for affected. In an article about recessive genes for blue skin...", "by": "jere"}, {"item_id": 21100456, "text": "It&#x27;s possible I saw a member of the Fugate family back in the &#x27;80s. I grew up in West Virginia, not terribly far from the Kentucky state line. An older woman, perhaps in her seventies, was shopping in a local grocery store. I was old enough to know not to stare, but I wanted to, and couldn&#x27;t help but do a sly double-take. She was bluish. No other way to describe it. No one there to witness it ever seemed to believe me (not that I can blame them), but it was a few years later that I learned the name of the family and did some research. Photos of people who are doped with enough colloidal silver to cause argyria (I think that&#x27;s right) always make me think of her, and I often wonder if that was really what I saw at the time.", "by": "jwx48"}, {"item_id": 21096695, "text": "Some real gems in this article- “I’m kin to myself” and “she was as blue a woman as I ever saw” (how many blue people have you seen?)", "by": "porknubbins"}, {"item_id": 21097033, "text": "My mom developed blue skin in reaction to a medication she was taking.<p>The doctor was so interested in her body&#x27;s response he brought her in front of this university medical class. Apparently it&#x27;s quite rare. It went away a week or so later.<p>(cant remember the name of the medication but it was certainly not a listed side effect).", "by": "dmix"}, {"item_id": 21096768, "text": "&gt; <i>The Fugates he treated ingested this dye and within a few minutes, the blue coloration of their skin disappeared, and their skin turned pink.</i><p>Really? Within a few minutes??<p>Nitpick aside, such an interesting article! The world is such a big and interesting place!", "by": "ComputerGuru"}, {"item_id": 21097684, "text": "Weird.  I worked with a guy once whose parents believed colloidal silver would cure him of his ADD.  Instead he turned blue.", "by": "heyflyguy"}, {"item_id": 21098557, "text": "Are we going to talk about the absolutely ridiculous amount of ads in this article?", "by": "jevgeni"}, {"item_id": 21098020, "text": "This is fascinating. Krsna in the Indian epic Mahabharata is similarly blue in color.", "by": "throw244ggg"}, {"item_id": 21100535, "text": "If you want to see photos of that condition, search Google images for &quot;methemoglobinemia&quot;: <a href=\"https:&#x2F;&#x2F;tinyurl.com&#x2F;y6ct4ye3\" rel=\"nofollow\">https:&#x2F;&#x2F;tinyurl.com&#x2F;y6ct4ye3</a>", "by": "ZeljkoS"}, {"item_id": 21100713, "text": "That image from wikicommons showing how recessive genes are inherited but the affected person is red and the unaffected is blue.<p>I know the blue person in the image is not related to the article but it&#x27;s interesting how the article is about blue people yet the &quot;affected&quot; result is shown as red.", "by": "dghughes"}, {"item_id": 21098157, "text": "Once I donated blood and it came out green! Everyone was astonished. No idea why to this day, any ideas? Blood is back to its normal red color. Wasn’t taking any medications or feeling ill.", "by": "jquery"}, {"item_id": 21097971, "text": "Methemoglobinemia seems to be a popular medical topic lately. It&#x27;s an easily treatable disease, usually methylene blue is used, and it&#x27;s more an inconvenience than anything else.", "by": "Medicalidiot"}, {"item_id": 21099817, "text": "The travel channel did a segment on this a few years back: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=7d-07Ced410\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=7d-07Ced410</a>", "by": "tpayne84"}, {"item_id": 21101451, "text": "This is about as credible as a press release from [name of a prominent engineering school redacted]. There is no evidence of any blueness in the pictures.", "by": "mcnamaratw"}, {"item_id": 21100491, "text": "&gt;  the tint still comes out in their skin when they are cold or flush with anger.<p>It&#x27;s a bit hard to admit, but I&#x27;m really disappointed there isn&#x27;t a picture of this.", "by": "riffraff"}, {"item_id": 21102203, "text": "There is a much simpler explanation for that, silver in water. I assume that all the case is environmentally, not genetically related, or that the history is just fake.", "by": "pvaldes"}, {"item_id": 21100251, "text": "Ashamed of it and ridiculed?<p>I would have tought of it a fascinating and fashionable!\nEspecially with white hair.\nMan, I want that when I am old!<p>And yeah, their ancestors might have been incestous. But that isn’t the childrens’ fault, now is it.<p>Man, … people somtimes.", "by": "BAReF00t"}, {"item_id": 21097691, "text": "This reads like one of those ai generated stories...", "by": "the_giraffe"}, {"item_id": 21097910, "text": "here you go <a href=\"https:&#x2F;&#x2F;i.imgur.com&#x2F;NsD71Kh.jpg\" rel=\"nofollow\">https:&#x2F;&#x2F;i.imgur.com&#x2F;NsD71Kh.jpg</a>", "by": "reddotX"}, {"item_id": 21096675, "text": "Why was the color blue chosen by evolution?", "by": "nishnik"}, {"item_id": 21098001, "text": "I&#x27;m not convinced this is the real deal. Change my mind?", "by": "reilly3000"}, {"item_id": 21096526, "text": "Is this article a carnival sideshow? &quot;&lt;Family&#x2F;Individual&gt; had &lt;unusual genetic disease you&#x27;re unlikely to ever encounter&gt; that caused &lt;visible differences from other humans&gt;&quot;<p>I get it, we like to look at situations where people are different, but does this actually inform, educate, or improve us by reading? Or is this article just a chance to point out some people who are different.<p>I&#x27;ve been thinking about this recently, and trying to moderate my curiosity (because blue skin certainly piques my curiosity) against what I&#x27;m trying to get out of the article and what the people in the article get out of the article. Is the Fugate&#x27;s family improved by this? What about other people with methemoglobinemia? Are their lives improved?<p>Another way to think of it is, who benefits from this? Who is being put on display?<p>Edit:\nI ask because I think these are important questions to ask, and because I genuinely have a difficult time telling sometimes. It&#x27;s useful to see responses of how others interpret this.", "by": "Pfhreak"}]