[{"item_id": 21096144, "text": "I participated in men&#x27;s work, not specifically the ManKind Project but a closely related organization. I personally found it helpful doing weekly check-ins and having people holding me accountable to my goals.<p>Unfortunately, the stigma regarding men sharing feelings is prevalent in western society, and it&#x27;s not only the men causing it. When I told several female friends about the work they did, their response was: &quot;Are they gay?&quot;", "by": "bmarquez"}, {"item_id": 21098056, "text": "I love HN...I&#x27;ve been waiting for this topic :-D<p>I&#x27;m a man who has focused on and has been building tools to get better at expressing my emotions since 2012, including an app called iFeelio, in which I answered the question &quot;how do I feel&quot; over 4,000 times across 4 years and a class called Emotional Self-Defense, which I&#x27;ve run in the US, Europe, and Africa. I have realized and re-realized many things along the way.<p>One thing I&#x27;ve seen is that each culture seems to have rules about which emotions one is allowed to express and not allowed to express, based on the specific contexts. We often say that men aren&#x27;t allowed to express our emotions, but I don&#x27;t think that&#x27;s the case. We men (in the US) are often allowed to express anger, confidence, feelings of triumph, horniness (maybe), calmness, and maybe even excitement. We&#x27;re often not allowed to express tenderness, sadness, confusion, uncertainty, fury, etc. And funny enough, when watching our favorite sports team, we&#x27;re pretty much allowed to express all of the emotions above and more. On the other hand, in the workplace, we&#x27;re not allowed to really express much at all.<p>Women may have a different list, as well as people from the Midwest or California, those born in the 60s, digital natives, engineers, or really any different culture or sub-culture.<p>That being said, I&#x27;m glad to see programs like MKP and Evryman providing the place, and moreover, the permission, to express all of the emotions. (Save a Warrior is one I recommend for military vets—I was a witness on one of the programs and it really helped to open my heart and the hearts of the other guys.)<p>I&#x27;d love to chat with anyone on here about this, either in the comments or on Twitter, Telegram, keybase, or whatever people on HN use these days. Check my HN profile for those usernames.", "by": "jimkleiber"}, {"item_id": 21096346, "text": "Whats wrong with stoicism.  Feelings are fleeting in general didn&#x27;t lead me to positive places.  I think we should put a high value on people that can handle their own problems.", "by": "sabarn01"}, {"item_id": 21096372, "text": "I think we&#x27;re starting to hit a critical moment with this.<p>As men we have an unbelievable amount of expectation on our reactions, communication, behavior, past behavior, and others behavior. (Their friends and their partners)<p>On top of all of this: Men spaces have been mostly eliminated.", "by": "monksy"}, {"item_id": 21097128, "text": "Having gone through this retreat (the NWTA) with the MKP, I can easily point to it as the most legitimate and profound event I&#x27;ve had&#x2F;attended in my life. Its important to take in context, I&#x27;m in my mid 30s, and was emotionally ready for the messages and teachings. Doing the work in a safe space was nothing short of life changing. In my work life, personal life, and love life. And most of all for my own quality of life.<p>For anyone who is actually interested, I would recommend the book Iron John, by Robert Bly (<a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;Iron-John-Book-about-Men&#x2F;dp&#x2F;0306824264\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;Iron-John-Book-about-Men&#x2F;dp&#x2F;030682426...</a>). The first chapter is usually assigned reading before attending the NWTA, but when read with an open mind I found the entire book to be profound. Profound isnt the best word, but I experienced the content as if I personally was being spoken to through the pages; my problems, my struggles and my victories. Spoken to with support, compassion and understanding. I re-read it every year.<p>Beyond sharing that however, seeing how much vitriolic hyperbole is being thrown around within 2h of posting, I dont feel it productive to share anymore. You might say that the vulnerability it requires of a man to speak to other men (and women!) who are openly hostile (and often deliberately misunderstanding) about this topic can be nothing short of herculean.", "by": "oriel"}, {"item_id": 21096836, "text": "As a man, I agree sharing emotions is important. Too many males in society don&#x27;t have someone to cry with or listen to their problems.<p>On the other hand, I do worry about &quot;emotional masturbation&quot;. Simply put, sometimes we indulge ourselves in sadness&#x2F;fear&#x2F;anger because it makes us feel <i>something</i> and feeling <i>something</i> is better&#x2F;more exhilarating&#x2F;exciting than feeling nothing at all.<p>For example, I have some insecurities. Sometimes I feel like talking about them may be pro-actively bad because I am indulging myself and making my insecurities occupy more mental space&#x2F;brain power.", "by": "marmada"}, {"item_id": 21096353, "text": "Am I the only one who sees men sharing their feelings all the time?  To me it seems like men simply process things differently than women, so women and the feminized psychiatry field don&#x27;t recognize it&#x27;s happening.<p>We live in an age where men are being villainized at every turn, and this is just another way men are being told they don&#x27;t measure up... because they aren&#x27;t sharing in a way that women recognize.  With all due deference to my trans friends, men are not simply women with penises.", "by": "Consultant32452"}, {"item_id": 21096063, "text": "This might be one of <i>the</i> issues of our times: men unable to talk about their feelings, unable to maybe even care about themselves because we learned we shouldn’t and we are afraid how we are seen if we do.<p>Sometimes beeing strong means to become vulnerable.", "by": "atoav"}, {"item_id": 21096506, "text": "I wouldn’t take this as a representative sample of all men.<p>In my experience, sharing feelings makes me feel worse and substantially reduces my appeal to others. I prefer to just deal with my problems logically and avoid such navel gazing.", "by": "perlgod"}, {"item_id": 21099525, "text": "According to the San Jose Mercury News, the Sterling Institute of Relationship has a &quot;history of complaints&quot; at the Oakland, California division of the Better Business Bureau, and also at the Federal Bureau of Investigation.<p>The seminar was described in Details Magazine as having a &quot;cult like subculture.&quot; (Wikipedia)<p>Also this: <a href=\"https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;Brainwashed&#x2F;comments&#x2F;1tb1cb&#x2F;a_justin_sterling_and_the_sterling_institute_cult&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;Brainwashed&#x2F;comments&#x2F;1tb1cb&#x2F;a_justi...</a><p>Classic case of cult business.", "by": "michalu"}, {"item_id": 21096211, "text": "I&#x27;ve got a pet peeve for articles that focus on events as if they were isolated in time, one of a kind, or unprecedented.<p>No mention of similar mens groups that occurred 30 to 50+ years ago? There&#x27;s the Mythopoetic men&#x27;s movement for one.", "by": "kleer001"}, {"item_id": 21096269, "text": "I feel this article demonstrates why gender equality is damn hard for us right now.<p>I&#x27;m male. I believe that has had a significant effect on my upbringing.<p>I&#x27;m an individual.  I believe a whole lot of things have had a significant effect on my upbringing.<p>Why would I want to try to resolve my issues within this gendered framework? Am I really primarily male? That seems like a forced choice to me.", "by": "rebuilder"}, {"item_id": 21097278, "text": "I recently did the NWTA weekend retreat with the ManKind Project and found it a surprisingly profound experience. I would recommend it for most men I’ve known. Happy to answer any questions anyone has.<p>I’m not surprised to see so much pushback and gatekeeping here from other men, or suggestions that encouraging men to find spaces to “talk about their feelings” are a radical feminist ploy to subvert true masculinity, but I am saddened by them. That attitude reflects a deep sickness that is at the heart of what makes it so hard to be an authentic, open man in today’s culture. MKP and similar organizations are one of the few healthy forces I see working against this.", "by": "ryanwaggoner"}, {"item_id": 21098332, "text": "I only very recently came to the realization that my emotional numbness was caused by the emotional distance &amp; neglect I experienced as a child. I&#x27;m still working through it, but I do think part of it was in part due to my immigrant parents believing that emotions were reserved for girls and not boys.<p>Believe me, it&#x27;s not a fun place to be, and I hope new parents do realize how important it is to teach young children how to make sense of their emotions.", "by": "tempsy"}, {"item_id": 21096443, "text": "There is much beauty and wonder in the interplay between as well as within the genders. However, men are not imperfect women that would be improved if we adopted the other genders mannerisms. We both need to be open to listening to each other when providing the loving support that we want and need.<p>This article seem to be written by an ideologically inclined woman. A woman trying to understand the men in her life better might be helped more . by reading: <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;gp&#x2F;product&#x2F;1594151121&#x2F;ref=dbs_a_def_rwt_hsch_vapi_taft_p1_i1\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;gp&#x2F;product&#x2F;1594151121&#x2F;ref=dbs_a_def_r...</a><p>A man trying to understand the women in his life better might be helped by reading: <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;gp&#x2F;product&#x2F;1601425740&#x2F;ref=dbs_a_def_rwt_hsch_vapi_taft_p1_i2\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;gp&#x2F;product&#x2F;1601425740&#x2F;ref=dbs_a_def_r...</a>", "by": "asabjorn"}, {"item_id": 21097994, "text": "Isn&#x27;t this one of the surprising parts of growing old?  As a young person you may feel that your future self will be attended by loving family members and caring friends.  But, once you become a &quot;head of household&quot; or head of anything, it&#x27;s often quite the opposite.  Instead, you are responsible for attending to the emotional needs others.", "by": "holdenc"}, {"item_id": 21097831, "text": "<i>It focuses on men’s emotional well-being... and good old-fashioned male bonding. Minus ogling women, drinking or fist fighting, of course.</i><p>Nothing helps me get through feelings more than getting punched, and punching someone. Its the main reason I still goto hardcore&#x2F;punk shows.  The moshpit is a group therapy session.", "by": "dec0dedab0de"}, {"item_id": 21099744, "text": "It&#x27;s a meme right now that men, as a group, need to be more in touch with their emotions or should express their emotions better, or some variation of the fact. Basically the comparison is drawn to women with the subtext that women are doing it right and men should follow. Has anyone actually asked if that is in fact true? For example, the &quot;strong silent type&quot; (i.e. stoicism) is a an archetype across cultures and maybe for some (or most) men that is the better path forward for their mental well-being.", "by": "macspoofing"}, {"item_id": 21097669, "text": "I guess it&#x27;s a balance.  Sometimes, you need to face what you&#x27;re feeling.  Other times, you need to avoid getting caught up in it and just press forward.  I suppose it might also depend on the character of the feeling.  Some feelings seem more honest and connected to something bigger.  Other feelings can just torment a person and are like energy traps e.g. feelings of jealousy about not going to an elite college (I&#x27;ve struggled with this a lot.  And, as the years go by, I realize more and more that I don&#x27;t want to waste my time with it).  I guess it&#x27;s up to every person to figure out which is which in their own mind.", "by": "davesque"}, {"item_id": 21097663, "text": "I don&#x27;t want to go around picking on specific comments or arguments, but I still wanted to address what reads like a lot of insecurity and scar tissue, here...<p>- It&#x27;s better to understand people than to not understand them. Averages and stereotypes are not a great way to understand individual people.<p>- If you want to understand why a person did or thinks something, a good place to start is with a generous assumption that you might have done or thought the same if you had the same experiences. Reflect on what sort of experiences might fulfill this statement.<p>- Assume completely understanding an intelligence is impossible. If you haven&#x27;t before, pay close attention to your internal narrative(s) until you catch yourself telling yourself a story about why you did or said or thought something. This is you, reflecting on what sorts of experiences led you to do or think something. This is evidence that we don&#x27;t understand our own intelligence.<p>- Don&#x27;t be surprised if you find you are less generous when reflecting on what experiences lead you to do something than you are to others. You have, after all, been trying to understand why you do what you do your entire life. Look for opportunities to show yourself (and, more importantly, your internal narratives) that you care. This may feel stupid. Reflect on what experiences might lead you to think it is stupid to show yourself that you care.<p>- If you are more generous with yourself, you aren&#x27;t giving the rest of us enough credit. We all contain multitudes.", "by": "abathur"}, {"item_id": 21096547, "text": "<a href=\"http:&#x2F;&#x2F;archive.is&#x2F;thjVn\" rel=\"nofollow\">http:&#x2F;&#x2F;archive.is&#x2F;thjVn</a>", "by": "neonate"}, {"item_id": 21100145, "text": "Feels a little unnatural.", "by": "ykevinator"}, {"item_id": 21100560, "text": null, "by": null}, {"item_id": 21099408, "text": "I&#x27;ve done a bunch of these, even went to a jungle for two weeks. After a deep examination of years of this journey the experiences and getting to know the participants I found this to be very shallow kind of temporary relief, also putting aside the fact that it&#x27;s quite a shitshow and as a man you&#x27;ll lose a bit of a self respect.<p>I often looked around and all I&#x27;ve seen was men who don&#x27;t need more softness but more discipline. And women past their prime who are still childless but looking to find &quot;a meaning of life&quot; while continuing to delude themselves that the natural purpose of breasts and vagina was sexual pleasure.<p>On the contrary, I found the greatest relief in training Brazilian jiu-jitsu and joining a muay thai camp for a month.<p>It wasn&#x27;t far from a popular hippie site. But I looked around and I saw a big difference. A lot of these people on &#x27;retreats&#x27; aren&#x27;t seeking change, they are seeking a pleasurable and an EASY kind of change.<p>You have people there that cry a little take some drugs hug each other, some hoping to get laid and basically chill on a &quot;retreat&quot; thinking they&#x27;re doing &#x27;hard spiritual work.<p>On the contrary, I saw people in the camp that trained for 4-5 hours and woke up early morning, conquered the pain and comfort, got out of the bed and went on to train on their bruised feet. Every day.<p>And when you&#x27;re down, your muscles are out of your oxygen and you suffocate wrestling but still have time to go you start to converse with a voice on your head that wants you to give up and you&#x27;ll question a lot of things and learn a lot about who you really are but you will have to find energy where you think there&#x27;s none.<p>This rewires your brain not whining in the woods.<p>No you don&#x27;t need drugs and it doesn&#x27;t take strength to cry in a group where everyone cries.<p>The reason why all the westernized forms of buddhism and all sorts modified of Eastern practices and drugs like ayahuasca gain popularity is because people look for easy &quot;fast-food&quot; change.<p>Ironically people despair in comfort but look for comfortable way to get out of it.<p>Everyone who tried ayahuasca or crying in woods, or some other form of &#x27;retreat&#x27; knows the change lasts about a week.<p>Worse, some people get addicted to seeking this relief and continue falling back to depression actively, just so they can get back and get some hugs. I know it&#x27;s over-simplified but a lot of them will get addicted to the community and other paying attention to them even though it&#x27;s artificial they get more of it than in their real lives.<p>In better case, you&#x27;ll become a bozo kind of like Jim Carrey and crash parties just to tell everyone how deluded they are and how enlightened you are ... because duh fools, can&#x27;t you see what I see &quot;we&#x27;re all one.&quot;<p>Finally, after a decade of searching I found that classical philosophy and in fact christian philosophy, as ridiculed as it is in media and the western society, the true deep philosophy, not the shallow popularized image, it offers all of the hard work and depth none of these &#x27;retreats&#x27; will ever provide.", "by": "michalu"}, {"item_id": 21098614, "text": "Humanity lives in a bubble, and at the edge of that bubble is an incredibly harsh reality.<p>Someone has to stand guard, typically men.  Part of staring into the void is wearing emotional armor.  On occasion you should take a break, go towards the middle of the bubble, be safe and warm, take a bath, eat, drop your armor, etc.<p>But that doesn&#x27;t mean you were wrong to have worn armor at the wall.  Nor does it mean the bubble is reality.<p>Reality is harsh, and everyone is trying to forget that.  I commend those who refuse to.", "by": "seph-reed"}, {"item_id": 21096151, "text": "I really wish HN would implement a &#x27;no ny times&#x27; policy.", "by": "whalesalad"}, {"item_id": 21096693, "text": "Female sexual attraction favors secure men who don&#x27;t talk feelings. This results in men feeling unable to express their emotions around their significant other.<p>On the other side, male sexuality selects based on looks more than anything.<p>Feminism calls the latter shallow and toxic, but truthfully both should have that label. Neither is serving society or evolution well anymore. But what can we do? Sexual attraction is an innate, unchanging aspect of what it means to be man and woman. It isn&#x27;t going to be removed from our genes anytime soon.", "by": "pubby"}, {"item_id": 21099345, "text": "Why do I have to listen to all this women bullshit. I talk about my emotions as much as I want and yes, most of those emotions are being pissed off with something or someone. Why do I suppose to have all those feminine emotions which I don&#x27;t have? Why do I suppose to help myself in some way that obviously is not going to help me in any way. Men are not women, stop nag us, that will go much further than all those stupid advice by some lesbian feminists.", "by": "golemiprague"}, {"item_id": 21096571, "text": "How are we, men, supposed to take these articles seriously when we have so many examples of how bad it is to share our feelings?<p>Look at the character assassination of Stallman last week.  He shared his feelings with some women, and look at what happened to him.  If he had not communicated his desire to date some of these women, and not communicated his feelings about the confusing ethics (in his mind) surrounding sexual norms, he&#x27;d still be the leader of the FSF.<p>Instead, he (stupidly) did share how he was feeling about something, and did it publically, and look at what happened to him.<p>I&#x27;m sure every single man posting on this website has an example of a time when they shared how they were feeling, or were vulnerable, to some women, and had it blow up in their face.  I have.<p>These articles, written by women, telling men to be more self destructive are ridiculous, and certainly feel like they have an agenda.", "by": "xythrowaway"}, {"item_id": 21099577, "text": "If you think &quot;The Patriarchy&quot;^TM exists, you have a very simplistic, univariate understanding of reality.<p>You&#x27;re associating causality for whatever negative things happen to you in your life, not with your own set of circumstances, choices, or human agency, but rather with one single factor-- some ethereal 00.00001% group of conspiratorial, ostensibly straight white old men... with whatever happens to you in life.<p>It&#x27;s an absolutely foolish conceptualization &amp; mentality.  I&#x27;m afraid life is a bit more complicated than that, dear.", "by": "pdub123"}, {"item_id": 21096799, "text": "Bitches be trippin...", "by": "pg_is_a_butt"}, {"item_id": 21096898, "text": null, "by": null}, {"item_id": 21098733, "text": "I don&#x27;t understand the point of this article, it comes across to me as sheltered people with too much spare time maundering over petty, victimhood-ology nothingburgers. First responders and third-world climate refugees have real trauma to deal with compared to the petty whining and whinging of sub&#x2F;urban white-collar employees who don&#x27;t know how good they have it.", "by": "presidentscroob"}]