[{"item_id": 21095869, "text": "I think it&#x27;s situations like this that result in society having such a hard time with &#x27;science&#x27;. The term has been so heavily co-opted by fields that just don&#x27;t have sufficient rigger for the term to hold weight. Yet, on various topics, we have this publicized attack of &quot;your a science denier!&quot;. At the end of the day, there are two &#x27;types&#x27; of science, one where I can take the results and make accurate predictions, and one where I can&#x27;t. The later just amounts to &#x27;our best guess&#x27; where the accuracy is entirely unknown. If we want the general populous to &#x27;trust science&#x27;, we need to stop calling the later science. In short, if you can&#x27;t repeat and predict, stop calling it science.", "by": "mbell"}, {"item_id": 21095055, "text": "&quot;The paper received a great deal of attention, and was covered by over 80 media outlets including The Economist, the Boston Globe, the Los Angeles Times, and Scientific American.&quot;<p>And how many of these will cover the retraction? A dozen at most? And all those articles will be sitting out there, getting cited and read on occasion.", "by": "neaden"}, {"item_id": 21095364, "text": "Releasing your data should be a requirement for publication. If the original author had wanted to keep this a secret he could&#x27;ve withheld his data and nobody would&#x27;ve been able to correct him, there simply would&#x27;ve been discrepant studies.", "by": "ALittleLight"}, {"item_id": 21095396, "text": "Alas, these kinds of problems are not restricted to the social sciences. Case in point, this retraction from a couple of days ago: <a href=\"https:&#x2F;&#x2F;retractionwatch.com&#x2F;2019&#x2F;09&#x2F;25&#x2F;nature-paper-on-ocean-warming-retracted&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;retractionwatch.com&#x2F;2019&#x2F;09&#x2F;25&#x2F;nature-paper-on-ocean...</a> Very similar to this one really; the paper claimed to overturn our existing knowledge in a way that fitted a narrative people were inclined to believe (in that case: we&#x27;re all doomed) and was immediately seized on by all the news sites because of it, except the statistics were mucked up and it couldn&#x27;t show what it claimed to. The fact that it was so surprising should&#x27;ve been even more of a massive warning sign in that case though.", "by": "makomk"}, {"item_id": 21096231, "text": "Conclusion of the new analysis:<p><i>In sum, Decety et al. [1] have amassed a large and valuable dataset, but our reanalyses provide different interpretations of the authors’ initial conclusions. Most of the associations they observed with religious affiliation appear to be artifacts of between-country differences, driven primarily by low levels of generosity in Turkey and South Africa. However, children from highly religious households do appear slightly less generous than those from moderately religious ones.</i><p><a href=\"https:&#x2F;&#x2F;www.sciencedirect.com&#x2F;science&#x2F;article&#x2F;pii&#x2F;S0960982216306704\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sciencedirect.com&#x2F;science&#x2F;article&#x2F;pii&#x2F;S096098221...</a>", "by": "pygy_"}, {"item_id": 21095255, "text": "From the article:<p>Although Decety’s paper had reported that they had controlled for country, they had accidentally not controlled for each country, but just treated it as a single continuous variable so that, for example “Canada” (coded as 2) was twice the “United States” (coded as 1).<p>I mean I don&#x27;t even understand how this seemed like a normal thing to do?", "by": "shriphani"}, {"item_id": 21095616, "text": "Sometimes I feel weird coding zip codes as strings but this is a great example why.  If my program ever treats a zip code like a number I would like it to throw an error.  At least in this case the error looks like an accident.<p>On topic, from yesterday: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=21067764\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=21067764</a><p>It&#x27;s another social sciences paper but in this case a co-author has requested a retraction over his strong belief that the paper includes fabricated data.  The retraction request has been denied.  It differs from this paper in that the data anomalies look intentional.", "by": "_edo"}, {"item_id": 21095435, "text": "Another, more consequential paper that popped up on HN recently has been retracted as well. The one about ocean warming. The retraction notice is a masterclass on weasel language, worth reading in its own right.<p><a href=\"https:&#x2F;&#x2F;www.nature.com&#x2F;articles&#x2F;s41586-019-1585-5\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nature.com&#x2F;articles&#x2F;s41586-019-1585-5</a>", "by": "m0zg"}, {"item_id": 21098659, "text": "I wrote a webpage in 2015 about the Decety paper, what it was and how it was presented in the media, which might be of interest. The paper seemed highly suspect in various ways even at the time. I added an update in 2017 that &quot;new analysis shows that the original study failed to adequately control for the children’s nationality&quot;. On the (unfinished) page I&#x27;m using the paper as an excuse to teach myself basic statistics and research methods.<p><a href=\"http:&#x2F;&#x2F;www.adamponting.com&#x2F;decety&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.adamponting.com&#x2F;decety&#x2F;</a>", "by": "yesenadam"}, {"item_id": 21095907, "text": "so a categorical variable got mixed up as a numerical one and produced misleading results.<p>to the credit of the authors, they released their data sets. -- however, i suspect that proper data exploration and visualisation would have prevented all this. visual inspection would have most likely revealed that there is no visible effect, or even an effect in the opposite direction, and once you see this, all alarm bells should go off if your model predicts otherwise. so i suspect that the authors skipped some basic steps and got carried away by results that promised a nice headline.", "by": "realradicalwash"}, {"item_id": 21095426, "text": "There were even news sites that published articles about the original article AFTER the retraction was announced!  The state of science reporting is very sad.", "by": "whymsicalburito"}, {"item_id": 21095335, "text": "&quot;But when they included their categorically-coded country (1 = US, 2 = Canada, and so on) in their models, it was entered not as fixed effects, with dummy variables for all of the countries except one, but as a continuous measure. This treats the variable as a measure of ‘country-ness’ (for example, Canada is twice as much a country as the US) instead of providing the fixed effects they explicitly intended&quot;<p>How did this not get caught immediately? If I did a study and found out that kids in Zambia are 47 more times as generous as American kids that&#x27;d make me instantly suspicious.<p>Or maybe the reviewers were all Canadian &#x2F;s", "by": "rahidz"}, {"item_id": 21095188, "text": "As much as I like spreadsheets and other general purpose numerical analysis tools, I wish there was a restricted subset of their functionality that could be used that was more formally verifiable, to prevent issues like this and Reinhart–Rogoff (see: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Growth_in_a_Time_of_Debt#Methodological_flaws\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Growth_in_a_Time_of_Debt#Metho...</a> ) from being a common occurrence.", "by": "zdw"}, {"item_id": 21099127, "text": "I wonder if a religious education resulting in some positive effects might be akin to the &quot;any diet is effective&quot; thing, i.e. it&#x27;s not the specific upbringing as much as being exposed to _any_ moral thinking in general.<p>I don&#x27;t mean to imply that there aren&#x27;t moral a-religious educators of course, just that it seems likely to have less discussion of ethics for any kid once the temple&#x2F;church&#x2F;mosque&#x2F;whatever is removed.", "by": "riffraff"}, {"item_id": 21098443, "text": "Wait a second. If the issue with the analysis is as the article says, that is that some countries were weighted far higher, that means that in some countries the original conclusion does hold (probably for a small sample size). Perhaps this is because some religions promote generosity and some do not? Would be interesting to look in to.", "by": "krilly"}, {"item_id": 21098366, "text": "Fun to see all these software engineers criticizing scientists for a bug in their code", "by": "bshoemaker"}, {"item_id": 21099812, "text": "Can we go back to basic principles and all agree that psychology and social studies are not true sciences anyways?<p>Science is to me something where you extract natural laws that predict phenomena will occur 100% of the time given certain conditions. Physics, chemistry, computer science, most branches of medicine operate this way.<p>A field like psychology that says &quot;well sometimes people will...&quot; or &quot;we found in 60% of cases that...&quot; is not science. It&#x27;s a comment upon society maybe, but it does not produce broadly repeatable, predictable results.<p>Not true science.", "by": "imperio59"}, {"item_id": 21095310, "text": "And even though it was corrected and the result retracted, it was already cited by many papers, the media didn’t report the retraction etc. How much of scientific reporting gets skewed by media interests (controversy and sensationalism) and funding and political interests?<p>Furthermore, this whole field was called cargo cult science by Feynman, using correlations, p-hacking, data dredging, and more<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Multiple_comparisons_problem\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Multiple_comparisons_problem</a><p>The best analysis I have seen of the corner we have painted ourselves into<p><a href=\"https:&#x2F;&#x2F;slatestarcodex.com&#x2F;2014&#x2F;04&#x2F;28&#x2F;the-control-group-is-out-of-control&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;slatestarcodex.com&#x2F;2014&#x2F;04&#x2F;28&#x2F;the-control-group-is-o...</a>", "by": "EGreg"}, {"item_id": 21099582, "text": "&gt; Decety<p>What an apt name.<p>I wonder about the damage to public this unintentional deceit will bring...<p>Go science! After all, a retraction is part of discovery.", "by": "d0100"}, {"item_id": 21096591, "text": "This is fundamentally one of the many disastrous outcomes of scientific publishing being controlled by greedy conglomerates.<p>For the uninitiated: If you want to publish a scientific paper today, you basically sign up to sign over the rights to any publisher that&#x27;s interested (please someone publish me). That publisher will then review that paper in a more often than not mostly undisclosed process and publish that paper. Everyone knows that to be a high-regarded publisher one must have a very own typographic formatting: Unreadable font, weird multi column layout to prevent accessibility and tables disregarding standards are a good start. Afterwards, the paper gets published on the publisher website, which again follows as little agreed upon standard as possible. Data is of course excluded, study itself is in PDF. Also put up a fat paywall, don&#x27;t want those pesky poor people be scientifically literate. Give a few cents of your $70 fee to the authors, it is not an unethical business you&#x27;re doing here!<p>THIS is the systemic error people seem to be so happy to ignore because they&#x27;re neck deep in social science not being real science memes.<p>This prevents interesting new startups for fact-checking or meta analysis, which are e.g. happening in journalism because that field has a lot of the things science is sadly lacking.<p>This creates a drift between extremely rich and rather poor countries&#x2F;unis&#x2F;humans in scientific ability.<p>This generates a tar pit for scientific process.<p>This wastes billions in funds because of people unaware of each other doing redundant studies (and not referencing&#x2F;refuting&#x2F;supporting each other in the process neither, of course) because they are literally better search engines to find Harry Potter fan fiction than there are for finding studies.<p>And finally, this of course allows anything from honest statistical mistakes to snake oil sellers to slip through and doing generations worth of damage, because correcting, fact checking, re-researching, comparing, meta research, <i>anything</i> is slowed to a crawl.<p>So please stop embracing scientific elitism and gatekeeping for this is exactly what brought us here in first place...", "by": "blackbrokkoli"}, {"item_id": 21098469, "text": "Interesting, waitstaff on reddit always say religious people tip worse or not at all.", "by": "jimmaswell"}, {"item_id": 21098520, "text": "&gt; In fact, Decety’s paper has continued to be cited in media articles on religion. Just last month two such articles appeared (one on Buzzworthy and one on TruthTheory) citing Decety’s paper that religious children were less generous.<p>“Media articles” is carrying a lot of weight there", "by": "peteretep"}, {"item_id": 21099814, "text": "If a research does not release the code used in their research, their papers should not be trusted.  We wouldn&#x27;t trust a paper where the researchers hid their experimental methods or analysis - it wouldn&#x27;t even be allowed to be published.  But if their experimental methods or analysis are done in code, those parts are allowed to be a black box and we&#x27;re supposed to trust them.  If we were willing to just trust them, there wouldn&#x27;t even be a peer review process and it certainly wouldn&#x27;t deserve the imprimatur of &#x27;science&#x27;.  This has been a problem for years, and I will personally not be the least bit surprised if we eventually see a death toll attached to it.", "by": "otakucode"}, {"item_id": 21095178, "text": "My default presumption is that all results from the &quot;social sciences&quot; are false if they contradict my intuition. Whatever these fields are producing, it&#x27;s not science in the Popperian or practical sense. A ton of policy has been built on the bad research and wishful thinking of the past few decades, and it&#x27;s going to take a long time to unwind it all.<p>The problem, really, has been accelerating for a while. Something really went off the rails after WWII.", "by": "quotemstr"}, {"item_id": 21095968, "text": "I am from a third-world religious country and I&#x27;d just like to take this chance to say that religion should be classified as a mental disorder.<p>I see the effects of it first hand, severely crippling the potential of individuals and entire cultures. There&#x27;s nothing it offers that can&#x27;t be taught by basic morals which don&#x27;t require you to appease an imaginary entity or repress the human spirit.<p>Even the leaders of religious countries know it&#x27;s bullshit (see the UAE, where there are &quot;No Displays of Affection&quot; signs in upscale shopping malls but the streets are littered with cards advertising phone numbers for prostitution services), but maintain it as a convenient form of manipulation.<p>If a handful of Dungeons &amp; Dragons players got together and started dedicating all their actions to the Drow goddess Lolth they would be called loonies, but when millions of people worship an imaginary entity for centuries and erect monuments to it and start wars in its name, apparently that&#x27;s something that should be respected.<p>This is scary to even talk about. Not only would criticizing religion be frowned upon by first-worlders who seem to have a fetish for &quot;exotic&quot; cultures they have never lived in, it would put the critic at risk of physical harm in their own community.", "by": "Scapeghost"}, {"item_id": 21096054, "text": "Psychology, sociology and theology (and more logys?) was never meant to be sciences. We can blame the enlightenment for that idea, let’s revert them back to renaissance activities", "by": "cjohansson"}, {"item_id": 21095873, "text": null, "by": null}]