[{"item_id": 21099079, "text": "Frankly, scientific publishers represent institutionalised theft of tax payer money:<p>- Academics (most often publicly funded via grants and university salaries) do the work for free.<p>- They are expected to learn to use LaTeX and to typeset their work for free.<p>- They are expected to copy-edit the papers for free, or else pay a copy editor themselves with, you guessed it, public funds.<p>- Volunteer Academics (on university time and therefore, again, public money) are expected to review the work for technical accuracy and novelty. If done well this is <i>extremely</i> time consuming.<p>- Finally, the Journals have the temerity to charge the same universities who produce their product <i>millions</i> of pounds a year in journal subscriptions and Open Access fees.<p>- Finally finally, none of the Authors are <i>ever</i> paid for their work. Not that it matters, because again: public funding should mean public access.<p>The most frustrating part is that Academics themselves are locked into this system by the career prospects conferred by prestigious journals&#x2F;conferences.<p>I’m not normally one for beating the “nationalise them” drum, but if there has ever been a case for businesses to be dismantled and put in public hands it’s these parasites.<p>Sincerely, a Scientist :-)", "by": "hugofirth"}, {"item_id": 21098162, "text": "There&#x27;s a reference to one of the &#x27;value-add&#x27;s of commercial journals being copy-editing:<p>&gt; &quot;For example, most of PLoS ONE’s editors are working scientists, and the journal does not perform functions such as copy-editing.&quot;<p>But, in fact, in my personal experience, the for-profit journals don&#x27;t really do copy-editing anyway, but in fact <i>introduce</i> new errors into the paper which then the author has to pain-stakingly track down (or not).", "by": "_emacsomancer_"}, {"item_id": 21097206, "text": "The biggest problem for these sites is maintaining consistent domain names. But they always still seem to find a way.<p>The author also did a AMA&#x2F;FAQ style post on their website about the background of Scihub: <a href=\"https:&#x2F;&#x2F;engineuring.wordpress.com&#x2F;2019&#x2F;03&#x2F;31&#x2F;sci-hub-and-alexandra-basic-information&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;engineuring.wordpress.com&#x2F;2019&#x2F;03&#x2F;31&#x2F;sci-hub-and-ale...</a>", "by": "dmix"}, {"item_id": 21098108, "text": "Clever hacker Aaron Swartz was hounded by authorities for doing something similar, contributing stress that lead to his suicide.", "by": "peter303"}, {"item_id": 21098439, "text": "For anyone curious, she posted a few entries on her blog with corrections regarding The Verge&#x27;s article.<p><a href=\"https:&#x2F;&#x2F;engineuring.wordpress.com&#x2F;2018&#x2F;02&#x2F;16&#x2F;corrections-to-the-verge-article-about-sci-hub-part-3&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;engineuring.wordpress.com&#x2F;2018&#x2F;02&#x2F;16&#x2F;corrections-to-...</a><p>Personally Sci-Hub was invaluable when doing some exploratory research on Free Space Optics.", "by": "kipchak"}, {"item_id": 21099477, "text": "She’s a hero. Elsevier should be smothered, you can go spit on it’s doorstep at Amsterdam Sloterdijk.<p>And they’re here only because copyright royalties are undertaxed here in NL to “help the creative industry”.... bloody perverse newspeak", "by": "eecc"}, {"item_id": 21097416, "text": "under the academic publishers&#x27; system, now that I&#x27;m out of school I don&#x27;t even have access to a paper that I coauthored. very thankful for scihub and Elbakyan", "by": "bllguo"}, {"item_id": 21097639, "text": "Alexandra Elbakyan is probably one of the individuals who did the most for science in the recent years. And she is considered a criminal. We live in a crazy timeline.", "by": "Iv"}, {"item_id": 21097016, "text": "Previous discussion: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16332139\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16332139</a>", "by": "phoe-krk"}, {"item_id": 21111320, "text": "This article is from last year. I thought it was new.", "by": "NetOpWibby"}, {"item_id": 21097230, "text": "There are few things that piss me off more then finding papers paywalled for research that was done using public funds.. There should be a law against that!", "by": "jascii"}, {"item_id": 21098981, "text": "Elsevier, ACS and Co are just like patent trolls - pure harm and zero added value. Societal parasites.", "by": "xvilka"}, {"item_id": 21099081, "text": "Technically, the authors are allowed to send you copies if you contact them directly.<p>Can&#x27;t we outsource that to a service so authors can work on more important stuff?", "by": "panpanna"}, {"item_id": 21099676, "text": "Information is power. But like all power, there are those who want to keep it for \nthemselves. The world&#x27;s entire scientific and cultural heritage, published over centuries \nin books and journals, is increasingly being digitized and locked up by a handful of \nprivate corporations. Want to read the papers featuring the most famous results of the \nsciences? You&#x27;ll need to send enormous amounts to publishers like Reed Elsevier.<p>There are those struggling to change this. The Open Access Movement has fought \nvaliantly to ensure that scientists do not sign their copyrights away but instead ensure \ntheir work is published on the Internet, under terms that allow anyone to access it. But \neven under the best scenarios, their work will only apply to things published in the future. \nEverything up until now will have been lost.<p>That is too high a price to pay. Forcing academics to pay money to read the work of their \ncolleagues? Scanning entire libraries but only allowing the folks at Google to read them? \nProviding scientific articles to those at elite universities in the First World, but not to \nchildren in the Global South? It&#x27;s outrageous and unacceptable.<p>&quot;I agree,&quot; many say, &quot;but what can we do? The companies hold the copyrights, they \nmake enormous amounts of money by charging for access, and it&#x27;s perfectly legal — \nthere&#x27;s nothing we can do to stop them.&quot; But there is something we can, something that&#x27;s \nalready being done: we can fight back.<p>Those with access to these resources — students, librarians, scientists — you have been \ngiven a privilege. You get to feed at this banquet of knowledge while the rest of the world \nis locked out. But you need not — indeed, morally, you cannot — keep this privilege for \nyourselves. You have a duty to share it with the world. And you have: trading passwords \nwith colleagues, filling download requests for friends.<p>Meanwhile, those who have been locked out are not standing idly by. You have been \nsneaking through holes and climbing over fences, liberating the information locked up by \nthe publishers and sharing them with your friends.<p>But all of this action goes on in the dark, hidden underground. It&#x27;s called stealing or \npiracy, as if sharing a wealth of knowledge were the moral equivalent of plundering a \nship and murdering its crew. But sharing isn&#x27;t immoral — it&#x27;s a moral imperative. Only \nthose blinded by greed would refuse to let a friend make a copy.<p>Large corporations, of course, are blinded by greed. The laws under which they operate \nrequire it — their shareholders would revolt at anything less. And the politicians they \nhave bought off back them, passing laws giving them the exclusive power to decide who \ncan make copies.<p>There is no justice in following unjust laws. It&#x27;s time to come into the light and, in the \ngrand tradition of civil disobedience, declare our opposition to this private theft of public \nculture.<p>We need to take information, wherever it is stored, make our copies and share them with \nthe world. We need to take stuff that&#x27;s out of copyright and add it to the archive. We need \nto buy secret databases and put them on the Web. We need to download scientific \njournals and upload them to file sharing networks. We need to fight for Guerilla Open \nAccess.<p>With enough of us, around the world, we&#x27;ll not just send a strong message opposing the \nprivatization of knowledge — we&#x27;ll make it a thing of the past. Will you join us?<p>Aaron Swartz<p>July 2008, Eremo, Italy<p><a href=\"https:&#x2F;&#x2F;archive.org&#x2F;stream&#x2F;GuerillaOpenAccessManifesto&#x2F;Goamjuly2008_djvu.txt\" rel=\"nofollow\">https:&#x2F;&#x2F;archive.org&#x2F;stream&#x2F;GuerillaOpenAccessManifesto&#x2F;Goamj...</a>", "by": "oli5679"}, {"item_id": 21097160, "text": "2018", "by": "cpncrunch"}, {"item_id": 21099502, "text": "kind of open source science that we need", "by": "setnone"}, {"item_id": 21098599, "text": "Dear all fully-baked &quot;let&#x27;s decentralize the internet&quot; efforts,<p>Questions<p>1. Is the entirety of sci-hub smeared across the edges of your network?<p>End Questions", "by": "jancsika"}, {"item_id": 21097375, "text": "This is kind of disrespectful to Aaron Swartz:<p>&gt;Headlines reduced her to a female Aaron Swartz", "by": "jonnismash"}, {"item_id": 21098306, "text": "I have mixed feeling on Library Genesis and Sci-Hub. First and foremost, I recognize it&#x27;s essential good in providing journal access for all and it&#x27;s reformation of academic publishing. However, I can go to Library Genesis, and download just about any book I want, load it on a kindle, and am good to go! Does this hurt small time publishers and de-incentivise authoring niche technical works? Particularly for the niche technical topics, authoring a book is not possible as a full time job, and I wish there were a good mechanism to promote the creation of this type of work.", "by": "wespiser_2018"}]