[{"item_id": 21095930, "text": "Things that are more useful to know:<p>- What&#x27;s your mechanism for bias self-check?<p>- If someone gives you specs and you notice that something is off, what do you do?<p>- If you have to solve a problem you haven&#x27;t solved before, how do you approach it?<p>- What&#x27;s your take on accessibility on the web?<p>- What&#x27;s your process like for deciding that you&#x27;re at the point in your career where you can mentor others?<p>- What do you prefer to do when you see someone else getting nit-picked?<p>- You&#x27;re just about to finish a feature and have a great idea for improving it. What do you do?<p>For all of these things, people will likely give different answers but those answers will tell me a lot about whether or not they would end up being really useful for the kinds of teams I build.", "by": "msum"}, {"item_id": 21095793, "text": "How can you even answer any of these questions except with fluff and bullshit if you want to be hired? Google is supposed to be a data-driven company, but it&#x27;s impossible to extract any information out of bullshit, bullshit by definition is orthogonal to observable reality, it is neither truth, nor falsehood, it&#x27;s pure empty words.", "by": "HarryHirsch"}, {"item_id": 21096149, "text": "as a serial victim to sets of questions exactly like this earlier in my life, i&#x27;ve come to realize that &#x27;Culture-fit&#x27; is really just a coded honesty test -- and the most deceptive thing about it is that straight honesty is one of the quickest ways to do poorly at it.<p>in other words, answering &#x27;1. Why do you want to work for our company?&#x27; with &quot;Because I want a salary and I need to avoid destitution.&#x27; is a wholly appropriate answer, but it&#x27;s wrong.<p>They actually just want you to evangelize the company for a few minutes and lay on how envious you are of those that have &#x27;the opportunity&#x27; to &#x27;be a part of the revolution at X-Co&#x27;.", "by": "serf"}, {"item_id": 21096421, "text": "A lot of people are jumping on #3 (Tell me about a time you solved a problem at work). While I agree that #3 deserves criticism, I feel like #6 (Tell me about your preferred workday) and #8 (Describe your preferred relationship with coworkers) are even more problematic. As an introvert, as someone who likes quiet, my ideal workday consists of me getting into work at ~7:30am, working until ~4:30pm with about an hour off for lunch. I accept that meetings are a necessary evil, but I maintain that their necessity does not diminish their evil. I especially despise the &quot;daily standup&quot;, which is a completely pointless 15-20 minute interruption right during my peak concentration hours. And yet, if I actually gave that response to question #6, the <i>best</i> I could hope for is a sympathetic nod from my interviewer, and a mention about how they attempt to have a single day without meetings. Instead, I feel like I&#x27;m supposed to lie about how I like &quot;collaboration&quot; (code for meetings).<p>#8 (Describe your preferred relationship with coworkers) is, if anything, even worse. As someone who doesn&#x27;t like parties, and who doesn&#x27;t drink, I find it really awkward and draining to go out with coworkers. No offense, but if I&#x27;m with the same people for 40 hours a week, the last thing I want to do is spend more time with them (especially on a Friday afternoon or evening, which is when most after-work outings tend to occur). And yet, I feel like if I actually gave that answer at a lot of companies, I&#x27;d be immediately dismissed as &quot;not a culture fit&quot;, even though my skills are a very good match for the position.", "by": "quanticle"}, {"item_id": 21095701, "text": "The most generic and obvious set of questions ever.<p>Every single interview I’ve participated in (on both sides) has included some or all of these questions. There isn’t really anything new or interesting here.", "by": "cgrealy"}, {"item_id": 21096215, "text": "Many of those questions are iffy, a potential minefield or uninteresting, but this one (#3) is key and we use it a lot:<p>&quot;Tell me about a time you solved a problem at work. What was the issue, and how did you approach it?&quot;<p>What I like about it is that it isn&#x27;t a trick question. Also, knowing beforehand you&#x27;re going to be asked this won&#x27;t help you to bullshit your way through -- either you did stuff and can answer questions about it or you don&#x27;t. This question lets the interviewee discuss something they did and that they feel comfortable talking about, how they approached it, what their problem-solving approach was, etc. It also lets the interviewer ask follow-up questions about whatever sounds interesting to discuss in more detail.", "by": "the_af"}, {"item_id": 21098517, "text": "So, I&#x27;ve been self-employed for 20 years, doing custom software development at home and short-term (typically &lt;2weeks) on-site consulting).<p>I&#x27;ve been thinking about going back to work for a company full-time, as I&#x27;m getting tired of dealing with sales and marketing. I do it poorly.<p>I don&#x27;t know how to answer these questions, by which I infer that long-term self-employed people are rarely hired at Google.<p>#2: the last company I worked at was in 1999. I don&#x27;t remember enough about the culture to give a coherent answer. The on-site work I did for clients wasn&#x27;t long enough for me to understand their culture.<p>#3: &quot;independent troubleshooting and initiative&quot; is all that can apply for someone who&#x27;s self-employed.<p>#4: &quot;a team project you did at work&quot;. The best I can do is describe how I work for other companies in my development work.<p>#5: I ... don&#x27;t know how I would like to be managed. I guess, work with a manager who can help me figure out how I can be managed in a large corporate environment.<p>&quot;Follow-up questions: Tell me about a disagreement you had with your last manager.&quot; ... Again, 1999.", "by": "eesmith"}, {"item_id": 21098531, "text": "Useless &quot;world-as-you-want-it-to-be&quot; rather than &quot;world-as-it-actually-is&quot; questions. These questions simply encourage the interviewee to guess <i>expected answers</i> and provide them with a smile. They mean nothing.<p>Until and unless companies learn that &quot;Honesty&quot; and &quot;Trust&quot;(from both sides) are the only things which matter when it comes to measuring intangible character traits these sorts of questionnaires are bunkum.", "by": "rramadass"}, {"item_id": 21096657, "text": "Does anyone have good ways to determine if a company is a good culture fit for you, as an interviewee? I had an in-person this week where I tried the reverse of some of these - &quot;Can you tell me about a typical workday?&quot; &quot;How is the work-life balance here?&quot; and I just got BS fluff answers like &quot;Well there&#x27;s a variety of technical problems to solve here&quot;.", "by": "PascLeRasc"}, {"item_id": 21095559, "text": "OT: Google Hire has been discontinued.", "by": "ronilan"}, {"item_id": 21100239, "text": "After significant experience on both sides of the table I am completely lost.<p>As interviewer I feel the best I can do in the short time I have is to weed out those so incompetent and badly fitting where I wonder why they even applied for the job. E.g.Java developer position and they can&#x27;t do a simple stream.filter.map.collect task.<p>As interviewee I rarely even get the slightest interest of actually taking the job if they want me.<p>I usually don&#x27;t feel any enthusiasm on the other side and I have a hard time appearing to be enthusiastic myself. Candidates interests usually boil down to &quot;I want more money&quot;, &quot;I want a less outdated tech stack&quot;, &quot;I want better management&quot; and &quot;I am depressed and want change for change&#x27;s sake&quot;.<p>In the end, most software development jobs suck and employers are just looking for code monkeys, hoping they will find some that will stay for more than a year or two. Applicants are fed up with pretending they have any personal interest in software development beyond the wages they get for it.", "by": "Traubenfuchs"}, {"item_id": 21095754, "text": "&gt;<i>How would you describe the culture at previous companies you’ve worked at?</i><p>Somehow this one sounds like, &quot;tell me what you hated most about your last boss,&quot; insofar as it&#x27;s a bit of a minefield to answer in a professional way.", "by": "whatshisface"}, {"item_id": 21096273, "text": null, "by": null}, {"item_id": 21095826, "text": "&gt; 1. Why do you want to work for our company?<p>I don&#x27;t feel comfortable asking this question. Many of the people I interview are &quot;headhunted&quot; into an interview by an talent acquisition team. Are they even looking for a new job?", "by": "Pirate-of-SV"}, {"item_id": 21096119, "text": "We have such silly silver-bullet-like talking points at my company. I don&#x27;t follow them. It is to me too easy to make up&#x2F;twist past experience to match what the interview wants to hear. Oh yeah I hit that wall and used that clever way to ship in time... Oh yeah I learnt from such and such mistake... not a fan.<p>Instead, prior to the ITW I define clearly (with myself or an other interviewer) the information I want to hear or the parts of the intellect&#x2F;emotions I want to feel.<p>Example: wanna check if the candidate is autonomous? Instead of asking him if he prefers working in a big or small (or no) team and get a generic&#x2F;boring answer, I will ask the candidate how they prioritize tasks when no workflow can help them. Do they rely on gut feeling? perceived ROI? ask the manager? the client? In this mindset I know directly if there&#x27;s a clear match, and if not it is easy to dig in their way of thinking with a follow-up question (why&#x2F;how?).<p>Takes a bit of improvisation&#x2F;reactivity but at least I feel like I keep things interesting for everyone in the room when doing so.", "by": "vgrafe"}, {"item_id": 21095650, "text": "Also worth noting for candidates: These are great questions to ask your interviewers, to see if the company is a place you want to work at.", "by": "makeramen"}, {"item_id": 21101418, "text": "Classic HN, assuming these questions are only for technical roles.<p>If the only true signal in an interview is weeding out completely unacceptable candidates, these are great questions because the only goal should be staying in your lane with two hands on the wheel.<p>Also, reversing the questions can be insightful as a candidate.<p>Personally I think the biggest disconnect comes in the job descriptions and postings:  a lot of these preferences companies have about their candidates could just be openly posted and the candidates could self select themselves for fit.", "by": "kthejoker2"}, {"item_id": 21096093, "text": "<i>Most candidates will probably be prepared to answer this common question. Nonetheless...</i><p>as if being prepared for a question is a bad thing", "by": "nfRfqX5n"}, {"item_id": 21096502, "text": "These questions are good and seem standard to me.  Whenever interview questions come up on HN there are always many comments refuting them.  Any behavioral&#x2F;culture&#x2F;softskill questions will be bullshitted by sociopaths and liars. Any technical questions will be biased toward competitive coders and leetcode cramers, and they aren&#x27;t relevant for position X anyway.  IQ tests and brain teasers are less relevant for the job and in some cases potentially illegal. Take home tests take up too might time that you don&#x27;t get compensated for. Contract to hire takes even more time and doesn&#x27;t work for candidates that already have full time work. Not everyone has side projects that can be evaluated or contributes to open source, and even if they do it&#x27;s impossible to tell if the candidate did th actual work.  Every way of evaluating programmers sucks unless I&#x27;m missing a magic bullet?<p>My question is at what point does a candidate show such skill at gaming interview system(s) that it doesn&#x27;t matter if they are bullshitting or had to study for your interview? If they apply the same skills to the job they&#x27;re likely to be successful in most tech roles, and given corporate or start up structures and politics these candidates might be significantly better than more &quot;genuine&quot; candidates.  The only places I think standard tech interview variants might break down is hiring for creativity and for ethical behavior (ethical behavior and rule following being different things).  I&#x27;m not sure if either of those are important in most tech roles and they might actually be determintal.", "by": "Impossible"}, {"item_id": 21096374, "text": "&gt; 9. How do you maintain a work-life balance?<p>Pretty sure the candidate is supposed to ask the interviewer that one...", "by": "OhHeyItsE"}, {"item_id": 21098592, "text": "These questions assume the person has significant prior experience, which makes them unusable for a decent amount of hiring.<p>At my previous job, we got a set of generic questions like this on our hiring forms from HR. I don&#x27;t think anyone in my group ever asked them. It&#x27;s impractical to ask a bunch of open ended questions like this, and also engineering questions, in a 45 or 60 minute time slot.", "by": "nitwit005"}, {"item_id": 21096459, "text": "From the WSJ recently...&quot;The Dangers of Hiring for Cultural Fit&quot;<p><a href=\"https:&#x2F;&#x2F;www.wsj.com&#x2F;articles&#x2F;the-dangers-of-hiring-for-cultural-fit-11569231000\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wsj.com&#x2F;articles&#x2F;the-dangers-of-hiring-for-cultu...</a>", "by": "tempsy"}, {"item_id": 21099847, "text": null, "by": null}, {"item_id": 21096388, "text": "I honestly don&#x27;t even know what I would answer for #2.  It really sounds like one of those terminology questions to get people who think in the exact terms you use.", "by": "protomyth"}, {"item_id": 21098635, "text": "Orwellian in more than one manner.", "by": "jdkee"}, {"item_id": 21097458, "text": "Google should give people a chance to adapt to their work culture instead of rejecting them.", "by": "morkfromork"}, {"item_id": 21100811, "text": "Keep in mind this is content marketing for a dead Google product, nothing more", "by": "subpixel"}, {"item_id": 21095812, "text": "this is terrible", "by": "vzaliva"}, {"item_id": 21096072, "text": "I wouldn&#x27;t have published this.", "by": "hnspirit"}, {"item_id": 21098486, "text": "Off topic but I interviewed at Apple (SWE) and brought a cheap Chinese phone (Xiaomi) to the onsite. I didn&#x27;t get the job. A factor?", "by": "person_of_color"}]