[{"item_id": 21108296, "text": "For those wondering, here’s how GoodRx works and makes money:<p>1. GoodRx obtains prices of drugs at all pharmacies through contracts it has with PBMs (middleman that determines insurance payouts to pharmacies).<p>2. Pharmacies have wildly different prices from one another - going to one pharmacy over another can save you and your insurance a lot of money.<p>3. When you use a GoodRx coupon, the insurance company pays GoodRx a small amount as they had to spend less on their patient thanks to the coupon (i.e they didn’t use a super expensive pharmacy).<p>4. The pharmacy pays GoodRx a referral fee (kind of like a restaurant pays yelp a referral fee when you use a yelp coupon).<p>Over the last 5 years, insurance companies are increasingly pushing high deductible plans on to employers. As a result, patients are way more price sensitive than they used to be. If you had no deductible, you probably wouldn’t care too much about drug price differences because the copays wouldn’t be that different. However, due to these new plans you care a lot more and hence services like GoodRx and Blink become a lot more important.", "by": "dhruvp"}, {"item_id": 21106483, "text": "I’m confused as to what value GoodRx adds in the payer - provider - patient chain?<p>Is this another data harvesting play?  Why would insurance companies give GoodRx a piece of their revenue?  They all have their own PBMs.<p>Why would a pharmacy give them a piece of their revenue?  They can just charge $0.01 less to the patient and not have to pay a commission to GoodRx.", "by": "lotsofpulp"}, {"item_id": 21107032, "text": "A 90 day supply of my 3 generic drugs using GoodRx is cheaper than 30 day supply using insurance.", "by": "woofyman"}, {"item_id": 21109492, "text": "I have used GoodRx when I did not have insurance.  I believe that is a very significant part of its business model.<p>Adding &quot;prescription services&quot; now, essentially GoodRx is becoming a health insurance company that doesn&#x27;t actually do the insurance part.  I mean, it&#x27;s really offering virtual doctor visits.<p>So the next step would be &quot;emergency coverage&quot; for an &quot;additional monthly service fee&quot; with an optional &quot;self-pay threshold&quot; for lower monthly fees and higher &quot;emergency assurance&quot;.<p>I think it would be a good thing if they could take it all the way.  The thing that is not clear is whether any company could actually make that profitable without excluding people who had certain expensive conditions.", "by": "ilaksh"}]