[{"item_id": 21094512, "text": "It&#x27;s good to see the honest qualifications in the article:<p>&gt;Mason&#x27;s team was able to identify specific plastics over 100 microns (0.10 mm) in size but not smaller particles. According to experts contacted by CBC News, there is a chance the Nile Red dye is adhering to another unknown substance other than plastic.<p>&gt;Mason leaves open that possibility but leans strongly to the smaller particles being plastic.<p>&gt;The developer of the Nile Red method agrees.<p>&gt;Fluorescing particles that were too small to be analyzed should be called &quot;probable microplastic,&quot; said Andrew Mayes, senior lecturer in chemistry at the University of East Anglia in the U.K.", "by": "Isamu"}, {"item_id": 21094821, "text": "Went looking to see what the comparison to tap water was:<p>&gt; Orb found on average there were 10.4 particles of plastic per litre that were 100 microns (0.10 mm) or bigger. This is double the level of microplastics in the tap water tested from more than a dozen countries across five continents, examined in a 2017 study by Orb that looked at similar-sized plastics.<p>Worse... it&#x27;s worse than tap water.", "by": "slowmovintarget"}, {"item_id": 21094685, "text": "I wonder if all the articles talking about the prevalence of microplastics, are in actuality demonstrating the safety of microplastics.<p>If it is in 93% of bottled water, and bottled water is used by millions of people (according to <a href=\"https:&#x2F;&#x2F;www.consumerreports.org&#x2F;bottled-water&#x2F;should-we-break-our-bottled-water-habit&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.consumerreports.org&#x2F;bottled-water&#x2F;should-we-brea...</a> around 110 Million people in the US avoid drinking tap water), then there has been widespread exposure to microplastics.<p>It does not seem like there has been huge health consequences due to microplastics, so microplastics are probably pretty safe for humans.", "by": "RcouF1uZ4gsC"}, {"item_id": 21097074, "text": "See also:<p>* Microplastics found in 93% of bottled water tested in global study<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16793888\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16793888</a><p>* Microplastics found in 90 percent of table salt<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=18248471\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=18248471</a><p>* Microplastics Are Blowing in the Wind<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=19672514\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=19672514</a><p>* Microplastics found in supermarket fish, shellfish<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14245133\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14245133</a><p>I think people around the world have been ingesting microplastic for 30 years or longer, yet there&#x27;s no reported case of any direct toxic effects. So I guess microplastic doesn&#x27;t have immediately effects on health, but I won&#x27;t be surprised if future studies find longterm effects, such as increasing the risk of cancer, damage to the circulatory system or the brain.<p>Overall, I think we must take actions immediately for solutions, but I won&#x27;t particularly worry about this problem and I&#x27;ll continue buying bottled water. It&#x27;s not unlike the air pollution in the 20th century, one has to live with it.<p>Nevertheless, &quot;microplastic is going to kill all of us&quot; surely is going to be the trope of the next decade.", "by": "segfaultbuserr"}, {"item_id": 21094820, "text": "Was there some sort of scientific breakthrough that has allowed researchers to find these microplastics for the first time, or is it just that nobody had looked yet?", "by": "makerofspoons"}, {"item_id": 21094863, "text": "I was curious if the micro-plastics could be coming from the bottles they are packaged in. The article says...<p><i>It&#x27;s not clear how the plastic is getting into the bottled water — whether it&#x27;s the water source itself or the air or the manufacturing and bottling process.<p>&quot;Even the simple act of opening the cap could cause plastic to be chipping off the cap,&quot; Mason said.</i><p>I think it&#x27;s easy to assume it&#x27;s from the water source, &amp; or a low quality filtration process, but it could very well be from the same bottle you are holding.<p>I suspect it&#x27;s a combination of both. Is it possible some of the brands with higher counts use a lower quality plastic for the bottle &amp; cap? This also makes sense to me since San Pellegrino has the lowest profile, and often comes in glass.", "by": "40four"}, {"item_id": 21094499, "text": "The actual breakdown by brand: <a href=\"https:&#x2F;&#x2F;dpy68rfhp0glq.cloudfront.net&#x2F;styles&#x2F;large&#x2F;s3&#x2F;2017_Microplastics_BottledWater_Results_Graphic_desktop_0.jpg?itok=zjViks1U\" rel=\"nofollow\">https:&#x2F;&#x2F;dpy68rfhp0glq.cloudfront.net&#x2F;styles&#x2F;large&#x2F;s3&#x2F;2017_Mi...</a>", "by": "css"}, {"item_id": 21094446, "text": "The report is here in a funky interactive webpage: <a href=\"https:&#x2F;&#x2F;orbmedia.org&#x2F;stories&#x2F;plus-plastic&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;orbmedia.org&#x2F;stories&#x2F;plus-plastic&#x2F;</a> The brands and levels of microplastic are about halfway down.", "by": "sp332"}, {"item_id": 21095485, "text": "I was under the impression Gerolsteiner and San Pellegrino were from deep under ground springs where it took the water decades or more to filter down into the source where the bottler draws it from. Are the plastics somehow in the source or are they being introduced in another way, perhaps when the bottles are washed, handled, etc before filling?", "by": "hourislate"}, {"item_id": 21096134, "text": "The paper for people who wanna look at which brands, etc:<p><a href=\"https:&#x2F;&#x2F;www.researchgate.net&#x2F;publication&#x2F;327574651_Synthetic_Polymer_Contamination_in_Bottled_Water&#x2F;link&#x2F;5b97bd1492851c4ba80dcf24&#x2F;download\" rel=\"nofollow\">https:&#x2F;&#x2F;www.researchgate.net&#x2F;publication&#x2F;327574651_Synthetic...</a><p>If you just want the brand summary here is the image: <a href=\"https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;l2mDlNf\" rel=\"nofollow\">https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;l2mDlNf</a><p>Great detail and work.<p>Note:<p>&gt; Of all the lots tested, only one was packaged in glass rather than plastic: Gerolsteiner [...] the same brand of water but packaged in plastic instead of glass was also tested [...] While both of these packaged waters have the same water source, there was considerably less microplastic contamination within the water bottled in glass as compared to that packaged in plastic", "by": "simonsarris"}, {"item_id": 21095353, "text": "And I should care about this why exactly? They haven&#x27;t been found to be harmful to humans. Best I can tell we just poop it all out. This has all the hallmarks of a manufactured crisis that&#x27;s not actually a crisis.", "by": "m0zg"}, {"item_id": 21097203, "text": "They&#x27;re also in tap water <a href=\"https:&#x2F;&#x2F;www.theguardian.com&#x2F;environment&#x2F;2017&#x2F;sep&#x2F;06&#x2F;plastic-fibres-found-tap-water-around-world-study-reveals\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theguardian.com&#x2F;environment&#x2F;2017&#x2F;sep&#x2F;06&#x2F;plastic-...</a><p>Alot of people started drinking bottled water as a way around the problem.<p>Startup idea: Microplastic free bottled water", "by": "aussieguy1234"}, {"item_id": 21094534, "text": "This is a 2018 article, just in case it isn&#x27;t evident for anyone. The fact remains, though, and it is probably worse a year after.", "by": "davidcollantes"}, {"item_id": 21094882, "text": "Distilled water and glass bottles are the way to go. You can get a small distiller for your home relatively cheaply.", "by": "redm"}, {"item_id": 21096589, "text": "Direct link to the study (published Sep 2018):<p>HTML: <a href=\"https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pmc&#x2F;articles&#x2F;PMC6141690&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pmc&#x2F;articles&#x2F;PMC6141690&#x2F;</a><p>PDF: <a href=\"https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pmc&#x2F;articles&#x2F;PMC6141690&#x2F;pdf&#x2F;fchem-06-00407.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pmc&#x2F;articles&#x2F;PMC6141690&#x2F;pdf&#x2F;fch...</a><p>Alternative PDF version: <a href=\"https:&#x2F;&#x2F;orbmedia.org&#x2F;sites&#x2F;default&#x2F;files&#x2F;FinalBottledWaterReport.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;orbmedia.org&#x2F;sites&#x2F;default&#x2F;files&#x2F;FinalBottledWaterRe...</a>", "by": "mrb"}, {"item_id": 21101778, "text": "Does it matter? Do our bodies absorb the stuff? Millions of years primates have been scrounging in the dirt for food. Crystals, metals and organics have been running through our gut for millenia. I am more concerned with absorbed uncured plastic monomer.", "by": "bawana"}, {"item_id": 21097261, "text": "Highly recommend zero water or another in-house filter. In Mountain View, CA or South San Francisco - one zero water filter last me hundreds of gallons. In Mesa, AZ it only last me around 50 gallons but that is still competitive with a water and ice except that you don&#x27;t have to drive the water back to your house.", "by": "cr4zy"}, {"item_id": 21096014, "text": "The real question: is municipal sourced water &quot;better&quot; (have fewer plastics) than bottled water?<p>Edit: article says tap water is better", "by": "anonu"}, {"item_id": 21096631, "text": "Ugh, I drink San Pellegrino like it is water. :) There is one sitting next to me as I type this. I like the &quot;fuzzy water&quot; as my daughter called it when she was 2.<p>Any studies on if it is in the tab water and the effects of something like a Britta filter on taking them out? Our house water is though that.", "by": "myrandomcomment"}, {"item_id": 21096007, "text": "Has only bottled water been studied? I wonder how many microplastics are found in gallon milk and sodas?", "by": "abootstrapper"}, {"item_id": 21099945, "text": "When you buy bottled water, you buy a bottle with water in it.", "by": "NilsIRL"}, {"item_id": 21095882, "text": "Isn&#x27;t most bottled water bottled in plastic?<p>The bottle is plastic. The lid is plastic too.<p>When you&#x27;re opening the bottle, plastic is rubbing against plastic, and then water is pouring over it.<p>Even glass-bottles typically have a lid that has a plastic sealing layer inside.", "by": "forgotmypw3"}, {"item_id": 21096734, "text": "Interesting,  makes me want to put some microplastics in our DNA sequencer &#x2F; robotic fluorescent microscope and have a scan.<p><a href=\"https:&#x2F;&#x2F;reseq.hackteria.org\" rel=\"nofollow\">https:&#x2F;&#x2F;reseq.hackteria.org</a>", "by": "kasbah"}, {"item_id": 21096321, "text": "Can a reverse osmosis filter remove microplastics?<p>How dangerous are microplastics?", "by": "ilaksh"}, {"item_id": 21094976, "text": "Has a similar study been done to look at sandwich bags? Grocery bags?", "by": "aresant"}, {"item_id": 21096488, "text": "Water is commonly treated with membranes. Membranes are made from polymers and have with sub-micron dimensions. Could this be the source of microplastics?", "by": "zczc"}, {"item_id": 21096747, "text": "bet you it is still not enough to convince those water bottle people to stop using it and move back to tapwater.<p>bottled water - one of the biggest scams of the decade.", "by": "kenned3"}, {"item_id": 21098965, "text": "Does it state anywhere that they get absorbed in the bloodstream or they get out of the system via natural route?", "by": "cryptozeus"}, {"item_id": 21096039, "text": "At least in the EU most milk packaging is lightly coated with silver on the inside which helps with durability, don’t know how it is in the US.", "by": "atoav"}, {"item_id": 21096331, "text": "Does boiling water vaporize the micro plastics?", "by": "theklub"}, {"item_id": 21098863, "text": "Does anyone have a source for the % of micro plastics in typical tap water?", "by": "steveharman"}, {"item_id": 21095624, "text": "as if the macroplastics <i>around</i> the bottled water aren&#x27;t a much bigger concern...", "by": "markhahn"}, {"item_id": 21098502, "text": "I wish they would have listed the brands of the 7% that passed.", "by": "elif"}, {"item_id": 21095468, "text": "So, what should we drink?", "by": "andreygrehov"}, {"item_id": 21097504, "text": "one of the reasons we moved to Bariloche, Patagonia.. is that we get fresh water directly from the Andes.. tastes like heaven. Welcome to the Thunderdome.", "by": "artur_makly"}, {"item_id": 21098092, "text": "Is it dangerous?", "by": "peter303"}, {"item_id": 21098611, "text": "Plastics in water that is stored in plastic... very surprising. Glad we have science to tell us this...", "by": "adameast1978"}, {"item_id": 21095477, "text": "Phthalates are the new smoking", "by": "nickysielicki"}, {"item_id": 21095473, "text": "shameless plug for king gizz.<p><a href=\"https:&#x2F;&#x2F;genius.com&#x2F;King-gizzard-and-the-lizard-wizard-plastic-boogie-lyrics\" rel=\"nofollow\">https:&#x2F;&#x2F;genius.com&#x2F;King-gizzard-and-the-lizard-wizard-plasti...</a>", "by": "brootstrap"}, {"item_id": 21094693, "text": "Plastic found in water contained in a plastic bottle. Not really shocked.", "by": "thomaswang"}, {"item_id": 21098769, "text": "Every bit helps. If you are a male who shaves, just try switching over to DE razors. It has no plastics whatsoever and it feels great on the skin - unless you have no basic motor skills and cut yourself silly.\nI switched over a decade ago and I’d never go back to plastic disposable razors.", "by": "innagadadavida"}, {"item_id": 21096304, "text": null, "by": null}, {"item_id": 21095781, "text": "Which SUNY?", "by": "williesleg"}, {"item_id": 21095895, "text": null, "by": null}, {"item_id": 21097289, "text": "No wonder about the results. “The water tested was purchased in the U.S., Kenya, China, Brazil, India, Indonesia, Lebanon, Mexico and Thailand” - so basically just third world countries without strong food safety regulations.", "by": "meche123"}]