[{"item_id": 21094564, "text": "I found this website really weird, with no &quot;About us&quot;, so I searched some more.<p>&quot;Elliot Shefler&quot; (some publications put his name in quotes) is a co-founder, but he does not want to appear in photos and online profiles himself. He is Turkish-Jewish and spent most of his life working in ad-tech and online gambling. He claims his algorithms were developed by an agency with links to the Israeli military (this is repurposed military&#x2F;PSYOP technology?). His whereabouts are unknown, circling between Germany, London, and LA.<p>In 2018 the price was 29$, now its 49$. Elliot claims $5.1 million revenue for 2018. Most customers are men, most customers want to initiate sex with a target. Nobody follows up to complain if it wasn&#x27;t successful, since they are very much part of the conspiracy to manipulate. Elliot plans to share information with bigger advertisers: &quot;A woman who wants a target to propose to her, would be in great proximity to a person that is in the market for an engagement ring&quot;.<p>This service is illegal in Europe, due to data protection and anti-tracking laws. The site has about 10 employees and one British company who works the contracts with bigger companies.<p>&gt; “The value is in retention, not in the acquisition,” he said.<p>&gt; He related a story about one insurance company he was commissioned work on, where he would target the insurance agents at the company to “brainwash and manipulate” them and change the perception of the company itself with the goal of retaining those agents.<p>&gt; “We planned a similar campaign with a big pharmaceutical company that was targeting doctors (not patients—doctors) with articles about the benefits of a certain medicine.”<p>&gt; ... if he feels the same targeting tools he leverages for The Spinner could be vulnerable to possible misuse, his response was matter-of-fact:<p>&gt; “I would prefer using the word “effective” instead of ‘vulnerable.’ The answer is: highly effective.”<p>Very, very shady.", "by": "ipsa"}, {"item_id": 21094955, "text": "For those who find this horrifying, the [typically unstated] assumption is that it works. I&#x27;m pretty skeptical of this. Think about it: what do you imagine the effect size is of seeing 10 articles like &quot;4 Secrets to Losing Weight and Feeling GREAT While You Do It!&quot; in your Facebook feed? I&#x27;d bet it&#x27;s essentially 0. If seeing these kinds of articles is all it took to improve our body composition, then we&#x27;d all be absolutely shredded.<p>I&#x27;m not trying to argue that advertising doesn&#x27;t work. Clearly it does. But there&#x27;s a huge difference between being exposed to tens of thousands of Coca-Cola ads over a lifetime, and being exposed to 10 spam articles over the course of a month.<p>I&#x27;m also not trying to argue that this isn&#x27;t creepy. Clearly it is. But the real &#x27;target&#x27; of this scheme is the person buying the ads. I doubt this has any real effect on the person who sees them.", "by": "Chickenality"}, {"item_id": 21094690, "text": "My immediate thought when I saw this was &quot;Fancy scam mixed with PR bomb&quot;, a little digging surfaced these:<p><a href=\"https:&#x2F;&#x2F;blogs.harvard.edu&#x2F;doc&#x2F;2019&#x2F;02&#x2F;27&#x2F;spinner&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blogs.harvard.edu&#x2F;doc&#x2F;2019&#x2F;02&#x2F;27&#x2F;spinner&#x2F;</a><p><a href=\"https:&#x2F;&#x2F;www.prexamples.com&#x2F;2018&#x2F;07&#x2F;frustrated-husbands-can-use-micro-targeted-native-ads-to-influence-their-wives-to-initiate-sex-surely-a-pr-stunt-please-a-pr-stunt&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.prexamples.com&#x2F;2018&#x2F;07&#x2F;frustrated-husbands-can-u...</a>", "by": "Torien"}, {"item_id": 21095626, "text": "I laughed uncontrollably. I knew it was one of those classic 2000s style hoax sites like Coincidence Design ($40k private investigator to find out everything to make someone fall in love with you), or Penguin Warehouse (penguins as pets) or Pets or Food ... all funny, none real.<p>But wait .. this is ... real? Like they take real money from people? .... huh ... what was that quote about how everything that was once parody is reality?<p>This is some serious Poe&#x27;s Law stuff here.", "by": "djsumdog"}, {"item_id": 21094452, "text": "This is fucked up. At first I thought, of course this exists but no one would really fall for it. Scrolling through the offerings, I felt a sinking feeling in the pit of my stomach. Psychological warfare on-demand, only $50!", "by": "maxfurman"}, {"item_id": 21094245, "text": "Of course this is already happening on a massive scale. Perhaps having someone openly admit to it will help make people more aware.", "by": "leereeves"}, {"item_id": 21094682, "text": "I think this is called Sniper Targetting [1] or providing ads for a single audience.<p>Earlier I had read about someone who tried to spook his roommate by targetting him with heavily-personalized ads. Cannot seem to find it now.<p>[1]: <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@MichaelH_3009&#x2F;sniper-targeting-on-facebook-how-to-target-one-specific-person-with-super-targeted-ads-515ba6e068f6\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@MichaelH_3009&#x2F;sniper-targeting-on-facebo...</a>", "by": "ai_ia"}, {"item_id": 21094702, "text": "Would a service like this work on people who don&#x27;t use the popular social networks?<p>E.g. I get my news + dopamine from the local newspaper (physical paper edition) and HN, respectively. Ofc HN pretty much qualifies as a social network, but it has no targeting. My girlfriend isn&#x27;t on any social network at all, unless WhatsApp qualifies as one and IMO it doesn&#x27;t, unless you have a gazillion active group chats (which sounds like hell on earth).<p>I&#x27;m inclined to think that this makes both of us immune to attacks like the ones performed by this company, but I have an uneasy feeling that I&#x27;m missing something. Anyone with a better insight in targeting hacks than me able to chip in?", "by": "skrebbel"}, {"item_id": 21094476, "text": "They should add an “expose target to qanon and conspiracy theories”-option. There was an article not too long ago about what obsessing over this can do to personal relationships. It was not pretty.", "by": "haasted"}, {"item_id": 21096673, "text": "Initially I was disgusted, but, then I realized I&#x27;d be interested in a &quot;Make your parents skeptical of Fox News&quot; option.", "by": "zoba"}, {"item_id": 21094290, "text": "This feels like a satire. But it&#x27;s not. My god. We are truly living in the end of days.<p>Also the title is purposely inflammatory (if not also true).", "by": "dannykwells"}, {"item_id": 21097911, "text": "I appreciate the “this is evil” analysis, but I have a different take on it:<p>Packaging this capability for everyday people is exactly what we need to get widespread understanding of what is being done to them, and begin to build social defenses.<p>Political parties, corporations, and all kinds of bad actors are doing this stuff all the time. People need to find ways to externally validate their realities. I don’t see any way that can happen besides widespread adoption of consumer psyops tools.<p>It feels like Pandora’s Box has been opened, and we need to get comfy with the monsters as a first step, if we are to subdue them.", "by": "erikpukinskis"}, {"item_id": 21094710, "text": "I’m tempted to use this as a demonstration to a friend who still doesn’t believe me about targeted ads and the maliciousness of social media companies. I’d pay them to target her with an obviously irrelevant idea (have kids for example, considering she’s against kids and does not want any) and hand her an encrypted flash drive with a message saying I did that beforehand. A few weeks later I’d ask her about it and give her the key to decrypt the drive and read my message.", "by": "Nextgrid"}, {"item_id": 21095107, "text": "I was curious as to how it all works, from the FAQ:<p>&gt;The Spinner* sends you an innocent looking link. This link is sent to the target via text message. When the target presses the link, a cookie connected to the link attaches itself to the target’s phone. From that point on, the target will be strategically bombarded with articles and media tailored to him or her.<p>So it&#x27;s using a tracking cookie and the victim needs to click a link before anything happens. More from the FAQ:<p>&gt;Thanks to an online advertising technique called &quot;retargeting&quot;, the service makes sure that only the target sees the content chosen for her or him.<p>I assume Google Ad&#x27;s remarketing (or SaaS, &quot;stalking as a service&quot;) is what was meant: <a href=\"https:&#x2F;&#x2F;support.google.com&#x2F;google-ads&#x2F;answer&#x2F;2453998?hl=en&amp;ref_topic=3122875\" rel=\"nofollow\">https:&#x2F;&#x2F;support.google.com&#x2F;google-ads&#x2F;answer&#x2F;2453998?hl=en&amp;r...</a><p>So as far as I can tell, the whole thing is just using marketing features built into Google Ads.", "by": "calibas"}, {"item_id": 21094694, "text": "What? How are they controlling what articles the target sees via a cookie? What am I missing here?", "by": "deweller"}, {"item_id": 21094508, "text": "Wish they had a campaign to convince my boss that working from home is a win-win situation.", "by": "eweise"}, {"item_id": 21094266, "text": "OP, what do you think &quot;gaslighting&quot; means here?", "by": "defertoreptar"}, {"item_id": 21094295, "text": "Interesting the difference between the topline description &quot;exposed to hundreds of items disguised as editorial content&quot; and the one later in the page &quot;10 articles&quot;. Could it be that a company which sells deception is playing a bit fast and loose with its claims?<p>Also, I think it would be very interesting to set up a honeypot for this and see what kinds of changes it drives. Anyone interested in splitting the cost for an experiment?", "by": "debatem1"}, {"item_id": 21096729, "text": "Frankly I&#x27;m surprised this isn&#x27;t augmented with some sort of hyperlocal lat&#x2F;long or zip-code based targeting to, for example, influence all the workers at a specific office building. It wouldn&#x27;t take much for a company to bombard it&#x27;s competitor&#x27;s staff members with wacky conspiracy theories and&#x2F;or other things to make them less effective.", "by": "w_t_payne"}, {"item_id": 21096701, "text": "I think I have seen this link[0] posted a few times in related posts (I might have shared it as well).<p>[0] <a href=\"http:&#x2F;&#x2F;ghostinfluence.com&#x2F;the-ultimate-retaliation-pranking-my-roommate-with-targeted-facebook-ads&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;ghostinfluence.com&#x2F;the-ultimate-retaliation-pranking-...</a>", "by": "leovander"}, {"item_id": 21097040, "text": "Reminds me of something about a true crime case on TV.<p><a href=\"https:&#x2F;&#x2F;www.cbsnews.com&#x2F;news&#x2F;48-hours-drawn-to-murder&#x2F;2&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cbsnews.com&#x2F;news&#x2F;48-hours-drawn-to-murder&#x2F;2&#x2F;</a><p>&gt;But the plan went still further: at one point, police duped a newspaper reporter into writing a phony story saying an arrest was imminent. They even left a copy of Tim&#x27;s mother&#x27;s obituary on the windshield of a friend&#x27;s truck.<p>&gt;&quot;That&#x27;s torture,&quot; says Tim&#x27;s former attorney, Erik Fischer. &quot;They&#x27;re trying to get this poor kid to relive his mother&#x27;s death. They&#x27;re trying to make him snap! It&#x27;s a psychological experiment to try to make him snap!&quot;", "by": "ryacko"}, {"item_id": 21094961, "text": "You can do the same exact thing with facebook advertising. People have done it (job ads, apartments, etc.). This is just targeted at banner&#x2F;Web vs. social media.<p>Doesn&#x27;t make it any more or less icky, just saying that it&#x27;s not the only method&#x2F;it&#x27;s happening already.", "by": "heyyyouu"}, {"item_id": 21094707, "text": "I regularly use seven browsers: Three different ones at work, two different ones on my home desktop and three different ones on my phone.<p>My webmail intentionally runs in it&#x27;s own browser profile which is only used for opening links in email. If the tracking cookie attached there it wouldn&#x27;t apply to nearly any of my usual web browser usage.<p>If you use Chrome for your browser, you can create a new profile and &quot;web app&quot; to run your web mail in.  In Firefox, pin your web mail to a container. (Hopefully links followed from there stay in the container?)<p>On your phone, open links from email in chat in Firefox Focus unless you have reason to do otherwise. In settings disable third party cookies. (Firefox Focus still allows normal cookies by default)", "by": "markstos"}, {"item_id": 21095289, "text": "Didn&#x27;t Facebook for a while have the ability to target a single individual for ads?  I seem to remember seeing some things on HN about people doing this a while back.  Makes sense that someone would turn it into a service.", "by": "VectorLock"}, {"item_id": 21094346, "text": "My first thought was that it was subscription service for people who don&#x27;t know how to re-light their furnace pilot light when it goes out.  My second thought was - Is that a huge addressable market, but what do I know?<p>Then I clicked the link.", "by": "somethoughts"}, {"item_id": 21094618, "text": "In the next couple years a couple things are going to happen:<p>1) This (or something like it) will go open source.\n2) An AI will be made to generate campaigns automatically. This can either use articles selected with some sort of sentiment analysis, or by generating the content itself with the next gen GPT-2.<p>Neal Stephenson talked about this more then 10 years ago in the book Anathem, calling them &quot;Artificial Inanity Engines.&quot;", "by": "wedn3sday"}, {"item_id": 21098879, "text": "I don&#x27;t know why but the Spinner video reminded me of the Friendface ad[1]. Maybe because both are hilarious in some ways and horrifying.<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=6rNgCnY1lPg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=6rNgCnY1lPg</a>", "by": "anaxag0ras"}, {"item_id": 21094960, "text": "&gt; *\nAccording to The Spinner&#x27;s terms of use, if the initiator of the Spinner service (i.e. the party that ordered and&#x2F;or paid for the service) sends the &#x27;targeting link&#x27; to any user via any digital media, it’s the initiator’s responsibility to refer the recipient to The Spinner&#x27;s terms of use and privacy policy.*<p>Uh huh.", "by": "PhasmaFelis"}, {"item_id": 21099044, "text": "The site took so long to load that I thought it was for showing the loading spinner tab icon, which also fit the name of the site. I had to go wait it out after reading the comments which seemed unrelated to the first experience.", "by": "Absor"}, {"item_id": 21094523, "text": "And it literally starts by you sending them an &quot;innocuous looking&quot; link. How does someone actually justify to themselves that doing something like this is even slightly okay? I&#x27;d feel deeply disturbed doing this to someone even if it was for a &quot;good cause&quot; like getting them to quit smoking.", "by": "ocdtrekkie"}, {"item_id": 21095161, "text": "FT has an interesting article on it from last year: <a href=\"https:&#x2F;&#x2F;www.ft.com&#x2F;content&#x2F;944d068c-8a99-11e8-affd-da9960227309\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ft.com&#x2F;content&#x2F;944d068c-8a99-11e8-affd-da9960227...</a>", "by": "neom"}, {"item_id": 21094549, "text": "&quot;The Spinner* sends you an innocent looking link. This link is sent to the target via text message. When the target presses the link, a cookie connected to the link attaches itself to the target’s phone.&quot;<p>Is this legal? I never click on links sent via SMS.", "by": "sideshowmel"}, {"item_id": 21094641, "text": "I wonder if it&#x27;s possible to build a defense service to this.<p>Counter PsyOps as a service (if built, social networks should probably build it in for free).<p>Make something that can detect if your stories seem to be manipulated and show stories that counteract that.", "by": "legionof7"}, {"item_id": 21094669, "text": "&gt; Message: Prevent Phishing Attacks!<p>&gt; Target: Employeess<p>Hmmm", "by": "paulddraper"}, {"item_id": 21094492, "text": "Is there anything stopping someone from abusing paid ad services for any of these platforms themselves to the same effect? This is assuming that they allow you to finely target the ads which I believe they do.", "by": "methodin"}, {"item_id": 21094416, "text": "This is gross, shut this shit down now. There&#x27;s no honest use for this. The only people who&#x27;ll use it are psychopaths, we don&#x27;t need to empower them, especially when it&#x27;s as cheap as $50.", "by": "jbob2000"}, {"item_id": 21094774, "text": "Keep in mind that large companies are already using the surveillance and advertising complex to influence behavior, and have been for years. This just puts it in the hands of anyone with $50 to spend.", "by": "WarDores"}, {"item_id": 21094502, "text": "Hmm, I’m curious using this on oneself to encourage pro-social behavior or reinforce new habits.<p>Would it have a known placebo effect where even if you knew it was spun you’d still be influenced?", "by": "bamurphymac1"}, {"item_id": 21095016, "text": "Well, I just opened the link and Facebook started showing ads related to &quot;Marrying my partner&quot;, &quot;Initiate sex&quot;, funny thing because I&#x27;m single", "by": "ferCats99"}, {"item_id": 21095682, "text": "This is manipulation and quite despicable imho.<p>Besides I&#x27;d rather make my own &quot;nudging&quot; (or spearphishing) campaign and save a few bucks if need ever showed.", "by": "manjana"}, {"item_id": 21097488, "text": "I think Darren Brown claims to use short term persuasive power to influence people to drastically change their mind about intimate things.", "by": "kkotak"}, {"item_id": 21094497, "text": null, "by": null}, {"item_id": 21096436, "text": "Poor man&#x27;s Cambridge Analytica!", "by": "serkanh"}, {"item_id": 21095888, "text": "Product suggestion: bump the price to $99 and 20 x the traffic over a longer delivery window. You need more impressions than offered to meaningfully affect target beliefs. You can mix in cheaper ad space as well.<p>None of these have a direct call to action.... thus you need additional impressions to build recall or trigger inception.", "by": "sixtypoundhound"}, {"item_id": 21098061, "text": "Would be interested to hear someone who actually had success with this.", "by": "newshorts"}, {"item_id": 21094975, "text": "Firefox will block all the tracking cookie! So can not apply to me! ;)", "by": "safwan"}, {"item_id": 21095097, "text": "Apparently the guy who set it up is from Turkey but lives in Germany", "by": "fidla"}, {"item_id": 21095099, "text": "Illegal in Europe. You need to agreement for this kind of tracking.", "by": "flimflamm"}, {"item_id": 21097687, "text": "Fascinating. This is propaganda war at a micro scale.", "by": "sebastianconcpt"}, {"item_id": 21096367, "text": "Sounds like an episode of Black Mirror.", "by": "ilaksh"}, {"item_id": 21096161, "text": "This is like a shitty SecretNudge.com", "by": "Oblouk"}, {"item_id": 21094644, "text": "This is very much akin to the &quot;weapons-grade&quot; tools used by the likes of Cambridge Analytica and AIQ to manipulate the minds of Trump and Brexit voters, using ill-gotten Facebook data to work out <i>exactly</i> what pushes people&#x27;s buttons.<p>Tools like this will now be used during every election&#x2F;voting cycle, forever.<p>Extremely worrying, but inevitable.", "by": "ourcat"}, {"item_id": 21094772, "text": "This has got to be a joke", "by": "fidla"}, {"item_id": 21094414, "text": null, "by": null}, {"item_id": 21096435, "text": "lol Poor man&#x27;s Cambridge analytica!", "by": "serkanh"}, {"item_id": 21095124, "text": "I think I know who built this", "by": "typeformer"}, {"item_id": 21094296, "text": "The HN title is incorrectly using &quot;gaslight,&quot; and the website makes no mention of gaslighting.<p>&gt; Gaslighting is a form of psychological manipulation in which a person seeks to sow seeds of doubt in a targeted individual or in members of a targeted group, making them question their own memory, perception, and sanity.", "by": "luhn"}, {"item_id": 21095569, "text": "This is no spin:<p>Pres Trump backs Int&#x27;l Soros child rape ring for $4billion bribe Pelosi rec&#x27;d $3b &#x27;to ensure safe passage over border&#x27;. Rapists include Obama, Schumer, Cuomo, Buttgieg, DeBlasio, Dorsey, Theil, BMurray. 60+ deaths from rapes in BuffaloNYJan2019, $15+billion in payoffs. Listen to them do it here:<p>\\\\New().footage now available [Soros, 0bama child rapes on: 15Jan 4-6am\\], Obama around 5:24AM: &quot;Why is there so much blood? Someone get me something to clean the blood off my dick....&quot;\n\\\\The footage gets censored in LA\\, NYC, CHI, SF, BOS, DC...why are these wealthy high profile child rapists, who are caught in the act, able to remain free with no action by the FBI??\n    • note: {} groups of links are multiple ways to get the same file:.\n15JanCh3_347-528.avi\n<a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Q8YeDzghf95FQrxBaMpXK4b-SfJYERs8&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Q8YeDzghf95FQrxBaMpXK4b-SfJ...</a>\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!bTQwDQDA!jolSOqGR2Zomhtn7zIG0lGmqXSqe3KG1mO_7nKLrqNo\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!bTQwDQDA!jolSOqGR2Zomhtn7zIG0lGmqXSqe3KG1m...</a>\n15JanCh3_528\\-545.avi\n<a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1DavyRFWTRv4_teHYewpQMwMCq6LDzb6Y&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1DavyRFWTRv4_teHYewpQMwMCq6L...</a>\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!DfBywKKR!llMUzB8DLM2Rcvm0QkOKdiE3PpCY5YeR3yJwrm9R_4U\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!DfBywKKR!llMUzB8DLM2Rcvm0QkOKdiE3PpCY5YeR3...</a>\n\\\\15JanCh4_400-600avi\n<a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1DavnBCyhq_JRmST2QH5qlojUE6dr5IWS&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1DavnBCyhq_JRmST2QH5qlojUE6d...</a>\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!faZggSja!yF_QOcodvYXwk7qEO1N8eSaV90ZWUUaS18Surn8rnEU\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!faZggSja!yF_QOcodvYXwk7qEO1N8eSaV90ZWUUaS1...</a>\nSee pages 18-&gt;23,8,11,12,35,45,61,62, and update list at end of doc\\. Having trouble getting traction. Getting censored\\banned. Billions in bribes paid to Trump, Pelosi, Schumer, Harris to enable a Soros funded child raping ring to operate in the USA. Please download and listen to the links below. Turn up the volume and put headphones on. You will hear these people and many other high profile people, incriminate themselves in unbelievable fashion. Full 83 page document [updated 9Sep\\] filled with red handed evidence like this at the bottom.\nGo to pages 18 thru 36 of this document and you will hear Doursey and Theil raping children. You will hear their crying and screams. They both rape and kill three boys. Also at the &quot;rape party&quot; of note\\: Bill DeBlasio, Andrew Cuomo, Bill Murray, Peter Buttgeig, George Soros, Barack Obama.\nPlease copy and paste this post and repost it, or save it in a text file for later because it will likely get removed sooner or later. I keep getting censored by these people.\n    • Bill De\\Blasio\\&#x27;s turn starts at 21:00. He kills five boys (pg 35):\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!OCJwQSBC!AlER6vRRTKS8yvSxnVwAl3ha3kGDLqoouQe53zkGARg\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!OCJwQSBC!AlER6vRRTKS8yvSxnVwAl3ha3kGDLqoou...</a>\n    • Andrew Coumo\\&#x27;s starts at 22:00. He kills four boys. (pgs 35-36\\):\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!qKZChABY!zy-2jIHqEg4gWHNbiEym-YBdSs5Y9qzT2ARieV_eozA\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!qKZChABY!zy-2jIHqEg4gWHNbiEym-YBdSs5Y9qzT2...</a>\n    • \\Both files in one here:\n14JanCh3_2100-2300\\.avi\n<a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1yolCgVtY5b8d8YDcshwb-Yd3kS0Jg-Bk&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1yolCgVtY5b8d8YDcshwb-Yd3kS0...</a>\n\\\\Peter Theil starts at 1:00am, Jack Dorsey at 1:30am each raping and killing three boys. Turn the volume all the way up and put head phones on\\. Pages 19\\20..\n<a href=\"https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;conv1&#x2F;Overnight_14-17Jan&#x2F;15JanCh3_100-200.avi\" rel=\"nofollow\">https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;conv1&#x2F;Overnight_14-17Jan&#x2F;15JanCh3_1...</a>\n<a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1mzZrjobxhNIEf38M3xk-IeA5SeF4aUtB&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1mzZrjobxhNIEf38M3xk-IeA5SeF...</a>\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!qHhRiKLI!Tl1AnP0Lq6GIBH2MGitYNuXoe81uYeVQdxwSaZ8CY7o\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!qHhRiKLI!Tl1AnP0Lq6GIBH2MGitYNuXoe81uYeVQd...</a>\n\\\\Obama admits to raping and killing boys here at about 5:47Am w\\ commentary from Peter Theil, George Soros, Matt Porter:.\n<a href=\"https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;out2&#x2F;Out2&#x2F;15JanCh3_0545.avi\" rel=\"nofollow\">https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;out2&#x2F;Out2&#x2F;15JanCh3_0545.avi</a>\n<a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1LCDoc1kT7cfSeKQ1vniP_sx32_bRsHau&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1LCDoc1kT7cfSeKQ1vniP_sx32_b...</a>\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!veBk1KrL!zkO_keTyZAtNoTGEGsfRmXyuVIj9p8c3R8GtY-o_Nt8\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!veBk1KrL!zkO_keTyZAtNoTGEGsfRmXyuVIj9p8c3R...</a>\n\\\\DTrump demands $4 billion to &quot;take a blind eye&quot; at 1015+\\. Here is pieces of dialogue:\n1018 Henry Porter: The child raping.\n1018 Donald Trump: What the fuck are you talking about\n1018 Gigi Hadid: Mr President we are child rapists.\n1018 Donald Trump: You cannot be serious.\n1019 Donald Trump: Youre gonna need $4 billion for me to take a blind eye.\n1019 Porter: People are laughing because they think four billion is too much. I think it&#x27;s not a problem when you have $35 billion.\n1022 Donald Trump: You better have that $4 billion or you can kiss this shit goodbye.\n<a href=\"https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;conv2&#x2F;3Jan&#x2F;3JanCh3_900-1100.avi\" rel=\"nofollow\">https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;conv2&#x2F;3Jan&#x2F;3JanCh3_900-1100.avi</a>\n<a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Grdr8xF2psKNsuYlEnl9dIRV-77YG0Vr&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Grdr8xF2psKNsuYlEnl9dIRV-77...</a>\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!TKgxzS5J!i-nWn3HaOAJPU7rju83B4qcwSzun4Dl2B29FEZxtMSU\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!TKgxzS5J!i-nWn3HaOAJPU7rju83B4qcwSzun4Dl2B...</a>\nSpeaker of the House Nancy Pelosi agreeing to $3 billion for safe passage at Monterrey (page 11)\\:\n1033 Nancy Pelosi: We want to make sure you have safe passage at Monterrey.\n1033 Matthew Porter: We appreciate that Speaker Pelosi.\n1033 Gigi Hadid: I think we may have to scale back a little bit though.\n1033 Nancy Pelosi: Gigi I think we will be just fine.\n1035 Nancy Pelosi: God damn it\\! I want Kamala to get a billion out of yours, not out of mine\n1035 Gigi Hadid: I think we can accommodate you but we need to find out if Monterrey will be open on the 30th of January.\n1036 Nancy Pelosi: Of course it will Gigi\n1036 Nancy Pelosi: $3 billion goes a long way Peter [Theil\\].\n\\\\17JanCh3_949-1100avi\n<a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1eodHu4o5Cm3xEWhDqipSuTj-M1CZUvmE&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1eodHu4o5Cm3xEWhDqipSuTj-M1C...</a>\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!uXJUTYrI!-6eJXCWHSKhbHRv5p3df1a9k2-hHr9bxd5bkjxvgguY\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!uXJUTYrI!-6eJXCWHSKhbHRv5p3df1a9k2-hHr9bxd...</a>\n\\\\Trump wants $138 million to ensure smooth outcome for false judgement, as in no trial or hearing, simply entering in a judgement into the system thus bypassing the fifth amendment right of due process\\:\n<a href=\"https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;conv1&#x2F;10JanCh3&#x2F;10JanCh3_951-1033.avi\" rel=\"nofollow\">https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;conv1&#x2F;10JanCh3&#x2F;10JanCh3_951-1033.av...</a>\n<a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1iSeGHDToFRoRdIht50Wii0i30mlw9INp&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1iSeGHDToFRoRdIht50Wii0i30ml...</a>\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!jSwzFYLY!RFQvL8KIyFZf1WfC6tGoPFgJ4aREeGE_pe3i2fwshy8\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!jSwzFYLY!RFQvL8KIyFZf1WfC6tGoPFgJ4aREeGE_p...</a>\nObama explains the Illuminati with Jack Doursey..At 2:30 a conversation is occurring on the embedded Porter camera system with Jack Dorsey, Peter Theil, Barack 0bama, Bill Murray, and the Porters. Jack Dorsey provides a statement defining who their group is: &quot;The Illuminati is an underground organization of child rapists and homosexuals.&quot; Matthew Portr: &quot;We have to thin the herd, so Barack is going to explain a few things.&quot; At 2:32 Barack 0bama says the following: &quot;You people have to realize we are child rapists. The Illuminati are chil.d rapists. As soon as you figure that out, you can decide what to do. Everybody is freaking out about what just happened [child raping event still going on\\]. This is who we are\\&quot;:\n<a href=\"https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;conv1&#x2F;Overnight_14-17Jan&#x2F;15JanCh3_200-347.avi\" rel=\"nofollow\">https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;conv1&#x2F;Overnight_14-17Jan&#x2F;15JanCh3_2...</a>\n<a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Ok1-9IvANULzKBOwADFgaiYCFi6yszfj&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Ok1-9IvANULzKBOwADFgaiYCFi6...</a>\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!nbhTwALA!qmf_0Lq0jApSwxRj1KRS_Q7QYbg4aJc4JMU9rDjR_yo\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!nbhTwALA!qmf_0Lq0jApSwxRj1KRS_Q7QYbg4aJc4J...</a>\nFull 83 page document [update 9Sep]:\nThree ways to get it:\n<a href=\"https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;aviewmefirst&#x2F;FBI_FinalDraft_26Jul2019_BSchlenker.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;s3.wasabisys.com&#x2F;aviewmefirst&#x2F;FBI_FinalDraft_26Jul20...</a>\n<a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Sj9EN_pHmicKS6rFQlmk67knMdJc9cGk&#x2F;view?usp=sharing\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Sj9EN_pHmicKS6rFQlmk67knMdJ...</a>\n<a href=\"https:&#x2F;&#x2F;mega.nz&#x2F;#!OKYwES6A!zPGcRSg5de1XALI3FtUH3FCNCuLUzQbZN0l5iNCQqmU\" rel=\"nofollow\">https:&#x2F;&#x2F;mega.nz&#x2F;#!OKYwES6A!zPGcRSg5de1XALI3FtUH3FCNCuLUzQbZN...</a>\n\\\\Please post this anywhere you can\\! Each Google drive and Mega.nzlink is a backup to the Wasebi link just in case one is &quot;down&quot;. Getting blocked, censored, &#x27;down\\voted&#x27; etc. These people are extremely wealthy and throw money to anyone who will help them cover up their child rapes &amp;murders, corruption. Ironically\\, this is usually done through a receivership transfer where you receive the funds after for or more day, and it can be pulled at the last second, which is usually the case after you&#x27;ve done them the &quot;service&quot; as they call it.\nA word about the &quot;f@\\#&amp;ot&quot; usage: it was a necessary tool. It showed three things: they were not in control, if they were the usage would have been stopped. Everyone out there needed to see this. Two, it made it unpleasant for them to be in the head space, which has obvious advantages. Three it pointed out impersonators of B.S. because they would not call each other f@\\%ot, thus helping to mitigate the spread of false information. Apologies for those unintentionally offended. On that note I give you Barack 0bama in a foursome with Peter Thiel, Jack Dorsey, and Matthew Porter. It is on page 12 of the document where you can download the video containing audio footage of the &quot;event&quot;. Link for the doc is just above under &quot;Full 83 page document&quot;.", "by": "beeschlenker"}, {"item_id": 21094380, "text": "Smug Life not reading much news or articles other than print books.", "by": "hnghost"}, {"item_id": 21094535, "text": "Looks like the CIA finally got some competition.", "by": "kd3"}, {"item_id": 21094412, "text": "This is crazy but cool", "by": "redoaoura"}, {"item_id": 21096746, "text": "Right, so it&#x27;s malware? Good old malware which once upon a time was frowned upon. Keep on top of that really special person who has a restraining order on you.", "by": "seamyb88"}]