[{"item_id": 21102383, "text": "Expanding on the post, one corollary of &quot;people are rarely the cause of the outage&quot; is that &quot;you can&#x27;t fix people&quot;. Given that Dave accidentally caused an outage by pressing some button he should&#x27;t have, explaining to him why he shouldn&#x27;t press the button won&#x27;t prevent anyone else from making the same mistake.<p>Instead, you need to look at the reasons underlying why Dave pressed the button. Is the button confusingly labeled? Is there no playbook on what the process for pressing the button should be? If you fix those underlying problems, you will prevent other people from making the same mistake Dave made.", "by": "malisper"}, {"item_id": 21102599, "text": "Ties to Warren Buffet, someone probably smarter than me ;)\n&quot;Criticize generally, praise specifically&quot;\n                or\n&quot;Praise by name, criticize by category&quot;. \nIn my experience the biggest problem with criticizing specific actions is that it destroys loyalty and undermines trust.", "by": "Thersites"}, {"item_id": 21102307, "text": "My $0.02:<p>Despite being a strong believer in it, I&#x27;ve worked at places that did blameless post-mortems and it was sometimes frustrating because remediation often felt like a second-class citizen. Remediation is often <i>much more</i> difficult in these environments because systematic changes can obviously much more complex than &quot;fixing&quot; an individual&#x27;s behavior.<p>If someone pushes the big red button accidentally I&#x27;m fully on-board with the &quot;well what led them to push it and why were there no safeguards?&quot; but it also kinda sucks if you spend so much time on that conversation that there&#x27;s no time left for &quot;ok, who&#x27;s going install the confirmation screen for the big red button?&quot;<p>Sometimes the &quot;remediation&quot; was even just &quot;well, that&#x27;s just the way it is and we can&#x27;t do anything about it easily, but hopefully the post-mortem itself will serve as a way to inform people not to push the big red button&quot; which is obviously frustrating because memories are short and people come and go quite frequently in the tech industry.<p>Anyway, and this might be obvious to some, but remediation is important and sometimes incredibly difficult in these environments. Adopting such an environment requires a commitment to actually fixing the systemic issues. It can sometimes feel <i>more</i> frustrating than &quot;blameworthy&quot; post-mortems especially if it&#x27;s the same individual(s) over and over again.", "by": "wgerard"}, {"item_id": 21102081, "text": "All good reasons. I&#x27;ll take the first one a little further... when such an event happens, it may cost the company actual money. If you fire or create an environment where someone wants to look for another job, then whatever that event cost you is no longer an investment in the education and experience of your employee -- you&#x27;ve now invested that money in someone else&#x27;s employee.<p>A person who plays a part in a costly error is going to be much more cautious in the future and be very helpful in improving systems so it can&#x27;t happen again. You want to foster that approach rather than discourage it.", "by": "bonestamp2"}, {"item_id": 21107221, "text": "Honestly, I expected the article to be hot trash -- considering how I saw the implementation at our shop.  I&#x27;ve changed my mind.  We just go about it wrong.  What went right, what went wrong, where did we get lucky... If we answered those questions rather than dodge responsibility... this could be useful.", "by": "heelix"}, {"item_id": 21103041, "text": "To expand on the CYA reason why blaming causes problems, people who want to avoid blame want to say there&#x27;s nothing they could have done that would have prevented the incident. In a blameless environment people are more likely to figure out a way they can contribute to prevention.", "by": "brlewis"}, {"item_id": 21102513, "text": "&gt; As a rule, people are not the cause of an outage.<p>But leaders are.<p>Most enterprise post-mortems I&#x27;ve read will deliver pages and pages explaining (or justifying) poor system architectures. But they will never, ever criticize the executive or tech lead who decided on that structure to begin with.<p>Everyone makes mistakes, for sure. One stray outage is likely technical in nature. A simple oversight that can be corrected. But if an org&#x27;s systems are constantly failing or breaking, then it falls to the leader of that org to reshape its structure.<p>Or they can pretend that blame doesn&#x27;t exist. The system is fine. A band-aid will suffice.<p>Without commitment to fix systemic failures, &quot;blamelessness&quot; enables the abdication of leadership.", "by": "hitekker"}]