[{"item_id": 21099982, "text": "If you like these country maps, you&#x27;ll probably also appreciate:  <a href=\"https:&#x2F;&#x2F;watabou.itch.io&#x2F;medieval-fantasy-city-generator\" rel=\"nofollow\">https:&#x2F;&#x2F;watabou.itch.io&#x2F;medieval-fantasy-city-generator</a><p>&gt; This application generates a random medieval city layout of a requested size.<p>Likewise, it is web-based and interactive", "by": "doomlaser"}, {"item_id": 21099729, "text": "I really like the maps this generates. For me, plausibility is really important when creating any fictional map, because it&#x27;s possible to create a map that looks beautiful but depicts a place that doesn&#x27;t really make sense even with fantasy elements incorporated.<p>The color scheme of the political map is highly distinctive but feels cohesive. There&#x27;s a decent phonetic&#x2F;orthographic consistency in the naming within a state. The religions layer doesn&#x27;t feel particularly integrated with the political one, for instance I found a theocracy without an organized religion.<p>The geography is also pretty good. Rivers are one of the telltale signs of poor fantasy map building, but this makes pretty believable rivers, though I did find a case of an inland sea draining into itself. It&#x27;s good the mountains form ranges, but it would be interesting to have some more evidence of volcanism. I found one map with a huge area filled with mountains in an unrealistic way but I had a fun time imagining how it may have gotten that way in a fantasy world.<p>I really like that it has some climate generation and I&#x27;d love to see more, things like prevailing winds, winter&#x2F;summer variation, and more of a Köppen climate classification[0] than the biomes currently listed, but I know this is a fantasy map generator and those require parameterizing more the nature of the planet being mapped.<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Köppen_climate_classification\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Köppen_climate_classification</a>", "by": "cjhveal"}, {"item_id": 21099735, "text": "This blog is amazing as well:<p><a href=\"https:&#x2F;&#x2F;heredragonsabound.blogspot.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;heredragonsabound.blogspot.com&#x2F;</a><p>The latest entry is about the mentioned map generator by the way. Make sure to check earlier ones!", "by": "_Microft"}, {"item_id": 21101639, "text": "Can anyone help me understand our facination with fantasy maps ? Why do I feel inspired or awesome when looking at them ?<p>Is it because of the anticipated dopamine hit from the expected discovery of the complexity of the terrains, stories, cultures, races etc ? Is it because of the endless possibilities that an open map presents ?<p>Is it why I was crazy about skyrim, Baldur&#x27;s, Fallout &amp; open worlds back in the days ?", "by": "udkl"}, {"item_id": 21100118, "text": "I like this one more: <a href=\"https:&#x2F;&#x2F;ui2.worldspinner.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ui2.worldspinner.com&#x2F;</a><p>The process can seem a bit lengthy but you can skip most parts (e.g.: culture generation) and just get to the map bit.<p>Here is a map I made last night: <a href=\"https:&#x2F;&#x2F;i.imgur.com&#x2F;HYMrbjx.png\" rel=\"nofollow\">https:&#x2F;&#x2F;i.imgur.com&#x2F;HYMrbjx.png</a><p>I turned off all cities, roads, rivers, etc, as I just wanted a plain map.", "by": "petargyurov"}, {"item_id": 21100285, "text": "Are there any modern&#x2F;future&#x2F;sci-fi map generators out there? All the ones I&#x27;ve seen have been fantasy-focused. Something that generates modern sounding names, vehicle roads, airports&#x2F;seaports&#x2F;spaceports, that kind of thing?", "by": "mysterydip"}, {"item_id": 21101956, "text": "In addition to the awesomeness of this tool, it links to several other tools as part of its flow.<p>One of those is my heraldry generator, visible directly here: <a href=\"https:&#x2F;&#x2F;ironarachne.com&#x2F;heraldry\" rel=\"nofollow\">https:&#x2F;&#x2F;ironarachne.com&#x2F;heraldry</a>", "by": "bovermyer"}, {"item_id": 21099855, "text": "This is excellent! I&#x27;ll be using this for my OSR sandbox campaign for sure!<p>Note that if you want to use this for a hexcrawl, the hexes it generates are 50mi on their short diagonal - this means they fit five (four and two halves) 6 mile hexes on their short diagonal, if we go by <a href=\"https:&#x2F;&#x2F;www.welshpiper.com&#x2F;hex-templates&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.welshpiper.com&#x2F;hex-templates&#x2F;</a>", "by": "japanoise"}, {"item_id": 21099800, "text": "Pops up this error on Safari 12.1.2:<p>elevateLakes@main.js?version=1.0:1103:10 generate@main.js?version=1.0:593:17 generateMapOnLoad@main.js?version=1.0:198:11 checkLoadParameters@main.js?version=1.0:170:20 global code@main.js?version=1.0:171:2<p>Console says:\nTypeError: undefined is not an object (evaluating &#x27;religCells.sort((a,b) =&gt; b.pop - a.pop)[0]&#x27;)", "by": "rogual"}, {"item_id": 21103854, "text": "Slightly related - I needed a generator for maps of encounters in the wilderness for my d&amp;d campaign, and the ones I found weren&#x27;t working well for me, so I made my own - very unpolished version, but maybe someone will find it useful:<p><a href=\"https:&#x2F;&#x2F;ajuc.github.io&#x2F;outdoorsBattlemapGenerator&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ajuc.github.io&#x2F;outdoorsBattlemapGenerator&#x2F;</a>", "by": "ajuc"}, {"item_id": 21099682, "text": "I love it! Has anyone built something on top of one these maps?", "by": "Tepix"}, {"item_id": 21099656, "text": "I&#x27;ve seen maybe a dozen similar map generators, however this is probably the most customize-able one I&#x27;ve seen; an impressive toolset. Even more impressive that the entire tool seems to be built without any templating or view framework. jQuery is used to some extent but for the most part the entire app is built with plain old vanilla DOM manipulation.<p>The codebase could use a few comments and cleaner structure, but overall it&#x27;s quite easy to poke through.", "by": "chrispauley"}, {"item_id": 21099660, "text": "Oddly hitting F5 doesn&#x27;t regenerate the map on ff&#x2F;windows for me. Have to do a full reload with ctrl+shift+r.", "by": "kuroguro"}, {"item_id": 21099759, "text": "Very inspirational. Actually I think I&#x27;ll send it to a fantasy author friend of mine!", "by": "kebman"}, {"item_id": 21100042, "text": "Very impressive.  What does it use?", "by": "sidcool"}]