[{"item_id": 21105366, "text": "&gt; If I make a mistake at work and people are aware of it I am afraid that it reflects negatively on me more than the good things I do reflect positively.<p>I think this is just how you think about yourself, because everyone is their own worst critic (myself included).  The things you do right last a lot longer I&#x27;m sure than your mistakes. Unless you like, killed someone, or broke some incredibly expensive thing, etc.   But then you&#x27;d probably be fired already.<p>Mistakes happen when you try something new.  I think the most important thing is to manage your risk - what happens when you screw up?  Hopefully the impact of mistakes is small.<p>As anecdata, I always really admire people who can say &quot;look, I screwed up, and this is how I screwed up.  Now you can learn from my mistake and maybe not screw up.&quot;  Owning it I think is key.  I&#x27;m not saying it&#x27;s easy though.<p>One thing to be mindful of is a toxic, petty workplace.  Even some large FANG companies are like this, where everyone is looking for reasons to try to hold you back even though they don&#x27;t mean anything, it&#x27;s just to make them look good.  I got tired of that shit, and so I&#x27;m done with cultures like that.  People end up spending so much time stabbing each other in the back they rarely get work done.  When in a situation like that, make nice with the decision makers, and just remember the best revenge is success (and best served cold to your enemies).  Don&#x27;t even bother trying to woo jerks with your success.", "by": "cbanek"}, {"item_id": 21107934, "text": "Here is a secret: people are self-absorbed creatures that cannot pay attention to somebody else for more than a couple of minutes. There is a non-zero probability that you are the only one that cares deeply about this - and the reason you care deeply is that you want to be better at your job.<p>Nobody gets fired over the mistakes they make unless (1) they make the same mistake over and over again (2) they have an attitude when people try to help them and&#x2F;or give them feedback.<p>If you&#x27;re in an environment where mistakes immediately lead everyone to think on how this reflects on their performance (without factoring in what the mistake was, what happened, how can you learn from it) an interesting thing will happen: people will get better at covering their mistakes. New people will struggle to adapt and old people will burn out. Guess what happens in the long run? The whole operation will collapse. If you are in one of these toxic places GTFO - no amount of money is worth your mental&#x2F;physical health.", "by": "rantwasp"}, {"item_id": 21109998, "text": "30+ years experience here.<p><i>If you are any good, you will be working at the edge of your competence all the time.</i> Sure you will have some processes in place but the real work is going to be new - full of ways to screw up. I thought &quot;Someday I&#x27;ll be good at this development stuff.&quot; Thing is, you won&#x27;t really. Accept it!<p><i>Drop any pretense of ego.</i> You can&#x27;t be hurt if there is no &quot;target&quot;. Do your research of course and then ask the &quot;stupid&quot;&#x2F;embarrassing question. The guys who <i>don&#x27;t</i> ask the question will remain ignorant. You will feel a little silly but that will pass and now you will know.", "by": "chrisbennet"}, {"item_id": 21105542, "text": "The most dangerous person in the world is someone who never makes a mistake - because you know they are somewhere, you just have no idea where.<p>Making mistakes isn&#x27;t the problem. hiding them, or not being open to the possibility you are making them is far, far worse.<p>Someone who makes a mistake, catches it and fixes it - expert. Should be kept at all costs unless making the same mistakes over and over.<p>Someone who makes a mistake and then hides it or spends more time arguing why they were right in some non-existent edge case world - dangerous, get rid of immediately.", "by": "airbreather"}, {"item_id": 21110467, "text": "1. Do you know your worth in the labor market? Believe it or, there’s high demand for  mediocre developers and they make a good living. Go on some interviews. Knowing you can get another job gives you a ton of confidence.<p>2. This podcast episode can help you figure out what you’re really afraid of:<p><a href=\"https:&#x2F;&#x2F;feelinggood.com&#x2F;2017&#x2F;05&#x2F;29&#x2F;039-uncovering-techniques&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;feelinggood.com&#x2F;2017&#x2F;05&#x2F;29&#x2F;039-uncovering-techniques...</a>", "by": "viburnum"}, {"item_id": 21105371, "text": "It&#x27;s hard to overcome a fear, if one is surrounded by people triggering fear or handling their own fears in unproductive ways. Many do this unconsciously so don&#x27;t judge.<p>Lot of folk take advantage of other&#x27;s insecurities because it works. And because it works, they train others to follow their methods. And that leads to a culture of fear.<p>So be conscious of who you are dealing with. Otherwise it can get very confusing.<p>Trust and respect are key. Find people you trust and respect based on their behavior towards others. They will be your sources of confidence and reduce your sensitivity to different types of triggers.", "by": "hos234"}, {"item_id": 21104788, "text": "Ask your manager what they think of your performance, where you could grow, how you&#x27;re doing compared to what they expected.<p>You&#x27;ll likely be pleasantly surprised. Just like people with general insecurities frequently underestimate their likable attributes, it seems you&#x27;re doing the same, but with your level of competence.", "by": "bzbz"}, {"item_id": 21105295, "text": "If you&#x27;re <i>honestly trying to solve a problem</i>, you should assume positive intent from the criticizers- they&#x27;re on your side and just want the project as good as possible. Everyone makes mistakes, and it&#x27;s great there are people there to catch them and glean experience from. Is it so critical that you&#x27;re actually walking on the edge of a knife to keep your job? (If so, I&#x27;d probably look for something else- that&#x27;s no way to live!)", "by": "kylek"}, {"item_id": 21106904, "text": "In teams that I’ve lead and the work I do, I’ve tried to really make sure that 1 person is not solely responsible for anything. We are a team, at least 2 people are involved between dev&#x2F;review&#x2F;testing&#x2F;deployment, and we own success &amp; failure together.<p>You want constructive criticism in a safe space, which is before the accident. So work with your fellow devs before you release code to minimize prod mistakes. If you’re not in a workplace where that’s possible then more mistakes will happen, and that’s okay too. If you’re getting blamed for more mistakes happening in an environment that has been set up for more mistakes to happen?  Idk, get out or ignore it because collective insanity has taken over.", "by": "awinder"}, {"item_id": 21105353, "text": "Some vague advice from a non-expert:<p>It may well be a fact, for you and everyone else, that if you make a mistake at work and people are aware of it, it reflects negatively on you more than the good things you do reflect positively. It&#x27;s human nature, to pay attention when things go wrong. And why shouldn&#x27;t it? – hopefully, you do many more good things every day than bad things. This may just be a matter of facing reality. Do others similarly fear making mistakes? You could ask them about that.<p><i>What&#x27;s the worst that could happen?</i> Often it&#x27;s good to imagine that, in detail, when you are just &quot;fearing the worst&quot; in some situation in life, without really facing it. Living with that fear every day, as you are, may itself be much worse than that supposed &quot;worst thing&quot;. Losing that job may turn out to be the best thing that ever happened to you–who knows. Also, strong enough fear of mistakes will actually cause you to make mistakes. Find self-help books on the subject or get some psychological counselling if it&#x27;s a serious problem for you. Good luck!", "by": "yesenadam"}, {"item_id": 21105290, "text": "Did you have the information necessary to make the correct decision?  Most problems or failures I&#x27;ve encountered in software come to missing information much more often than any other reason.  Having justifications for the decisions you reach given the information you had available should lead you to feeling confident in the actions you take.  No one has all the pertinent information available at all times, and anyone who acts that way is disingenuous.<p>I believe it is human nature to put more emphasis on failure than success, but I also believe that people set themselves up for failure by assuming that their decisions are somehow flawed compared to others.  Most decisions we make are based on incomplete information, so the only recourse is to build stating your justifications with your decisions so that others&#x27;s may review them in the light of the information you had available.", "by": "greymeister"}, {"item_id": 21106232, "text": "For me the first situation like this were my studies. I wasn&#x27;t sure if I might be too stupid for this. But after I passed one of the important and difficult exams, I had a reference that I could build on.<p>Same for new jobs, once I&#x27;ve mastered one difficult piece of work, I know I have passed this milestone and afterwards I stop worrying about that.<p>So yeah, humans make errors including you and me :) If the company culture gives you really bad feedback on this, it&#x27;s their problem, not yours. I think it is common knowledge that overly bad feedback makes things worse not better. Everybody thinks that criticism should always be constructive. I don&#x27;t think so, there is a place also for destructive criticism. Not always when we see an error or problem, we must have a solution. Otherwise it would mean we only work on solutions we already know which is paradox. And if most feedback is any form of criticism, I think that&#x27;s also a sign for a problematic culture and possibly that people make up questionable tasks.<p>In any case, I think it should be balanced, most criticism must be constructive. I find the framework of non-violent communication very useful for discussing uncomfortable things.", "by": "blablabla123"}, {"item_id": 21108189, "text": "This works for me (it&#x27;s not original, but I don&#x27;t remember the  source): I suck at what I do, but I suck less than pretty much everyone else.<p>In our modern lives, what we do require one thousand skills. We are good at some, sometimes extraordinary at others, but invariably we suck at some. I personally suck at lots of things, but I&#x27;m decent at many things as well, and there are a few things (not many) where I&#x27;m world class. It took me many years to get to being this content (and resigned) with myself, but I got here, and now I&#x27;m ok.", "by": "credit_guy"}, {"item_id": 21110834, "text": "read or listen to the audio of Extreme Ownership.  It will reframe your perspective on failure.", "by": "tmaly"}, {"item_id": 21105844, "text": "You have to believe in yourself, beyond any personal conception of career advancement or professionalism.<p>Unless you work in a hellish organization, most people appreciate a person who can own a mistake and then take the required action to correct it.<p>It&#x27;s when people are completely blind sided by the consequence of a mistake that you knew about, but kept to yourself that things start to get dicey.<p>In the end, everyone makes mistakes. If you work on the most critical of systems where mistakes are life and death, then I pity you, but if you fall outside of the realm, just be honest about what happened with whoever it matters to.<p>As others have pointed out, you can help yourself by practicing risk management. If you&#x27;re taking a risk, try to hedge it.<p>I think most importantly, don&#x27;t be scared of your job.<p>Good luck!", "by": "CameronBarre"}, {"item_id": 21104659, "text": "People are motivated in different ways. From this question, I’d characterize a key motive for you is to be competent. Embrace it and get really good at your job. Try to find ways to remind yourself of your fears when you have free time, so that you can devote the time required to practice your craft. Enjoy your progress.", "by": "riazrizvi"}, {"item_id": 21105212, "text": "fear of rejection - your manager hasnt made your workplace feel like a safe environment for you, or you havent expressed that you would like more validation. you’ll need to talk with your manager for this.<p>overly critical and ego driven perspective - how angry do you get at yourself for making mistakes outside of work? meditation and building a softer&#x2F;less judgemental mind can work through this<p>lack of confidence in your ability to find another job - study up on interviewing, apply for some companies. create backup options for yourself.<p>fear of financial stability - like a previous poster said, it helps to have enough savings to weather any financial blips<p>fear of the unknown - improv classes are great at building confidence in yourself when dealing with unknown unknowns<p>just some ideas to work with", "by": "blankaccount"}, {"item_id": 21107099, "text": "Never really crosses my mind. Everyone messes up.<p>Incompetence is when you don&#x27;t follow process or review your own work before pushing. Simple.", "by": "jaimex2"}, {"item_id": 21110491, "text": "You need to see a psychiatrist and a counselor. You need medication to calm the anxiety while the counselor helps you figure out how and where these issues are coming from.", "by": "toploaded"}, {"item_id": 21107689, "text": "It&#x27;s not an &quot;impostor syndrome&quot;, it&#x27;s an &quot;excellent student syndrome&quot;. Cognitive behavioral therapy may help you with that.", "by": "dmitripopov"}, {"item_id": 21108725, "text": "Aha, fear of mistake. Fear of others thinking I&#x27;m not good enough. Fear of loosing my job&#x2F;status&#x2F;life.<p>Fear rules life. Not even just humans but all animals and living creatures. You are not alone. It rules my life too. Now what is this fear? Why should I have it? Can I have no fear?<p>Trying to eliminate one fear is not enough, soon you&#x27;ll be filled with another. In fact, fear fears itself.<p>I think fear is what conditions me into being who I am. The I, is built using different fears -- borders that should not be crossed. The fear of society, bad grade, loosing good status... oh, everything!<p>Now I ask myself, what is the point of maintaining this &quot;I&quot; if death is going to eliminate it. Because after all, it is too much work, constantly thinking&#x2F;working to maintain a life that is marked as &quot;APPROVED&quot; by society, enforced by fear. Then once you get that &quot;APPROVED&quot; mark you fear loosing it... right?<p>Think about it. It is crazy. I&#x27;m full of fear of crossing rules at this very moment of writing... what if people don&#x27;t like my answer, what if that is grammatically incorrect. What is the point of this constant fear?<p>It is simple, we have all these fears in the hope of preventing the experience of pain. It is ultimately the fear of experiencing pain, discomfort and ultimately death.<p>Now I have some suggesting... things that I do myself and have seen great improvement in my life having a lot less fear.<p>A) Study all your actions and see the trace of fear in all of them -- this opens up a world of understanding... soon you get it, it is all out of fear. Even love is mostly based on fear (but it does not have to be)<p>B) Eliminate the fear by thinking of death. Yes the most feared of all fears. We reject death and try to avoid it like any other fear, but with death it is even worse because it is the most feared, we go as far as subconsciously deny it. But if death does not work for you, face the experience that the fear is trying to prevent, face it, like a warrior (don&#x27;t fight) but face it, and look at its eyes, is this the actual monster that you think it is? or is fear, the real monster?<p>C) Soon, a life that is driven by less fear, teaches you great important lessons, beautiful experiences that we miss because of these stupid fears. These experiences are already happening but we cannot see because of fear.<p>Now let me talk about the experiences... eating is 100x more enjoyable, loosing weight is 100x easier, heck even waiting in traffic light is enjoyable (when there is no fear you enjoy your own being). Also one&#x27;s reaction to difficult situations is going to be 100x better when fear does not rule it all.<p>Enjoy a life with no fear, like a warrior, go to work, own the moment. If you get fired, just or unjust, face it, do the next thing. Speak up and listen with no fear. Also realize that others, your boss and co-workers are also driven by fear. Soon you feel not only your own action but other people actions, when I say feel, I mean you can actually feel their action with empathy and love -- after all they are suffering from the same monster: fear.<p>Also, most people that I talk to about this, think that once you eliminate all these fears and tendencies, you become a man of no action. That is not true, fear is defining the reaction, not actions. Once you are free of reacting to situations then you free to act instead of react -- this is very important to understand.<p>Also some people at first, once they look, they become afraid of having all these fears (again, another fear). Don&#x27;t be afraid of having fears, own it, face this person full of fears, face the &quot;I&quot;, then ask, who is the one looking at this, with no fear? and then remain in that state, all the time.<p>Wish you the best!", "by": "ne01"}, {"item_id": 21105546, "text": "Talk with the manager, discussion how to improve it.\nCollect feedbacks about 1~2 month latter,\nDon&#x27;t fear it, but solve it.", "by": "nickmose"}, {"item_id": 21105191, "text": "Save money and realize that if my incompetence bothers anyone so much they’ll just stop employing me", "by": "bigred100"}, {"item_id": 21104970, "text": "Imposter syndrome.  It’s a thing.", "by": "hullsean"}, {"item_id": 21108138, "text": "work isnt a place for learning so to say - your reputation and advancement suffer greatly if you make mistakes so its best to stick to small repeatable tasks. for larger projects you should have junior analysts perform the work while you provide guidance and monitor progress", "by": "dlphn___xyz"}]