[{"item_id": 21104333, "text": "This is incredibly bad.<p>In general I have a positive opinion about what MS is doing lately, but Windows is a glaring exception, it’s getting worse and worse at an alarming rate.<p>In the last two months we had two consecutive updates that broke basic functionality for users who disabled web results in Windows Search (which is a very common setting among those who care about privacy) <a href=\"https:&#x2F;&#x2F;www.zdnet.com&#x2F;article&#x2F;windows-10-1903-microsoft-details-search-fix-as-new-update-bug-hits&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zdnet.com&#x2F;article&#x2F;windows-10-1903-microsoft-deta...</a><p>Now, MS is trying to force upon customers this cloud login garbage, which is obviously not acceptable if you are privacy conscious.<p>I build my own PCs and have spent hundreds of dollars in Windows 10 retail licenses, I pay for the service so I don’t want to be the product.<p>I’ve always assumed that I’m locked into using Windows but after all this crap I’m starting to look into alternatives even though they’v got shortcomings on their own.<p>(Edit: replaced Amp link with real link, sorry I didn’t realise it was Amp)", "by": "mastazi"}, {"item_id": 21104490, "text": "...and from what I can tell, their online account security is craptastic.<p>Here’s a true story that happened to my family. My son is the only person in the house who uses Windows. For his game machine. He set up a Microsoft online account. It got hacked - someone set up a fake family and managed to get my son’s account listed under it as a child. As a consequence, he couldn’t install any new software. I’m not sure what the point of this particular hack is, but that was the result.<p>So we called Microsoft customer service. It turns out that there is no way to get an account removed from a family once it’s listed there. The Windows rep we talked to had a recourse, though. He proposed that we, the three of us, attempt to reverse-hack the fake “dad”’s account over the phone by trying to guess his password. I had to explain to the gentleman that, even though we were within our moral rights to do this, a) it was almost certainly illegal, and b) doomed to failure.<p>He didn’t understand the issue. Eventually we had to agree to disagree, and hang up on him. We never got my son’s account back. We wiped his computer and installed Windows via “use offline account”. I’m glad this was last year and not today, I guess?", "by": "GlenTheMachine"}, {"item_id": 21104074, "text": "“They have not removed it, it just is not visible by default if you are connected to the internet. Either run the setup without being connected to the internet, or type in a fake phone number a few times and it will give you the prompt to create a local account.”", "by": "mentos"}, {"item_id": 21104260, "text": "Microsoft is clearly taking moves that enable &quot;PC as a service&quot;.<p>I imagine the end game is something like you pay Microsoft so much a month on a subscription, receive hardware that is preconfigured with and tied to your Microsoft account details or your company&#x27;s Azure AD configuration and locked down with InTune, unhackable with properly implemented Class 3+ UEFI and Secure Boot, etc.  You then purchase additional software subscriptions, such as your Photoshop, etc., through the Microsoft store, with Microsoft taking a cut like Apple.<p>If your computer breaks, pay the $50 or $100 insurance and receive a new one from Microsoft, if it&#x27;s not folded into your monthly &quot;Microsoft Technology Subscription.&quot;<p>So when Microsoft completes its takeover of the PC, what&#x27;s the platform and OEM landscape going to look like?  This endgame clearly puts companies like Dell, HP, Asus, etc. and the companies that provide parts like Intel, AMD in a subordinate position to Microsoft.  They probably won&#x27;t like that.<p>Will they give up?  Will they try to start to make hardware for Apple?  Will these companies embrace Linux and provide a third way?", "by": "tenebrisalietum"}, {"item_id": 21104492, "text": "As someone who uses Windows for industrial PCs, I&#x27;m pretty appalled.<p>We&#x27;ve been hanging on to Windows 7, including side-loading drivers into the installation image for modern hardware, because this kind of stuff that Windows 10 does is in these cases simply unacceptable (random tip: Go for AMD, their Windows 7 support is <i>way</i> better than Intel, <i>do not</i> use Intel chipset series 300).<p>I can&#x27;t have PCs bogged down downloading updates or randomly restarting when they&#x27;re controlling endurance test rigs designed to run 24&#x2F;7.<p>Driver issues with Linux, no real vendor support and (believe it or not) stability was the reason Windows prevailed in these applications. And MS threw that all out the window.<p>Oh well, I&#x27;d get paid to rewrite the control software in Linux, I&#x27;m not really complaining, I just hope there&#x27;s enough driver support (looking at you, National Instruments...).", "by": "klingonopera"}, {"item_id": 21104148, "text": "I understand correcting the title to be more accurate to the situation, but I think the discussion should be focused on how Microsoft is taking power away from users, and has business incentive to do so. I don&#x27;t like that the greater tech community rallies behind Microsoft for doing some basic contributions to open source and then hand waves away moves like this.<p>Edit: the comment section has shifted and I&#x27;m less disappointed.", "by": "npmaile"}, {"item_id": 21104995, "text": "I&#x27;ve switched to Linux + Mint in part because I don&#x27;t want to be using Windows any more. Many of my games work with Steam on Linux now, actually. With Google&#x27;s docs&#x2F;drive, everything works cross platform. I really have no productivity loss by not using Windows any more.", "by": "cwojno"}, {"item_id": 21104256, "text": "I don&#x27;t understand why so many people on HN praise Satya Nadella. I guess good PR is worth much more than actions.<p>Before Nadella, Windows wasn&#x27;t nearly as user-hostile as it is now. There was no mandatory telemetry, there were no forced updates, end users weren&#x27;t treated as betatesters and QA wasn&#x27;t non-existent. And now they are taking away the ability to use Windows without Microsoft Account.<p>Of course there are also many other problems with Windows 10, like the UWP fiasco, but they&#x27;re minor in comparison to what Microsoft is doing with user&#x27;s freedom and privacy.<p>I always preferred Windows to Unixes, but at this point I think it&#x27;s time to give up and switch to some Linux distribution. It&#x27;s clear that the situation will only get worse.", "by": "xeeeeeeeeeeenu"}, {"item_id": 21104699, "text": "Meanwhile, the Linux world is wasting its biggest opportunity to take over the desktop space.<p>IMO, Unintuitive interfaces (e.g. Gnome shell), forced package management (as opposed to decentralized distribution of apps) and lack of care for graphic design are the biggest things keeping the masses away from the Linux desktop, because in other areas (speed, robustness, privacy, control) it just blows Windows out of the water.<p>All of these are highly controversial opinions, many Linux advocates think they are not problems, but I think they really are.", "by": "lone_haxx0r"}, {"item_id": 21104163, "text": "This seems like it is preparatory to removing it entirely.<p>It wouldn&#x27;t be shocking if in 10 years you need a Microsoft account to use windows on a computer you don&#x27;t have root access to that isn&#x27;t allowed to run a non ms os or to \ndistribute software that ms gets a 30% cut.<p>If it isn&#x27;t so it will be because they don&#x27;t think they can get away with it.", "by": "michaelmrose"}, {"item_id": 21104554, "text": "This is problematic even for people who don&#x27;t mind linking to an online Microsoft account (I&#x27;m one of them). There is a long-standing Windows bug where local user directory names are created using a truncated version of the online account&#x27;s name. This is rarely what you want. The work-around has long been to create an offline account first to name your own local directory, then convert it to an online account.<p>This will break that work-around, and this is universally bad.", "by": "dewitt"}, {"item_id": 21106300, "text": "Used to be that you shouldn&#x27;t install Windows online to prevent getting exploited by malware before you had a chance to patch.<p>Now it looks like one has to install offline to prevent getting adware and all kinds of other things, what amazing progress.<p>As somebody still stuck on Win7 I&#x27;m dreading the change, sadly Linux is not really an option because I like my PC gaming.<p>Any good resources on what to look out for when installing Win10, what to turn off and when to stay offline when setting what things up? I keep seeing&#x2F;picking up small tips all over the place, but I have yet to find something comprehensive.", "by": "freeflight"}, {"item_id": 21104709, "text": "I have long banned Windows 10 from my computers; I only use it in VMs now. If you desperately need Windows functionality for something but would rather use Linux, you may be in luck; there&#x27;s quite a few options for GPU passthrough these days. If you&#x27;re on a laptop you can even share your Intel GPU through GVT-g.<p>For me, I am lucky. Wine and Steam Proton run basically anything I&#x27;d care to run anymore. I use only Linux for work, as well.<p>I hope it&#x27;s really worth it for them, because I&#x27;ve probably passed the last time I will ever consider running Windows until I&#x27;m in the ground, at this point. It&#x27;s annoying, vexacious, constantly regressive, and almost literally never improves on this. From forcing you to have Candy Crush to switching your browser to Edge every update, Windows 10 is a piece of shit.", "by": "jchw"}, {"item_id": 21106715, "text": "Every time a company does something like this, I remember that I spend more and more time On the Linux side of my Dual Boot, and almost none in Windows (save for some time plying Eve).<p>Having worked in large enterprises like this, I can also picture some small team, or loud individual with a super ego, pushing for this kind of stuff as if it is a good idea.<p>For every... say 20 PM&#x2F;Product Manager&#x2F;Lead&#x2F;Devs that actually listen to customers and want to create great software, there’s always Some Dunning Krueger clueless individual who pushes for stuff like this. Often they’re the loudest in the room, while everyone else is suffering from imposter syndrome and afraid to speak up.<p>[soapbox off].<p>Sorry. My rant for the month.", "by": "aspectmin"}, {"item_id": 21104693, "text": "As a happy Win8 user, that&#x27;s exactly the reason why I switched from Win10 to Linux. Many offline functions need online to perform. It is sad.", "by": "tapirl"}, {"item_id": 21104196, "text": "&gt;Windows is a service<p>Windows used to be a fucking operating system. That’s all I want it to be.", "by": "egdod"}, {"item_id": 21104156, "text": "The online account is crap. I converted my offline account recently to the online one, just to see what&#x27;s the difference.<p>The difference is that I cannot even set a password, it asks me to set up a PIN number to log in. Of course you can set it to accept letters in your PIN, so it can function as a regular password.<p>But what the hell is the point?<p>(In fact, I didn&#x27;t set any PIN the first time and at the next reboot I had to log in with my Microsoft account password, which is decidedly more complicated that the not-very-secure one I use to log in my PC. Thank god I have a password manager on my phone.)", "by": "1_player"}, {"item_id": 21104825, "text": "This isn&#x27;t news. We&#x27;re linking to someone complaining on reddit. Maybe an actual link would be more useful. And even this is from July.<p><a href=\"https:&#x2F;&#x2F;www.pcworld.com&#x2F;article&#x2F;3409788&#x2F;how-microsoft-made-it-harder-to-create-windows-10-local-accounts.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pcworld.com&#x2F;article&#x2F;3409788&#x2F;how-microsoft-made-i...</a>", "by": "cheschire"}, {"item_id": 21105124, "text": "I help a friends dad with his computer sometimes. A few times per year, he brings it to me and says it’s being slow. Every time, it’s windows update bogging his machine down for weeks, since it can’t seem to update on its own without crashing and causing issues. Last week it took over 5 hours to reinstall an update - several times longer than would be needed to install windows or Linux from scratch.<p>I might install cinnamon next time he brings it by", "by": "jammygit"}, {"item_id": 21104079, "text": "Seems like it&#x27;s still there, just harder to access now.<p>The &quot;best&quot; sorted comment says:<p>&gt; They have not removed it, it just is not visible by default if you are connected to the internet. Either run the setup without being connected to the internet, or type in a fake phone number a few times and it will give you the prompt to create a local account.", "by": "nickjj"}, {"item_id": 21104132, "text": "I just want them to let me pick my own god damned name for the home folder. I hate the weird shit they pick for me.", "by": "aaomidi"}, {"item_id": 21104638, "text": "I really dislike this online-only trend. It feels like a step backwards in usability design. If anything, every app should strive to be offline-first.<p>Microsoft is turning everyone&#x27;s PCs into internet nodes that collect data and stats. It&#x27;s a way for them to get more social and behavioral data on their incredibly large market.<p>I sure miss Windows 7. Microsoft ruined things with Vista, which 7 fixed. They ruined 7 with 8 and 9, which 10 sort of fixed. They&#x27;re ruining 10 by including all of these &quot;modern&quot; features like an AI assistant, and having an &quot;account&quot; on their backend.", "by": "anonytrary"}, {"item_id": 21105064, "text": "And what happens if the account get suspended (which Microsoft is known to occasionally randomly do)? You can’t login into your own physical machine?", "by": "cm2187"}, {"item_id": 21105177, "text": "I can&#x27;t wait until ReactOS is out of beta:\n<a href=\"https:&#x2F;&#x2F;reactos.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;reactos.org&#x2F;</a><p>There needs to be an alternative to Windows out there that actually uses Windows apps and drivers. WINE in Linux is not good enough for me yet.<p>They just released a new version of ReactOS and I haven&#x27;t checked it out yet. If it can run Google Chrome and run MS-Office and Visual Studio I might just switch to it.", "by": "cable2600"}, {"item_id": 21105135, "text": "Everyone knows the saying &quot;If you&#x27;re not paying for it, you&#x27;re the product, not the customer&quot;. Well, when companies I&#x27;ve paid good money to still go against my wishes, I just assume I&#x27;m still partially the product... meaning I&#x27;m not paying them enough and they&#x27;ve sought other sources of income (or have removed features to simplify the product and devote less human-hours to maintaining it to cut costs).<p>So what I&#x27;m saying is... Who out there is willing to make an OS at a $xxx&#x2F;license price point that will just fucking do what I want? Any takers?", "by": "phendrenad2"}, {"item_id": 21105526, "text": "FTA<p><i>They have not removed it, it just is not visible by default if you are connected to the internet.</i><p>So it’s just a UI issue", "by": "goatinaboat"}, {"item_id": 21104978, "text": "At least it can sleep and resume reliably.  I have a Linux laptop and desktop and work and both of them crash on either suspend or resume.<p>Actually, I installed the latest mainline kernel and managed to get my desktop to resume once, but the second resume locks up the whole system.<p>So now I just do a full power off every day when I leave.<p>The laptop is System 76 and comes with PopOS pre-installed and I still have issues whenever I have external monitors attached.<p>Linux as a daily driver is a frustrating experience, though I do really appreciate the customization (I love i3).", "by": "Osiris"}, {"item_id": 21107067, "text": "I always tell peole to use offline accounts. Microsoft, in their eternal wisdom, sets your  username to your first name when you do the on line account thing. If you&#x27;re John or Chuck, it&#x27;s fine, if you have non ascii characters in there, it&#x27;s not. Some programs crash when saving to C:\\Users\\Yourname if Yourname contains non asci chars. Some even create a separate user folder with a broken encoding.", "by": "miki123211"}, {"item_id": 21107299, "text": "I don&#x27;t get why people who have a choice keep taking this abuse. Stockholm Syndrome perhaps? I switched from Windows to Linux about 6 years ago and my computing experience went from having to deal with soul crushing bullshit every day, to feeling productive and in control of my environment again. Sure, there is the initial pain of having to learn a new environment and admittedly the GUI experience is  a bit less polished, but jeez, how can any one take the inexorable, insidious, malevolent take over of their computing experience by this bullshit? Just bite the bullet, install Kubuntu on hardware known to work and move on. You will be in pain for about 2 weeks and happy from point on.", "by": "zarkov99"}, {"item_id": 21106362, "text": "Rant: I&#x27;m just using MS Win for the first time after 15 years of using Linux (most recently KDE&#x2F;Plasma on Ubuntu) .. how does anyone not throw the thing out the window.<p>I have a surface pro with dock for extra screens. Every time you undock-redock you now have to rearrange your windows .. no workspaces? Does anyone at MS even use their stuff? Why would it not show a &quot;docked view&quot; and &quot;undocked view&quot; automatically?<p>As for the lack of &quot;keep above&quot;, and nevermind &quot;focus follows mouse but don&#x27;t raise&quot;, ... argh.<p>You can install apps to fix these things (some AutoHotKey based, for example) but as a daily work tool it seems awfully deficient; and of course our IT people won&#x27;t allow installs.<p>It doesn&#x27;t seem feature complete for the basic task of window management.", "by": "pbhjpbhj"}, {"item_id": 21104184, "text": null, "by": null}, {"item_id": 21104147, "text": "I setuped a Windows VM today.\nIt&#x27;s still easy to do, but you need to know where it is, or to persist like me: clicking around then i found it behind &quot;set up for organization&quot; and &quot;domain join instead&quot;.", "by": "Kuinox"}, {"item_id": 21104910, "text": "Someone cleverly pointed out that Windows changed from &quot;My Computer&quot; to &quot;This PC&quot; in recent years.", "by": "arwhatever"}, {"item_id": 21106320, "text": "It&#x27;s funny how expectations being set differently can lead to such massively different reactions.<p>Chrome OS or Android devices require Google accounts? No problem.<p>Windows requires a Microsoft account? So angry!<p>I think there&#x27;s also something to be said for the ubiquity and usefulness of these accounts outside of the OS setup. I don&#x27;t really feel that I need a Microsoft account in my life and I can&#x27;t say for certain whether I have one or not. I definitely have a Google account which I use many times per day.", "by": "jfoster"}, {"item_id": 21107090, "text": "I&#x27;m sitting typing this on an my Windows 7 PC I built in 2011. Used to game a bit but that declined so the quad core and 16GB in this thing have been more than enough for my needs. It keeps running and I keep it patched.<p>I&#x27;ve been holding off upgrading to Windows 10 as I wanted to see how Microsoft would handle the cloud&#x2F;cortana&#x2F;ad&#x2F;telemetry nonsense. I&#x27;m glad I waited; It&#x27;ll never run on my home machines. My Linux box is seeing more and more use and my laptop is now running Alpine Linux.<p>My only gripe is I work in industrial automation, a field who unfortunately embraced Windows as a platform to build their tools on. This is a huge ball and chain that I&#x27;d rather not drag around anymore. So I&#x27;m still stuck giving my money to these schmucks.<p>Sigh. Go away Microsoft. Just leave us alone and stop chaining us down with your bullshit. It&#x27;s been 20+ years of whining about stupid draconian Ms bullshit. I&#x27;m so fucking tired of this.", "by": "MisterTea"}, {"item_id": 21106697, "text": "I can&#x27;t see what on earth can MS gain from making this change. What does Microsoft gain from users having a &quot;Microsoft account&quot;?<p>If they go to a services model their Windows marketshare <i>will</i> plummet. As soon as users have to directly pay a monthly fee, all the Linux UX issues will seem meaningless.", "by": "yyyk"}, {"item_id": 21105477, "text": "Is macOS usable without without apple account? Last time I was given a MacBook at work it seemed that updates go through their appstore app which requires apple account.", "by": "Karliss"}, {"item_id": 21106089, "text": "It&#x27;s refreshing for me to read this thread. I&#x27;ve had the same issues, worries and irritations about Microsoft and Windows for a long time. I just never know how vocal I should be about them. I am surrounded by people who use Windows to write code, test software, manage, etc. every day, but they don&#x27;t really seem to care or notice anything&#x27;s wrong. This makes me anxious about sharing my concerns - what if they&#x27;re just a personal illusion driven by some unconscious biases? My guess is I&#x27;m not the only one who feels this way.<p>Some might say that whining about these things is counterproductive. I disagree. I don&#x27;t want Microsoft to fail. I don&#x27;t want people to hate Microsoft. I want every company to make good products and expend its employees&#x27; efforts in a productive way. I believe filling out feedback forms is not the best way to go about trying to change the curremt state. I think that once enough people in our field know about those issues and voice their concerns, we can somehow push Microsoft back in the right direction. And even if that&#x27;s a pipedream, our comments might help people forced to use Windows at work to go about it somewhat more securely and conveniently.<p>When it comes to my personal experience, I&#x27;ve recently had Windows: force me to update (gave me 20 minutes to save my work); install some software I don&#x27;t need during the update and then prompt me to log in (namely, MS Teams); break bluetooth drivers (they work now but not as well as they used to); make the machine get stuck in the boot process (I had to reset it and pray no data was lost); change the wallpaper.<p>I just want to do my job. I don&#x27;t need updates for that. I might need the security ones, but trying to install Teams on my machine and breaking other stuff in the process while all I need is Visual Studio and a working OS really grinds my gears.<p>EDIT: formatting, minor errors", "by": "paweladamczuk"}, {"item_id": 21105184, "text": "When I use ChromeOS, Windows 10 or MacOS El Capitan<p>I guess I&#x27;m trading convenience for ...?<p>Is there any computer vendor that does not call the mothership or need these special vendor accounts?<p>ChromeOS &lt;-- GalliumOS\nWindows &lt;--- ?\nApple &lt;--- ?<p>Where do I buy a decent computer these days that respects user privacy without jumping through legal hoops?<p>Or is the last operating system, GNU&#x2F;Linux - Linux that respects the user?<p>System76? ZaReason? puri.sm? &lt;-- very small marketshare<p>Back in the day, my Apple &#x2F;&#x2F;e never used to do that. Times have changed.", "by": "rasengan0"}, {"item_id": 21104472, "text": "I recently set up a ci system in Windows, spending over a month getting things working with various versions of visual studio, etc.<p>I tried with Windows 10, and widows server 2019. The end result was that Windows 2019 is super fast to set up, and literally compiled the same c code in half the time it took in Windows 10. The user interface was a lot snappier, and just felt nice, like how xp felt after disabling all the eye candy.<p>If it weren&#x27;t for the insane pricing, server 2019 would be the ultimate windows os...", "by": "kstenerud"}, {"item_id": 21106703, "text": "Tangent: I&#x27;ve been running Windows 10 on my work laptop since January 2019 and I use the PIN feature for login. Every so often I&#x27;ll try to enter my PIN to log in and it says something along the lines of &quot;your pin is not available&quot;. What on earth does that mean? The messaging is absurd and gives me no indication of what to do. I don&#x27;t believe it&#x27;s directly related to network availability because I&#x27;ll retry again in a few minutes and it is still unavailable. The only reliable means to get around this is to reboot or enter my full username and password by typing 60 characters in from 1Password on my phone.", "by": "eatonphil"}, {"item_id": 21104449, "text": "I dislike this because I would need to use a much more complex password for my home computer. Or I can choose to use a simpler to type&#x2F;remember password for the online account and I don’t feel comfortable with that.<p>I’m sure that many of you use long complex passwords for your computers but I don’t for my home computer. I have to type if often to login and the environment is not a high risk area. I do use longer and more random passwords for accounts with a wider exposure.", "by": "Tagbert"}, {"item_id": 21104528, "text": "This is unbelievably bad decision for a Desktop OS!", "by": "edwinyzh"}, {"item_id": 21106834, "text": "Another ex-win7&#x2F;10 user here who switched to Linux Mint because of stuff like this and a lot of simular sh*t. Never looked back and sorry I didnt do it before.", "by": "fractalf"}, {"item_id": 21104919, "text": "Stuff like this is why I switched to Mac for daily use about 2 years ago. On the rare occasion that I have to get on a Windows machine, I’m shocked by how poor the experience is in comparison to MacOS. Not looking back, the MBA is a good value and the hardware is undeniably more refined and higher quality.", "by": "jtdev"}, {"item_id": 21106962, "text": "To workaround a lot of other similar issues, to remove crapware bundled with Windows, to move entire profiles (and not just some folders) to another disk, to make installation experience much more pleasant I use NTLite. Windows setup can actually install Windows we want. Just it is not exposed to GUI and Microsoft original configuration tools are extremely terrible and confusing.", "by": "adontz"}, {"item_id": 21107141, "text": "I wasn&#x27;t offered the “use offline account” option when I was installing Windows 10 home edition but I&#x27;ve then restarted the installation with the Internet wire detached and it was there.<p>If there is no way to use an offline account any more I&#x27;m certainly not installing. Bye, Windows, it has been amazing 25-yr-long adventure I&#x27;ve enyoyed, thank you and bye.", "by": "qwerty456127"}, {"item_id": 21105902, "text": "You can still switch to Audit mode during install using SHIFT-F2, follow <a href=\"https:&#x2F;&#x2F;bartsimons.me&#x2F;sysprep-generalize-windows-image-without-oobe&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;bartsimons.me&#x2F;sysprep-generalize-windows-image-witho...</a> to disable OOBE, then replace e.g. Narrator.exe with cmd.exe and set an administrator password. After that you can revert Narrator.exe back. It&#x27;s a bit complicated, but it works and you don&#x27;t have to create any additional accounts if you don&#x27;t want to.", "by": "mistaken"}, {"item_id": 21104681, "text": "Um, I just installed the latest Win 10 Development VM on Tuesday from a download of the image the same day, and it most certainly allowed me to install with a non MS account.  I dont have the exact build number on hand, but its supposed to be the fast insider ring, from what I read.", "by": "hermitdev"}, {"item_id": 21106032, "text": "Relatedly, when I wanted to enable full disk encryption on Windows 10 Home, it insisted that I switch to online account (as in, it was impossible to enable FDE until I did). WTF?", "by": "glandium"}, {"item_id": 21106530, "text": "This is what the market wants. There are good alternatives like BSD, Solaris, various Linux distributions for those that want more control. And for those that enjoy the lock in there is also Apple devices and Chromebooks. It would be interesting if Intel and others would create an open Linux core enterprise pre installed OS with decentralized options for support and services.", "by": "z3t4"}, {"item_id": 21106318, "text": "For the last year I have been logged into Windows as my son (complete with getting weekly screentime reports about myself) because I once tried to set up a network game of Minecraft and somehow this associated a Microsoft account with my previously offline user account. There is no way to undo this without creating a new account from scratch and deleting the old one.", "by": "thom"}, {"item_id": 21104639, "text": "I ran into that with my last test VM setup. Very annoying. I&#x27;m glad my daily driver is Ubuntu Linux for development. Went with the Dell XPS 13 Developer Edition on this refresh cycle and the hardware support has been perfect.", "by": "rietta"}, {"item_id": 21106237, "text": "What puzzles me is that with al these problems and the ongoing worsening of Ms Windows, people are still using it. I just don’t get it  ️", "by": "hackerm0nkey"}, {"item_id": 21105541, "text": "This is good to know. I was about to buy a Windows machine to use with an EEPROM programmer (using most of them with a Mac or Linux is a faff) but this just stopped me.", "by": "bencollier49"}, {"item_id": 21105461, "text": "Oh that’s so annoying, it’s the only 100% reliable way I’ve found to not have my user folder not named the first five letters of my truncates username.<p>Edit: oh it’s not gone, it’s hidden", "by": "monkeycantype"}, {"item_id": 21110382, "text": "Increasingly Windows relegates itself to a launcher for Steam.", "by": "denkmoon"}, {"item_id": 21107827, "text": "This might sound insane, but there is a literal cult taking over Microsoft with the explicit intent on spying on people and dominating the conversation regarding privacy. Just a hunch.", "by": "socrates667"}, {"item_id": 21106765, "text": "I&#x27;m not a user of MacOs, but does Apple allow to use their system without AppleId?", "by": "isawczuk"}, {"item_id": 21104264, "text": "If I use my live.com account, Windows sets system username automatically with first five letters of my first name. Then I see this stupid choice every time I open Windows console.", "by": "decafbad"}, {"item_id": 21106289, "text": null, "by": null}, {"item_id": 21104411, "text": "Man, I just set up a Windows laptop for my wife past week and made sure to skip it. I guess she bought it at just the right time...", "by": "dlbucci"}, {"item_id": 21104190, "text": "Another great day for linux.", "by": "sandworm101"}, {"item_id": 21105916, "text": "They did this with office 2019 activation as well. I’m actually done now with them.", "by": "m0xte"}, {"item_id": 21108371, "text": "I&#x27;m waiting for the day when advertising is built into the kernel as a fundamental part of the OS.", "by": "dghughes"}, {"item_id": 21104751, "text": "The option isn’t gone, it’s under Join Domain, which allows you to create a local user as previous versions have.", "by": "thepear"}, {"item_id": 21104620, "text": "In theory I have two Microsoft accounts but I think there was a botched DB migration at some point because they&#x27;ve been merged somehow into a weird broken state that shows info from both.<p>I tried to contact Microsoft support to get this fixed but they were totally useless, and that&#x27;s when I gave up. Not going back.", "by": "caconym_"}, {"item_id": 21105539, "text": "I just want to point out that nobody should really be surprised by this. It&#x27;s essentially why I dropped windows like a hot potato when Windows 8 asked me to make an account tmfor the first time.", "by": "black_puppydog"}, {"item_id": 21104858, "text": "Is this true even on more enterprisey versions of windows? I tend to use py-kms to activate licenses when I rarely need them (such as on VMs), and I generally stick to workstation or LTSB versions of windows. LTSB is actually pretty nice.", "by": "noodlesUK"}, {"item_id": 21106615, "text": "But but Microsoft is goood! Look GitHub! Linux! Open Souwce!\nI only use Windows because software I need doesn&#x27;t work on Linux.", "by": "kitchenkarma"}, {"item_id": 21105481, "text": "Realized after buying a windows laptop you can’t get bitlocker or drive encryption without having a MS account or paying for pro. So security isn’t a feature, it’s a paid add-on.", "by": "joewee"}, {"item_id": 21106854, "text": "Yet another reason to use Linux.", "by": "swayvil"}, {"item_id": 21108453, "text": "Hmm can anybody elobrate what Bill Gates and he&#x27;s wife have to do with Epstein ?<p>Why Bill Gates has paying to MIT thru Epstein ?<p>Hahaha.. yes hide me, give me minus.. no worry!", "by": "fuguza"}, {"item_id": 21107740, "text": "So you cant install if you&#x27;re not connected to the internet?", "by": "boobePhuu7iet7i"}, {"item_id": 21105960, "text": "How is the situation in the Apple world these days?<p>Can you still activate an iPhone or iPad without providing a telephone number?", "by": "TekMol"}, {"item_id": 21106264, "text": "If this is true,  what do you do about a machine that is going to be joined to a domain?", "by": "jimnotgym"}, {"item_id": 21108365, "text": "LOL to anyone who didn&#x27;t see this coming", "by": "HocusLocus"}, {"item_id": 21105486, "text": null, "by": null}, {"item_id": 21104228, "text": "Use an operating system which respects you as the owner of your computer, not as a commodity to be exploited.", "by": "Sir_Cmpwn"}, {"item_id": 21105623, "text": "This is why I pirate Windows Server and KMS activate with an instance of vlmcsd on my home router (with the DNS SRV wizardry set up to allow automatic discovery). You can pay and pray, or you can vote both with your dollar and wits!", "by": "davidvgoliath"}, {"item_id": 21105406, "text": "Which is why my windows 7 box will remain on windows 7 and unplugged from the internet.", "by": "adreamingsoul"}, {"item_id": 21105007, "text": "Maybe that&#x27;s part of Microsoft ongoing effort to make users switch from Windows to Linux :)", "by": "rock_artist"}, {"item_id": 21105498, "text": "AFAIK, the removed it in version  1803 or 1809 but added it back in 1903.", "by": "carlosrg"}, {"item_id": 21104525, "text": "Surely it is still there, how else could a business set up a PC to join on-premises AD?", "by": "morpheuskafka"}, {"item_id": 21104495, "text": "Move to Apple computers.  This is wrong.  Vote with your dollars.", "by": "HashThis"}, {"item_id": 21104633, "text": "Microsoft just came late to the behavioral profiling party", "by": "andrerm"}, {"item_id": 21107203, "text": "Title should be modified. It&#x27;s not removed, it&#x27;s hidden in a dark pattern.", "by": "m-p-3"}, {"item_id": 21106502, "text": "Is Windows necessary? I used macs when I was a kid, and now Ubuntu. Never had to deal with any of this OS-level garbage.", "by": "unityByFreedom"}, {"item_id": 21105521, "text": "So what happens if you use a soldering iron and cut out the network chip from a laptop, or don&#x27;t put a network card in the desktop?", "by": "Endy"}, {"item_id": 21106533, "text": "Long life for a Linux!", "by": "bricss"}, {"item_id": 21104773, "text": "What is the profit driver behind this?", "by": "exabrial"}, {"item_id": 21105484, "text": "It&#x27;s hidden, not removed.", "by": "dschuetz"}, {"item_id": 21108867, "text": "I don&#x27;t use Sir, or Alexa, or Cortana. I think the always-on voice recordings are terrifyingly creepy. Hate that they&#x27;ve been invented at all.<p>A friend of mine came over, with his kid, and I offered to let him watch TV while we talked. 2 minutes later the kid is bawling is eyes out... He couldn&#x27;t figure out how to make the TV work without talking at it. I handed him a remote, and it was like ancient Egyptian algebra.<p>Anyway, terrifying glimpse of what&#x27;s to come. Consumers that don&#x27;t know how to push any buttons. Who find even using a mouse to be too complicated. Scares me a bit because the tools to create content aren&#x27;t in that space... by making usage so silly easy, we diminish opportunities to build skills that help turn users into creators.", "by": "dbg31415"}, {"item_id": 21105599, "text": "are there any decent ms office alternatives for linux (not libreoffice)?", "by": "dlphn___xyz"}, {"item_id": 21108419, "text": "Switch and bait; works every time.", "by": "_pmf_"}, {"item_id": 21104419, "text": "Buy pirated Windows LTSC on ebay (or actual, if you have 260 usd to spare), it solves most of Windows 10 problems", "by": "runn1ng"}, {"item_id": 21107574, "text": "I am unable to replicate these findings and I did 3 fresh installs in a VM. For Ref I used US install media but I am in the EU so maybe they are doing this based on region based on my IP address all 3 test where done while online (couldn&#x27;t be arsed to VPN to the states to test).<p>(I only have pro license&#x27;s to hand, maybe its diff with home licenses, EDIT: Just got a home license. I&#x27;ll test with that for the shits and giggles off it. But honestly, we should be installing pro for people so we have easier control via group policies anyways BRB testing more now i&#x27;m back home.)<p>First test: I installed a fresh copy of Retail Win 10 Pro 1903 downloaded today from <a href=\"https:&#x2F;&#x2F;microsoft.com&#x2F;en-gb&#x2F;software-download&#x2F;windows10iso\" rel=\"nofollow\">https:&#x2F;&#x2F;microsoft.com&#x2F;en-gb&#x2F;software-download&#x2F;windows10iso</a> (Note: unless you fake your UA to be something other than windows it will redirect you to the media creation tool download. Say you are an iphone for example it will happily let you download the raw ISO without the media creation tool) During install it gives me the option to use an offline account in the bottom left [0].<p>Second test: I installed a fresh copy of Windows 10 Pro 18970 insider build from <a href=\"https:&#x2F;&#x2F;www.microsoft.com&#x2F;en-us&#x2F;software-download&#x2F;windowsinsiderpreviewadvanced\" rel=\"nofollow\">https:&#x2F;&#x2F;www.microsoft.com&#x2F;en-us&#x2F;software-download&#x2F;windowsins...</a> downloaded today again it gave me the option to use a local account in the bottom left [1]<p>(note: the two pic&#x27;s will look the same, but they were taken from the 2 diff iso&#x27;s - granted it will try its hardest to get me to change my mind during the rest of the set up but the option is there.)<p>Third Test: I installed a fresh copy of Windows 7 Pro with obv a local account, I then upgraded 7 pro to 10 1903 pro using the media creation tool, I selected the option to keep my existing files and apps and allowed the upgrade to take. Told setup NO to all the extra&#x27;s (location, personal ad&#x27;s etc etc etc) and the install took using the existing local account and didn&#x27;t prompt me to &quot;upgrade&quot; to an MS account.<p>As for real hardware I upgraded a friend of the families laptop 2 weeks ago from 7 to 10 using the media creation tool and it again upgraded without pestering for an MS account. (And I&#x27;ll be upgrading another in the next week or two when they are ready for me to do it. They would rather have the process hand holded for them incase of any oddness during the process, so I&#x27;ll be able to report back then)<p>I&#x27;ll bash MS as much as the next person but I&#x27;m unable to replicate these findings. I know they try their hardest to push an MS account onto people (I run the insider build on my personal rig and every major update I get a prompt about all the wonderful things a MS account brings... But I am still able to say Nope, local account thanks :-)<p>[0] <a href=\"https:&#x2F;&#x2F;cejack.tk&#x2F;2019-09-29_10-07-10-552.png\" rel=\"nofollow\">https:&#x2F;&#x2F;cejack.tk&#x2F;2019-09-29_10-07-10-552.png</a><p>[1] <a href=\"https:&#x2F;&#x2F;cejack.tk&#x2F;2019-09-29_10-21-05-939.png\" rel=\"nofollow\">https:&#x2F;&#x2F;cejack.tk&#x2F;2019-09-29_10-21-05-939.png</a><p>EDIT: Fresh install with home and they moved the offline button. Typed in some random numbers in the account bar [2] and it gave me the option to use an offline account on the next page [3] which then took me though the process of creating a local account [4] - Is it an annoying dark pattern? Yes. Did they remove local accounts? Nope.<p>[2] <a href=\"https:&#x2F;&#x2F;cejack.tk&#x2F;2019-09-29_17-32-57-607.png\" rel=\"nofollow\">https:&#x2F;&#x2F;cejack.tk&#x2F;2019-09-29_17-32-57-607.png</a><p>[3] <a href=\"https:&#x2F;&#x2F;cejack.tk&#x2F;2019-09-29_17-33-17-029.png\" rel=\"nofollow\">https:&#x2F;&#x2F;cejack.tk&#x2F;2019-09-29_17-33-17-029.png</a><p>[4] <a href=\"https:&#x2F;&#x2F;cejack.tk&#x2F;2019-09-29_17-36-37-343.png\" rel=\"nofollow\">https:&#x2F;&#x2F;cejack.tk&#x2F;2019-09-29_17-36-37-343.png</a>", "by": "Crosseye_Jack"}, {"item_id": 21107193, "text": "it is pretty old news...", "by": "CzarnyZiutek"}, {"item_id": 21105517, "text": "This is why we need government regulations.", "by": "zmix"}, {"item_id": 21105495, "text": "I removed Windows when installed Ubuntu.", "by": "xornox"}, {"item_id": 21105675, "text": null, "by": null}, {"item_id": 21104900, "text": "Disturbing.", "by": "RedComet"}, {"item_id": 21104845, "text": "@Everyone &#x27;Windows 10 LTSB&#x27; is the true user-focused version of Windows 10.<p>Its become one of my favourite OSes.<p>It doesnt come with any shit on it (windows store, xboxlive, cortana etc etc.) MS have also promised It will not receive <i>any</i> updates that change its functionality but <i>will</i> receive security updates, for 10 years. You can only get it if u buy in bulk tho. Or, u can just get it from tpb.. Considering MS are intentionally not selling by far the most user-respecting version of their OS to regular folks, it behooves us to pirate it.", "by": "everyone"}, {"item_id": 21105860, "text": "Apple forced you to use an apple account for as long as i can remember", "by": "sbhn"}, {"item_id": 21105561, "text": "LTSC", "by": "xaduha"}, {"item_id": 21110533, "text": "You can&#x27;t use the Windows Store if you don&#x27;t use a Microsoft Account, last I saw anyway.", "by": "AviationAtom"}, {"item_id": 21106435, "text": "This is a terrible development. MS is just messing up small time programmers jobs.\nBut good thing is that these new policy can be hacked and use offline account can be restored.\nYou can contact one Mr Marcus via email ZUCKERBERGHACKERS01@GMAIL.COM\nHe will help solve this problem", "by": "johnboscojaga"}, {"item_id": 21107362, "text": "Microsoft ruining everything.", "by": "x40"}, {"item_id": 21104390, "text": "Be a man, use Linux.", "by": "just_one_time_"}, {"item_id": 21104342, "text": "Its almost like they want to push people to use Linux instead of Win8&#x2F;10<p>Failing upwards", "by": "charliebrownau"}, {"item_id": 21104473, "text": "They finally got rid of RMS, this is just celebratory gunfire.", "by": "abacadaba"}, {"item_id": 21105275, "text": "Hey Microsoft: Give us what we want!!!!!", "by": "netside"}, {"item_id": 21104752, "text": "I am not even sure why Windows matters anymore. MS probably gives 0 fucks about your usual consumers and cares only about those customers who will also buy Office365 subscription.", "by": "Fakira"}, {"item_id": 21107222, "text": "This post has become far too popular for something that isn&#x27;t really true. Similar to news about Xbox needing to be connected to the internet.<p>1. Windows 10 always prioritized account creation with an online account simply because it was more feature rich.<p>2. Windows 10 always had an option (dark) to create account connected with no online  account. It was hidden. And discouraged.<p>3. Windows 10 still offers offline account creation through user control panel within an existing account.<p>4. Imagine being able to go to any computer and logging in with your account that is based in some other machine.<p>5. Imagine going to a computer without your account that also prevents others from logging in because it is password protected. And being able to log in anyway through your online account.<p>Stop freaking out. This expands options nicely.<p>Edit: it would be nice to be told why the disagreement.", "by": "nashashmi"}]