[{"item_id": 21106287, "text": "I don&#x27;t understand the JSON obsession. JSON as any other file format should be a small detail in any application and require very little plumbing code.<p>In every application, any dependency to JSON should be minimized, contained and preferably eliminated.", "by": "kyberias"}, {"item_id": 21106046, "text": "How does this compare with RapidJSON, JSONCpp and JSON Spirit - other popular C++ JSON parser libraries?<p>Links:<p><a href=\"http:&#x2F;&#x2F;rapidjson.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;rapidjson.org&#x2F;</a>\n<a href=\"https:&#x2F;&#x2F;github.com&#x2F;Tencent&#x2F;rapidjson\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Tencent&#x2F;rapidjson</a><p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;open-source-parsers&#x2F;jsoncpp\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;open-source-parsers&#x2F;jsoncpp</a><p><a href=\"https:&#x2F;&#x2F;www.codeproject.com&#x2F;Articles&#x2F;20027&#x2F;JSON-Spirit-A-C-JSON-Parser-Generator-Implemented\" rel=\"nofollow\">https:&#x2F;&#x2F;www.codeproject.com&#x2F;Articles&#x2F;20027&#x2F;JSON-Spirit-A-C-J...</a>", "by": "einpoklum"}, {"item_id": 21106211, "text": "My only mild complaint with this particular JSON library is that it&#x27;s fairly easy to shoot yourself in the foot with the compile times if you don&#x27;t explicitly ensure that you use the json_fwd.hpp header in your headers.", "by": "Teknoman117"}, {"item_id": 21105983, "text": "Kudos on the very thorough readme, complete with CMake instructions, most of the time people take it for granted that you know how to embed libraries and dependencies.<p>Writing documentation, and easing users into your project, is an underrated skill.", "by": "stevekemp"}, {"item_id": 21106002, "text": "This is a solid project and I’m using it in many different projects for years. The developer team is responsive and care about the quality of the project as well as people’s need. I can not recommend it enough.", "by": "amirmasoudabdol"}, {"item_id": 21107602, "text": "I don&#x27;t understand those single header libraries. Anyone writing code in c or c++ knows how to link a library.\nIt&#x27;s really annoying when writing code for a platform with limited ram.", "by": "baltbalt"}, {"item_id": 21106593, "text": "Note that this library basically requires exceptions to be enabled, which may or may not be the case in your environment.<p>(It is actually possible to use without, but then exceptions become aborts, and you have to dance around that.)", "by": "jchw"}, {"item_id": 21106846, "text": "I&#x27;m wondering what the difference between this and json-cpp  <a href=\"https:&#x2F;&#x2F;github.com&#x2F;open-source-parsers&#x2F;jsoncpp\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;open-source-parsers&#x2F;jsoncpp</a> is. They look like they provide the same functionality, albeit this looks more &quot;modern C++ style&quot;?", "by": "omouse"}, {"item_id": 21109742, "text": "I used this library on bare metal arduino a year ago. It felt funny doing high level programming on such crappy hardware!", "by": "etaioinshrdlu"}, {"item_id": 21106018, "text": "&gt; In languages such as Python, JSON feels like a first class data type.<p>Is that because the python dictionary happens to looks so much like json, or what do they mean?", "by": "wodenokoto"}, {"item_id": 21106030, "text": "I have been using json11 for a few years now (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;dropbox&#x2F;json11\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;dropbox&#x2F;json11</a>). It looks like it has been abandoned though. This seems like a great alternative.", "by": "mirsadm"}, {"item_id": 21108342, "text": "Gource for this repo: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;cyaCZDffAbQ\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;cyaCZDffAbQ</a>", "by": "pretty_colors"}, {"item_id": 21109058, "text": "You know it&#x27;s a hipster repo when there are emojis in the commit messages. Also, header-only libraries suck for compile times. Need to be abstracted with impl-pimpl idiom to compile in a sane amount of time again. No thanks.", "by": "Kenji"}]