[{"item_id": 21108209, "text": "This product just seems... like a throwback to the first decade of this century.<p>A time when we rebelled against over-advertised, and over-priced Gillette Fusion cartridges.  Not by growing beards (that would come in the 2010&#x27;s).  But rather by shaving with $100 German double-edge razors, badger hair brushes, and artisial shaving soaps instead.<p>This here is a cheap pocket radio, like you could find at Walmart for $5.  Except that it is built to tune into only one frequency, it has no headphone jack, and its form-factor is a old-timey mason jar.  It&#x27;s &quot;artisanal&quot;, and &quot;locally-sourced&quot; and all that, and it does look like a pretty conversation piece.  But do people still gravitate to stuff like this?<p>I&#x27;m asking from genuine curiosity, because I&#x27;m not sure whether the &quot;hipster&quot; era faded away, or if it&#x27;s still there and I just grew a little too old?", "by": "StevePerkins"}, {"item_id": 21108157, "text": "The price is a good conversation about globalizing supply chains.<p>But what&#x27;s really cool is they have a way to program radios which are sealed inside a cardboard shipping box, without batteries installed.<p><a href=\"https:&#x2F;&#x2F;wp.josh.com&#x2F;2017&#x2F;03&#x2F;18&#x2F;capacitive-coupling-casestudy-programming-the-public-radio-without-removing-it-from-its-sealed-shipping-box&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;wp.josh.com&#x2F;2017&#x2F;03&#x2F;18&#x2F;capacitive-coupling-casestudy...</a>", "by": "imglorp"}, {"item_id": 21108714, "text": "The key part seems to be this:<p>&gt; In other words: We’re making a piece of consumer electronics just-in-time in the US.<p>It is indeed hard to bring down costs that way, but when each unit needs to be individually programmed, as in this situation, this is a sensible way of doing it.<p>This is also a good way to do low volume production in general for hardware side-projects and the like. My own Relay (<a href=\"https:&#x2F;&#x2F;foundrytechnologies.com&#x2F;relay.php\" rel=\"nofollow\">https:&#x2F;&#x2F;foundrytechnologies.com&#x2F;relay.php</a>) is made in the same way - the components come from China but the assembly and firmware upload is done in the US. This also keeps the firmware confidential, which works well for IP protection. For higher volumes, I&#x27;d think we&#x27;d eventually move the assembly offshore, but not the firmware upload.", "by": "arbuge"}, {"item_id": 21108435, "text": "I am impressed if this business works. You&#x27;re selling something for $60 with the same functionality as something I can get on Alibaba $0.30-$1 per unit. And the people are buying it because of all the artificial restrictions.", "by": "lxe"}, {"item_id": 21108454, "text": "For those confused as I was, you can switch the current station but it&#x27;s not convenient or meant to be done often. You can basically disassemble the radio and press a button to cycle through available FM stations and leave it on the one you want.<p>Why this button isn&#x27;t just available on the lid is beyond me. While I do appreciate simplicity I really don&#x27;t understand the value of a single station radio either.<p>&gt; <a href=\"https:&#x2F;&#x2F;www.thepublicrad.io&#x2F;faq\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thepublicrad.io&#x2F;faq</a>", "by": "vyrotek"}, {"item_id": 21109662, "text": "I think it would be a good promotional gift for public radio pledge drives.", "by": "zw123456"}, {"item_id": 21108179, "text": "This is an interesting post from the perspective of logistics operations for a small scale consumer electronics product.<p>I&#x27;m fascinated by the idea that one of the features they chose to cut from their initial release - arbitrary tuning - has ended up significantly constraining how they can manufacture their product at their scale.<p>I&#x27;m guessing that there&#x27;s a deeper philosophical reason for not building an end-user tunable radio that isn&#x27;t simply &quot;it&#x27;s a feature we decided to cut so we could ship on time&quot;", "by": "charliesome"}, {"item_id": 21108257, "text": "I&#x27;m an avid radio listener, literally every room in my house with a power outlet has one or more tabletop radios in it. Why would I want a radio that only tunes to one channel?<p>I tend to use vintage (80&#x27;s era) clock radios at home for my tabletop radios, because of their decent pricing.", "by": "Aloha"}]