[{"item_id": 21108012, "text": "This won&#x27;t be really helpful to you since you&#x27;ve already built it, but I&#x27;m the kind of person who doesn&#x27;t like videos. I AM interested in Ansible, but I don&#x27;t want to sit through videos about it; I want to read and follow the examples as I do.<p>Actually, I wonder what the split is between people who prefer videos vs people who prefer reading?", "by": "kstenerud"}, {"item_id": 21108280, "text": "I really wish there was a configuration management tool out there with a statically typed API. I&#x27;ve spent countless hours debugging Ansible&#x27;s YAML which gets really unwieldy with hundreds or thousands of tasks.", "by": "meddlepal"}, {"item_id": 21107814, "text": "Looks really interesting. My jobs is talking about implementing Ansible, so I&#x27;ll definately be taking this and providing feedback!<p>Thanks for the knowledge donation.", "by": "berbec"}, {"item_id": 21109995, "text": "This is very nice and effective. I just wish you had spent time in using the real world examples related to the server configs, instead of using the examples of hello-world, list of a, b, c, etc.", "by": "webwanderings"}, {"item_id": 21107858, "text": "One suggestion: Once one video ends, it would be nice if we would be re-directed or if the following video would load automatically.  Presently, I have to manually navigate from the current topic to the next and then activate the video to begin playing... This is of course very minor, but it would still be a nice update.<p>[edit: fix spelling fail]", "by": "tpayne84"}, {"item_id": 21111148, "text": "well constructed course!  Comprehensive. Thanks for the effort, I bet you spent lots of time into it.", "by": "coderinsg"}, {"item_id": 21107406, "text": "What will me email address be used for?", "by": "slenk"}, {"item_id": 21109568, "text": "I&#x27;m more inclined towards watching videos rather than reading books or articles. It&#x27;s quick and introduces to various best practices. I started ansible with playbooks. I didn&#x27;t know about the adhoc commands until now. Nice content! Keep going.", "by": "jadia"}]