[{"item_id": 21108567, "text": "Misleading article and headline; a few celebrity researchers in high-up positions make this much. You can probably find some chemists who make $1M too if they have made it to executive positions.<p>Most AI researchers in industry make a lot of money, $200k+, but that is not so outrageous in the context of big tech companies.<p>And in fact the vast majority of AI researchers are making $20k-$30k a year, because they are graduate students.", "by": "currymj"}, {"item_id": 21108017, "text": "&gt; A third big name in the field, the roboticist Pieter Abbeel, made $425,000, though he did not join until June 2016, after taking a leave from his job as a professor at the University of California, Berkeley. Those figures all include signing bonuses.<p>425k after signing bonus is probably closer to 300-350k base + annual bonus, which feels low for someone in such a distinguished position (close to a typical specialized physician or big tech software engineer with 5-10 years of experience). After finishing my masters degree in machine learning in the mid-2000s, I immediately got job offers higher than my much more talented professors. To me, the real story is that academia has set the compensation bar low for people adding so much value.<p>Edit: to be clear I know these salaries are high and people in my field are lucky to be making so much. But I also don’t think it’s accurate that people in the field are overpaid, which titles like OP may make it seem.", "by": "rm999"}, {"item_id": 21108628, "text": "I think this article just reeks of jealousy. What is wrong with paying people doing top research a top salary? Their skills are extremely rare. And I bet executives get way more anyway.", "by": "aledalgrande"}, {"item_id": 21109153, "text": "7-figure salaries have been a thing for quite a while at Facebook, Google and definitely at hedge funds. \nRight now, you can make a half million a year or more if you&#x27;re willing to optimize the low-level code in any of the major AI frameworks.<p>If you publish a major conference paper, 7 figures is pretty easy to attain. You don&#x27;t have to be in the 0.001% just the top 5%. That&#x27;s hard work but it&#x27;s doable.<p>The only thing that&#x27;s remotely fungible in AI is python-based data scientists who can do little more than port new data to existing models open sourced on GitHub. And even then they do pretty well because of the huge demand.<p>I don&#x27;t see that changing anytime soon. I believe expecting automated systems to replace data scientists is the same level of naivete as believing we&#x27;d reach L5 autonomy in a few years in 2014.<p>Anthony Lewandowski was making 120 million dollars a year when he left Waymo. If you&#x27;re an AI expert in the valley and you&#x27;re not making at least $500k, you are one job hop away from doing so if you play your cards remotely right.", "by": "scottlegrand2"}, {"item_id": 21107634, "text": "How replicable is this thing? Looking from a monetary perspective, is it worth getting a Ph.D. in AI? Assuming you like both academic research and working in the industry, if you were to make a choice whether to do a Ph.D. or not, how would you make it?", "by": "alphagrep12345"}, {"item_id": 21109403, "text": "I don&#x27;t think OpenAI is a nonprofit as they are planning to commercially license their technologies. Ok, they limit investor returns at one-hundred times their initial investment, but I&#x27;d hardly call that a non-profit in the sense of the word.", "by": "capnprotonmail"}, {"item_id": 21110883, "text": "If you wanted to command, let&#x27;s say $5-8 megabucks per year conservatively, I would sell the idea of self-programming systems. Automating software development to not need as many humans and implement prototype systems more rapidly is a business holy grail because it could significantly reduce the need for as many developers and their relatively large salaries. It will happen eventually, it&#x27;s just a matter of time and who&#x27;s going to profit that&#x27;s the question. Furthermore, as automation intensifies over time, there will be overall fewer jobs but their salaries will continue to increase if they are related to automation and further reduction of jobs. If I were an AI researcher, I would be in self-programming systems, insist on patent assignment and consider forming a startup to deliver it as a hybrid cloud&#x2F;on-prem SaaS... this would be the most obvious path to get rich from it.", "by": "anon91831837"}, {"item_id": 21108316, "text": "[2018]", "by": "rdiddly"}, {"item_id": 21109590, "text": "This ($1m total comp) is becoming more and more common.  I know of a guy making $650k base and $400k in RSUs first year. Just a Java individual contributor, but with a reputation and buddies high up.", "by": "beamatronic"}, {"item_id": 21109938, "text": "This is a year and a half old. I wonder to what extent it has still true now that the AI hype tsunami has receded ever so slightly.", "by": "hyperbovine"}, {"item_id": 21109241, "text": "Just FYI I made $millions doing CRUD apps for enterprise. I spent most of it on accommodation and food so not as sexy as AI I guess", "by": "xchaotic"}, {"item_id": 21108842, "text": "Computer science researchers should form partnerships like lawyers and doctors. They could extract far, far more value out of mega corps than they get paid as salary employees. We are at a moment when AI tech is so black box that they could create a company that is itself a black box.", "by": "seibelj"}, {"item_id": 21108703, "text": "Please add (2018) to the title. Also, these are <i>celebrities</i>, with some of the most important contributions in the field. They are like the top 0.001% of the field or something equally ridiculous.", "by": "make3"}, {"item_id": 21109294, "text": "Is it worth putting the time into learning AI&#x2F;ML at this point? Sure, crazy high salaries- but it seems inevitable that these are the very jobs that will be automated away first.", "by": "drumttocs8"}, {"item_id": 21110899, "text": "(2018) and discussed at the time", "by": "gumby"}, {"item_id": 21109035, "text": "What sport of math is needed to learn this stuff? Is  it linear algebra and some deferential calculus mostly?", "by": "paulpauper"}, {"item_id": 21108521, "text": "Serious question, is this value justified? I don&#x27;t have any contact with AI development or AI researchers. Do they really bring that much value to the business? It makes sense that for Google, these positions would have almost unlimited clean data. But many companies are not Google.", "by": "jorblumesea"}, {"item_id": 21110124, "text": "$2 million per year is very low for people at that level if you think about the potential profits that advanced AI can bring and compare the real world utility to that of, for example, a celebrity or professional sports player.<p>They are at least talking about AGI.  If those people get anywhere close to AGI, they should start charging ten or hundred times more, because having that kind of technology could be worth hundreds of billions or more.  So even though there is no indication they are close to it, if there is even a remote possibility of getting there, the salaries are questionable in the context of those potential astronomical profits.", "by": "ilaksh"}, {"item_id": 21110037, "text": "(2018)", "by": "rsp1984"}]