[{"item_id": 21108008, "text": "Probably unpopular opinion but there is no point wasting so much effort at a career fair. The people there will be talking to hundreds of students and largely don&#x27;t care unless you are really exemplary (which the vast majority of students aren&#x27;t). In big companies, these people don&#x27;t even have any control on hiring. Your resume is going to recruiters &#x2F; HR who will apply their usual biases and heuristics on it.<p>Career fairs have two purposes: For the company it&#x27;s a way to establish &#x2F; further their brand, and for students it&#x27;s a way to get their resumes to companies and talk to employees.<p>As someone who has been to a lot of career fairs to represent my company, it&#x27;s really tedious to hear hundreds of students describe their course projects with a lot of sincerity.<p>If you are interested in chatting with an employee, please do so and I will be happy to talk about my experiences. This is the biggest value of a career fair for students, coz they can submit resumes on online portals anyway.<p>Otherwise just submit your resume and get going. This whole facade of pretending to care about the company and going on and on about having done this project and that project is very very pointless.", "by": "kinkrtyavimoodh"}, {"item_id": 21108110, "text": "Don&#x27;t take this the wrong way, but from one regular dude to another, both ~20 year old me and the current version of me emphatically do _not_ want to impress someone who seemingly has such a high opinion of themselves.<p>Like, dude. It&#x27;s a job. You have what seems like a bog standard middle class existence - just like countless others.<p>You have a blog post about how you&#x27;ve gone on a single proper holiday in your entire working career, for example.<p>It feels like you&#x27;re holding other people to a standard higher than yourself, albeit not in precisely the same categories. I&#x27;ve done it in the past too, and I&#x27;m not proud of it.<p>The Stallman bashing is also completely unnecessary and I wonder if it&#x27;s in there as a sort of unclear &quot;&lt;&#x2F;sarcasm&gt;&quot; tag.", "by": "esotericn"}, {"item_id": 21108061, "text": "This whole post really rubs me the wrong way.<p>College students don&#x27;t have this privilege, but as an experienced software engineer, if I get a vibe that someone is this judgmental and expects me to sell myself to them more than they sell the opportunity to me, I&#x27;m going to pass.<p>I also think this falls under the common pattern of posts that claim to offer general advice (&quot;wanna impress an engineer at a career fair&quot;) when they&#x27;re really only giving non-generalizable advice (&quot;how to impress ME with my particular criteria at a career fair&quot;).", "by": "ummonk"}, {"item_id": 21109024, "text": "The people who I knew who were most successful at internships and landing a job right out of college, (not a huge target school like Berkeley or MIT) didn’t waste much time with projects and stuff. Their MO was<p>1. get any internship doing software after freshman year, even if it’s at a noname place which hardly pays<p>2. every summer leverage that into an internship at a place with more name recognition and money<p>From my perspective the best way to stand out at a career fair was always to have prior internships at good places. The people who did those crappy internships after freshman year got the best internships later, then after they graduated usually either went to Google&#x2F;Facebook&#x2F;Airbnb or whatever the top startups were.<p>I don’t know what this guy is on about talking so much about confidence or whatever, I get the impression from the article the author is on some weird little power trip lording over these college students.<p>It’s my impression that the way big tech actually recruits at most colleges is to just collect a shitton of resumes, set a target number of interviews, and pick the top N resumes out of that (perhaps with certain demographic goals as well). None of this weird confidence, impress me with an elevator pitch bullshit", "by": "opportune"}, {"item_id": 21108198, "text": "The author seems very pleased to experience the power gradient of being surrounded by hungry students looking to join the club.<p>&quot;You’ve got a lot of learning to do - minimum nine months - before you even get to working with me.&quot;<p>Such an unpleasant disposition.  People who demand humility of others could use a bit of more of it.", "by": "phugoid"}, {"item_id": 21108128, "text": "“Bitchin” “make that sucker twerk” Really? I think you are mostly letting me know that I don’t want to work with your company.", "by": "sxcurry"}, {"item_id": 21108082, "text": "This is such bullshit. TL;DR: &quot;Hey - the thousands of hours and thousands of dollars you spent doing good real work and good real learning in university level classes and labs are useless and don&#x27;t demonstrate your commitment to to engineering. Show me some shitty youtube video you did on a lark and you&#x27;re in!&quot;<p>You&#x27;re also filtering out people who aren&#x27;t privileged enough to burn Mom and Dad&#x27;s money outside of class on their radio shack electrics hobbies. I can only assume that is intentional.<p>I&#x27;ll take the student who did well in class and has a life outside engineering. I&#x27;ll take that student every time.", "by": "jacobsenscott"}, {"item_id": 21108109, "text": "I think the write-up has some useful information, but it comes off as pretty patronizing.", "by": "ddavis"}, {"item_id": 21108125, "text": null, "by": null}, {"item_id": 21108290, "text": "Has anybody ever been hired via a career fair in tech? I did once but it was purely luck as the manager was interested in a specific skillset attached to a third party API. I worked with that API directly in a previous job so there was instant connection. The hiring manager told me the majority of time they get zero hits as they&#x27;re just collecting resumes and binning them.", "by": "sys_64738"}, {"item_id": 21108101, "text": "Protip: Show off software engineering, collaboration, initiative, and problem solving. Don&#x27;t worry so much about computer science as such other than the baseline expected of all graduates.<p>Exception, of course, if you&#x27;re specifically applying to a role (re)implementing bloom filters or something.", "by": "humanrebar"}, {"item_id": 21107926, "text": "<i>Body odor or halitosis are a no go. I don’t care how smart you are - I don’t want to enable future Stallmans. Though if you think you’re a future Stallman, not showering is the least of your problems.)</i><p>Is there some new trend of shitting on RMS this week?<p>I realize he might not be perfect but I don&#x27;t being disrespectful to the man who started GNU as the right thing to do.", "by": "bluedino"}, {"item_id": 21109856, "text": "This is solid advice.<p>When I was younger, I didn&#x27;t have to do anything particularly special to get job&#x2F;intern interviews at IBM Almaden, MIT Lincoln Labs or Trimble Navigation. Master your craft to an obsessional level, follow-up with any expressed interest or requests for data&#x2F;CV and show curiosity by asking good questions.", "by": "ijiiijji1"}]