[{"item_id": 21107264, "text": "&gt;tech companies in Canada pay peanuts<p>This is because:<p>- Canadians are happy to accept whatever wages they are given (the &quot;smart&quot; Canadians move to the US to get higher salaries)<p>- immigrants to Canada are happy to accept whatever wages they are given<p>With those two factors, you&#x27;re not going to make a lot of money in Toronto unless you&#x27;re working a US company (Google, Amazon, and so on) and even then it&#x27;ll be less than US counter-parts.<p>Berlin is a better choice because you can easily travel around Europe and there are more markets. It&#x27;s also a faster flight back to India if you&#x27;re visiting family.<p>&gt;However, once a Canadian citizen, there is a possiblity to get transferred to a Silicon Valley arm of a US company from Canada (using the TN visa) and hence receive a higher compensation.<p>This is what I&#x27;m talking about. The employer will dangle this prize in front of you for as long as they can and will continue to hold off on promotions and keep your salary the same for as long as possible. This is why Canadian salaries remain low, because there will be another sucker that comes along and will also be offered the same &quot;we&#x27;ll give you a promotion in a few years!&quot; or &quot;we&#x27;ll transfer you to the US soon! very very soon!&quot; line and they&#x27;ll accept it.<p>&gt;How would you compare between the two countries for building a career in tech for an immigrant?<p>Is immigration <i>required</i>? Because if not, all you need is a good internet connection, a good computer, and <i>knowledge</i> lots and lots of <i>knowledge</i> to distinguish your skills from others and get the higher freelancing rates.", "by": "omouse"}, {"item_id": 21109489, "text": "German&#x2F;Canadian here. Was born and raised in Germany to a Canadian parent. Have lived and worked in Cologne, Berlin, Mountain View, San Francisco and now Toronto.<p>Some random thoughts and musings that might not matter to you:<p>- All in all, having made the switch from a rather high paying (by German standards) job for a DAX30 company to a Silicon Valley-based US employer in Canada, my gross pay decreased but my take home increased due to significantly lower taxes in Canada. After all taxes and deductions my take home pay in Germany was about 51% of gross, in Canada it is about 67%. On the bottom line I come out about equal due to significantly higher cost of living in Canada, especially Toronto.\nMy groceries spend is factor 2.5, my rent spend is factor 4.5, internet at home is factor 2, cell phone is factor 3 compared to Germany.\nPretty much everything but clothes is much more expensive in Canada.<p>- Also the availability of things through online shops or stores is very different. In Germany we have Services such as Geizhals.de which allows you to compare prices on very specific items across hundreds of online stores. Amazon is usually not the cheapest or best option.\nIn Canada, Amazon is usually the only option. Or ordering from the US and paying duties and fees. This is especially true if you into crafty or electrical engineering things (parts and materials).<p>- As a visible minority Berlin is going to be fine (if not great!). Other parts of Germany might be less pleasant. I believe physically you&#x27;d be safer in Berlin that you&#x27;d be in Toronto due to overall significantly lower gun violence.<p>- Depending on how the US administration goes the TN visa might not be a long term option. It certainly isn&#x27;t, even today, if you plan to stay in the US long term.<p>- Banking in the US and Canada are horrible when compared to the EU. Also: The German credit score system is basically the inverse of the US&#x2F;Canadian system. Nothing on your file == good.<p>- I personally like winters. Toronto gets lots of snow, Berlin I find to be exceptionally cold and damp during winters but rarely it gets snow. I prefer snow over dampness.<p>- 24 days of paid leave is the legal minimum for a full time position at 6 days per week, 20 days if you work 5 days a week in Germany. That will vary wildly in the US and Canada.<p>And many more things I haven&#x27;t got the time right now to list. But if you&#x27;re interested I can go on.", "by": "heffer"}, {"item_id": 21107079, "text": "Berlin salaries are lower but standards of living are better and immigrating is quite straightforward, especially if you get a job offer. A blue card visa will fast track you to residency. Just make sure you start learning German ASAP, people will tell you that you don&#x27;t need it in Berlin but it will make your life outside of work so much easier if you can at least speak and read at a basic level.", "by": "jamil7"}, {"item_id": 21107377, "text": "American living in Germany here. (I also speak pretty decent German.)<p>I think it&#x27;s hard to compare two countries like this. There&#x27;s a lot more than just the objective differences--it&#x27;s easy to be miserable in an objectively &quot;better&quot; country.<p>I am absolutely miserable in Germany. I don&#x27;t have a particularly good reason to be; I just hate it. It simply disagrees with me, even though--objectively--Germany is a better place to live than many of the other countries I lived in.<p>My advice is apply for jobs in both countries. Get on-site interviews, and <i>go</i> to Toronto and Berlin. It&#x27;s important that you see for yourself, so you can really make an informed decision.<p>The bit you wrote about transferring to Silicon valley, etc seems premature to me. You don&#x27;t really know what you&#x27;ll be doing in the future: neither choice here is bad. Choose which seems the best <i>now</i>, unless you have a <i>specific, realistic goal</i> for the future that one option enables better than the other. But without that: go to both cities and just see what you like.<p>Comparing salaries is also premature: you don&#x27;t even have offers yet. It&#x27;s all just conjecture. If both cities are serious contenders for you, <i>apply</i> to jobs in both and see.<p>(Besides, German CS salaries are definitely nothing to write home about either. And many things in Germany are more expensive: cars, gas, electricity, basically all consumer goods, etc)", "by": "foopdoopfoop"}, {"item_id": 21107511, "text": "Berlin is still a great place to live, but dev salaries are low and seem to stuck at a ceiling of about €70-75K&#x2F;y gross for senior&#x2F;lead positions (there are exceptions, but even this is a hard sell to get). For a long time this was &quot;justified&quot; by the allegedly low cost of living. This is not true anymore, the city is rapidly getting more expensive (housing) and the leverage has all but vanished. Senior devs who are moving here, please smash the ceiling and ask for more (you deserve it).", "by": "haywirez"}, {"item_id": 21109114, "text": "As a Canadian – born citizen who just recently became a US permanent resident I would caution you on how “easy“ the Canada to US Route appears to be but may not actually be.<p>My permanent residency was super straightforward. My PhD is from a US institution. I have a long research career and a very long software development professional resume, and it still took three years.<p>Be aware that the TN work permit can have a serious downside: it’s so easy and simple and straightforward to get for Canadian citizens that many employers will stonewall or simply not consider going the green card route. That’s what happened to me many years ago even before the current immigration insanity, which will likely make things worse for you.<p>In general Canadians have to go to the H1 B route. It is vaguely possible to apply for a green card while under a TN work permit, but because of the way the rules are interpreted by USCIS, most immigration lawyers with experience in the matter strongly strongly strongly advise against it.", "by": "an_d_rew"}, {"item_id": 21107042, "text": "I visited Berlin a few times and it seemed like a nice place to live.<p>Don&#x27;t forget that you want to visit your family in India. I think in Germany you typically get more vacation. Also consider the flight time. Berlin is much closer to India than Toronto.<p>An interesting non-standard choice for a country to immigrate to is Japan. Tokyo is a fun place with lots of foreigners. Applying for a visa is quick and reasonable, which is the complete opposite of US.<p>I found that after you have a certain amount in your bank account, you become one of those annoying rich people who tell others that money doesn&#x27;t give you happiness and there other important things in life.", "by": "jeroh"}, {"item_id": 21108669, "text": "Have you considered London? Google, Facebook, Amazon and a lot of Big N companies have significant presence there.<p>The startup scene is great! Monzo, GoCardless, OakNorthAI etc are some startups that are doing well.<p>You&#x27;ll get PR in five years and citizenship in 6. If you are in a Big N you can ask to be transferred to the American office if you want to after 18 months.<p>There will be plenty of flights to India and if you fly via the Middle East they will be really cheap flights. As someone(Indian) who lived there for a bit, I had so many people visit me! You will find Indian food easily and will easily make friends.", "by": "break_the_bank"}, {"item_id": 21107060, "text": "Working for some time in the valley as an east coast Canadian native, I absolutely agree about peanut pay. That being said, in my experience it feels like the quality of life is still higher in Canada. In the valley, it feels around every corner there is a landlord&#x2F;private healthcare&#x2F;other event that wants to drain finances &quot;because tech worker&quot;. I returned to Canada, and despite a lower salary it feels so much more sustainable.", "by": "nickwarren"}, {"item_id": 21107121, "text": "A Canadian living in US, so take this with a grain of salt.<p>Canada is a great place to immigrate too, I would also explore Montreal, it has more of a research&#x2F;AI&#x2F;gaming scene but the cost of living is lower than Toronto. Don&#x27;t know about the salaries, I would investigate!", "by": "k3fernan"}, {"item_id": 21111070, "text": "What you said about Canada is 100% correct.<p>Peanuts for a pay + add miserable winter weather.<p>That said Canadian passport is high quality and so far TN-to-Green card is ~2yrs process. Took me 1.5 yrs.<p>Better than US passport in some aspects - especially that US passport is essentially a way for IRS to keep you tax hostage no matter where you are.<p>Can&#x27;t say about Germany - likely will be some good comments here", "by": "Trias11"}, {"item_id": 21107465, "text": "German here. Several of my colleagues are from India. As far as I know they are quite happy here. One of my former managers is from India. So You can make a career here.<p>From what I can see, salaries are diverse. It is possible make decent money even in Berlin. English is usually not a problem in Berlin. In some companies English is default. Knowing a bit of German helps of course.<p>Consider Hamburg too, salaries are better there and it is more secure.", "by": "parasight"}, {"item_id": 21107491, "text": "I share my time between Montreal and Berlin for past five years. in short: if you are searching money then the answer is definitely Toronto. It is expanding more and more, tech scene is booming and getting your permanent residency or even Canadian passport is not that hard if you are determined.<p>Berlin is a life changing city, once you are there you may see life differently. You may end up getting a small programming job then being a DJ in evenings. \nYou cannot go to Berlin with a plan, Berlin will re-planify you. \nWhile the tech scene is going up (specially during recent years because of blockchain startups) access to money and VCs are far limited. \nOn top of that although English is ok in Berlin but if don&#x27;t speak German, competing with local people is hard.", "by": "mishaker"}, {"item_id": 21107512, "text": "I grew up in Canada (Calgary), and have spent a decent chunk of time in both cities. I live in NYC now.<p>If possible, I recommend you take a trip to both cities and see what you like more. Spend a week in each, and maybe try to go to Toronto in the winter to see if you like it. Berlin has mild winters and doesn&#x27;t get much snow, but Toronto can have harsh winters. Summers in Toronto can be hot and humid, which you might be used to already (since you said you&#x27;re from India).<p>The biggest advantage to Toronto over Germany is the proximity to major US cities. Like it or not, most of the &quot;tech innovation&quot; is centred in the US.<p>Also don&#x27;t count on the TN (which is not a visa, btw) sticking around forever. If your main reason for going to Canada is border mobility, you&#x27;re probably better off staying in Europe. An EU citizen can live and work anywhere in the EU. Canada and the US have a close relationship, but NAFTA (which is where the TN comes from) could be gutted whenever the politicians decide that&#x27;s what will get them reelected.<p>All things considered, if I were in your position (knowing what I know) I&#x27;d go to Berlin. It&#x27;s more trendy, has better public transit, milder weather, and Europe has much more culture to explore and learn about than Canada (sorry).", "by": "brenden2"}, {"item_id": 21111288, "text": "You should consider Singapore as well. It is superior to Western countries in almost every dimension of social success: better education, lower crime, better GDP per capita, stabler government, better infrastructure, and better health care - all of this achieved with a much lower tax burden. It is closer to India and there are many ethnically Indian people there. It has a thriving tech sector.", "by": "d_burfoot"}, {"item_id": 21107919, "text": "I don&#x27;t know why you would use a TN visa for an internal transfer (you should use an L visa).<p>Canadian citizenship takes 4 years from landing. Although they are speeding up the citizenship process so you might be able to do it in 3.5 years. I became Canadian this year and I&#x27;ve been here for 4 years.<p>&gt; &quot;tech companies in Canada pay peanuts&quot;<p>Anecdotally better wages than anywhere in the EU I&#x27;ve found.", "by": "digianarchist"}, {"item_id": 21107226, "text": "Go to Switzerland if you can. I have no clue about taxes in Canada, but in Germany it’s not fun. As a single person household you will be heavily taxed. Be ready to give a ~half away for the state. Saving for retirement will be also taxed heavily. Or at least I wasn’t able to find good investment vehicle to save taxes. Unemployed wife plus kids could help here. Public health insurance is ok. Glases, dental problems and modern procedures you must pay by yourself. It’s not expensive: minor surgery costs 300-500€. Berlin has skyrocketing housing cost (as probably all big cities nowadays). I would not go the former Eastern Germany as a foreigner. Colleague from Philippines told lots of stories about ugly situations in Dresden. I also wouldn’t accept offer under €70k in Berlin. Of course, it’s doable with €45k, but I am not sure if it’s worth all migration effort. Fresh graduates start with €55k nowadays. In southern Germany even more. But be aware, Germany’s economy is slowing down, hiring process might take longer than couple years ago.", "by": "lnsru"}, {"item_id": 21110307, "text": null, "by": null}, {"item_id": 21109754, "text": "It&#x27;s really a no-brainer.<p>3 years on a permanent resident visa in Canada gives you the citizenship and a passport that opens up a lot of opportunities. No other country in the world comes even close to this, Germany included. Canada is also a <i>very</i> nice and comfortable country, so you may just as well end up staying despite the pay being higher elsewhere.", "by": "eps"}, {"item_id": 21107475, "text": "As a Canadian coder who lived in Toronto for 20 years, I recommend Germany hands down.<p>I love my country, but high taxes, housing bubble, stagnant salaries, horrible choices when it comes to political candidates...<p>I will say the healthcare is great, and the people are generally awesome (to a lesser degree in Toronto though).", "by": "rapind"}, {"item_id": 21107265, "text": "I&#x27;d also encourage you to consider Stockholm. The market is smaller than Berlin, and the CoL is higher, but the tech scene is extremely vibrant and lots of Swedish tech companies have good connections to the US. Also, you don&#x27;t really need to learn Swedish as everyone speaks very good English.", "by": "Pandabob"}, {"item_id": 21111431, "text": "I&#x27;m a 30M Indian, relocated to Canada about 5 years ago (when I was your age). I have Permanent Residence here but now moving back to India. The reason is absolute amount of savings and a better path to financial independence.<p>I wanted to live in a western country and command a higher salary. US was a no-go because of obvious visa issues, so went to the closest place which was Canada. I&#x27;ve been employed here for 5 years now, and definitely earned and saved a lot more than I used to back in India. But, as the years went by, I the downsides of living here started taking a toll like the brutal weather and lack of interesting opportunities. I continued traveling to India to visit family and was updated with the tech there. I now realize the job market in India has grown significantly and given the cost of living, you could effectively save the same amount at a good senior-level job position in Bangalore, Hyderabad etc. I have friends there who save more than I do in Toronto on a 200k CAD salary, with equivalent quality of life.<p>Sure, I could apply for citizenship, then go to the US on a TN but that&#x27;s not going to make things easy either. For financial independence, what matters most to me are two things: absolute amount of money I can save&#x2F;invest TODAY; and my physical health so that once I retire early I&#x27;m still in good health to do the things I want to. I could work in Silicon Valley, but if I lived a good healthy (mental and physical) life the amount of money saved will drop. I&#x27;d have to live like a miser given the CoL, something I&#x27;m not willing to do. I can live frugal but not like a miser.\nI must also mention that I&#x27;m married now and planning kids in the next year or two. The cost of childcare will significantly affect my CoL if continued in Canada. This may not apply to you now, but could in the future. One more point: most of our vacation days are spent in traveling to India visiting family and we haven&#x27;t actually had a vacation in 4 years.<p>I feel the tech scene in India is really booming and lots of interesting startups are coming up in Bangalore, Pune. Companies like Amazon are also expanding operations and hiring massively in Hyderabad while paying well.<p>I have already done the calculations and given my current offer in Hyderabad, it&#x27;ll take me about 6-7 years to retire and 10-12 years if done in Canada.", "by": "kulminate453"}, {"item_id": 21109399, "text": "In my view, using compensation only to make decisions is flawed as current compensation is a lagging indicator. 10 years from now, I am certain the compensation structure that exists today will be very very different [much like what has happened in the world of Finance and Consulting].<p>In the 1990&#x27;s and early 2000&#x27;s, everyone wanted to be an investment banker or a consultant. Its only been the last 7 years or so that the salaries in Technology sector have risen so much. Perhaps over the next decade, software development will stop paying as much (especially on the variable comp as companies phase out equity compensation ro general masses).<p>I would choose my career based on what I like to do and the quality of life I want to pursue. A lot of that comes down to the cultural integration, especially as an immigrant. What value system do you associate yourself with?", "by": "lsutigr"}, {"item_id": 21109468, "text": "Consider moving to Scandinavia. Great tech scene!\nGood vacation policies up to 6 weeks of paid vacation.\nLess hierarchical meaning you can have a bigger impact.\nGood parental leave. Good work life balance.", "by": "acd"}, {"item_id": 21107080, "text": "Generally you would need to learn German. It&#x27;s possible without, but that would not be that great in a German speaking country...", "by": "lispm"}, {"item_id": 21107444, "text": "I&#x27;m a Canadian who has lived and worked in Canada, San Francisco, Japan, and Germany.<p>Go to Germany.<p>They&#x27;re foreigner friendly, immigration is straightforward albeit bureaucracy sucks. Quality of life is head and shoulders above. Food is better. People are nicer. Employers don&#x27;t dick you around. Housing is cheap.", "by": "kstenerud"}, {"item_id": 21109348, "text": "I would say avoid germany. They claim to be open and all, so it sounds great for politics, but if you have dark skin you are pretty much “not to be trusted”.", "by": "trampoline1443"}, {"item_id": 21107127, "text": "Another possibility. Go work somewhere else in Europe at USA company. Get transferred to USA on intercompany visa.", "by": "jakozaur"}, {"item_id": 21109120, "text": "If you&#x27;re considering Canada, keep Montreal in mind.  It has substantially lower rent prices than other major cities, and still has a healthy tech sector.<p>IMO, the only downsides are that it&#x27;s substantially less multicultural than Toronto or Ottawa (which is a high bar to meet, tbh), and you&#x27;ll sometimes miss out on things if you don&#x27;t know French (though you can get by with English).", "by": "BiggieCheese"}, {"item_id": 21107139, "text": "Just moved to Berlin over a month and a half ago.\nYou don&#x27;t _need_ German, but it makes everything way easier.<p>Tech scene is smaller, of course, but there&#x27;s lots going on. I can definitely recommend living here, especially if you&#x27;re into art or music.", "by": "tuxxy"}, {"item_id": 21107307, "text": "There seems to be some disagreement in the comments about relative salaries in Berlin and Canada.  A tool I&#x27;ve been using to get a rough idea of salaries in different parts of the world is the GitLab compensation calculator: <a href=\"https:&#x2F;&#x2F;about.gitlab.com&#x2F;handbook&#x2F;people-operations&#x2F;global-compensation&#x2F;calculator&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;about.gitlab.com&#x2F;handbook&#x2F;people-operations&#x2F;global-c...</a><p>According to this, salaries for software engineers are about the same in Berlin and Toronto (about 0.55 of Silicon Valley salaries).", "by": "jbotz"}, {"item_id": 21108148, "text": "If you wanted to springboard off one Citizenship to get into the US, you could go to Australia, and then you get access to the E3 visa.<p>Though as an Australian living in Canada and running a business here, I hope you would stay and reward the country that accepts you as a PR.<p>After having lived in the UK and also seen my countries hostility towards migration, it was a breath of fresh air to see how progressive the Canadian immigration process is.", "by": "lbutler"}, {"item_id": 21106855, "text": "Cannot talk about Canada but I’m willing to speak about Berlin. How the tech scene evolved during the last 12 years and where I think it’s heading. Reach out via contact on my profile. Happy to jump on a call.", "by": "chrisked"}, {"item_id": 21107164, "text": "Salary depends on the company. Amazon and Uber are both in Toronto paying pretty well. Toronto is also Canada&#x27;s banking centre and the big banks have some roles (not all) that pay well.", "by": "mabbo"}, {"item_id": 21107720, "text": "If your goal is sv than go to Canada.  Work three years and get citizenship and start applying in sf.<p>Salaries are the same.  Huge Indian community in Toronto from all Indian provinces so that may factor in.  As someone who lives in Toronto Germany sounds like more fun.<p>No matter where you choose you&#x27;ll be fine.  But if US is the goal go to Canada.", "by": "wolco"}, {"item_id": 21107443, "text": "Canadian salaries are generally low and at the same time the major employing markets have a terrible housing crisis right now.<p>So you pay California-style cost of living without the California salary.<p>I like living here and I like my job, but I wouldnt recommend it to somebody starting out.", "by": "Pxtl"}, {"item_id": 21107928, "text": "I have lived and worked in Berlin. I am from the UK.<p>I speak, read and write semi-fluent German. This didn&#x27;t really help me in my work life, as everyone wanted to speak English, however obviously helped in everyday life. My doctor, for example, oddly, spoke no English at all. Nevertheless I am sure I could have transferred to another doctor.<p>I found it was very useful to read contracts in German. If you don&#x27;t do certain things, then things can get quite expensive. For example, if you don&#x27;t have personal liability insurance and you lose your flat key, it can cost you 1,500 euros [1]. However I wouldn&#x27;t let that discourage people. It just pays to ask for advice for colleagues on what you should be doing.<p>Public transport in Berlin is great, and you can get anywhere in the city within about 40 minutes. This is useful for socialising after work. There are a LOT of talks and conferences that happen in Berlin.<p>However as a lot of people are transitory, moving in and out of the city, I found it difficult making more longer-term relationships. I don&#x27;t think Berlin is unique in that regards, rather I think it is a trait shared by other large cities. I think it can be reinforcing: people are reluctant to invest in deep relationships as people move so often, and people move when they haven&#x27;t formed relationships.<p>At times Berlin felt a bit like living on an island, as it is far away from clusters of other major cities in Germany. Deutsche Bahn did open a new line between Berlin and Munich, however, so now you can go to Oktoberfest in 4 hours.<p>German industry is also more located in West Germany, rather than the East. However what I did see was the big companies opening up subsidiaries in Berlin. There is a positive feedback loop: there are developers in Berlin, so more companies open, which brings in more developers.<p>The climate was more extreme than England&#x27;s mild maritime climate. Very much warmer and more humid summers and a longer, colder, winter. However you also get Gluehwein and winter markets.<p>I enjoyed the experience living there. If I were to do it again, I would pay to live in a furnished apartment for my whole stay, instead of going the local route of finding an apartment, then having to furnish it (this can also be a nightmare if it doesn&#x27;t have a built-in kitchen, which a lot don&#x27;t!). This can be significantly more expensive, however. Berlin is not that cheap any more.<p>As an immigrant, I bought a furnished apartment with a 3 month let from a specialist company (who obviously charge a premium). This allowed me to get my official German papers, such as a SCHUFA check (a piece of paper that says you don&#x27;t have any debt) that allowed me to rent a &quot;real&quot; place. In the 3 months I could also get the bank account, town registration, etc. documents you also need.<p>However, as I mentioned, if I were to do it again, I would have probably just tried to pay a premium to get a furnished place, longer term. Jon Worth&#x27;s Euroblog was one of the useful things I read regarding renting a flat in Berlin [2].<p>[1] <a href=\"https:&#x2F;&#x2F;www.finanzen.de&#x2F;news&#x2F;15102&#x2F;schluessel-verloren-eine-gute-haftpflichtversicherung-zahlt\" rel=\"nofollow\">https:&#x2F;&#x2F;www.finanzen.de&#x2F;news&#x2F;15102&#x2F;schluessel-verloren-eine-...</a>\n[2] <a href=\"https:&#x2F;&#x2F;jonworth.eu&#x2F;how-to-find-a-flat-in-berlin&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jonworth.eu&#x2F;how-to-find-a-flat-in-berlin&#x2F;</a>", "by": "heurisko"}, {"item_id": 21108716, "text": "Just out of curiosity why only these two choices? Why not London for example? Just trying to understand your rationale behind your choice.", "by": "vinni2"}, {"item_id": 21107800, "text": "I’m not Indian and I’ve never lived in Canada, but I can comment on Berlin as a long-time foreign resident from the US.<p>Berlin has an <i>amazing</i> cultural scene.  If you care about things like art, music, theatre — then Berlin will never, ever bore you.  Also if you like bars!  And South-East Asian food!<p>The tech scene in Berlin is very startup-focused, and the pay is not great.  There are people who move to Berlin to make money, and there’s a lot of money to be made, but those people don’t have 9-to-5 jobs slinging code.  You will be ludicrously underpaid compared to Frankfurt, much less London, much less San Francisco — but aside from the high rents, which can be really tough and require a lot of flexibility which you hopefully have at 25, you will have a very high quality of life.<p>Berlin is also a working-class city behind the vibrant cultural scene.  If you like that, and you learn German, you can easily make friends from the “real Germany” or you can hang out with hipsters all the time if you prefer that.  Berlin has both.<p>As others have noted, immigration is very straightforward, but you do need a lawyer and (obviously) a job offer.  The path to citizenship is also straightforward.<p>Interestingly, there aren’t that many Indians in Berlin, or at least I would say I see more Indians on the street in Budapest than in Berlin, and I would probably have expected the opposite.  There’s probably an “Indian scene” in Berlin but there definitely isn’t good Indian food.  In Berlin the “Asians” are mostly from Vietnam.<p>One thing you should think seriously about if you’re looking at settling in Germany is Munich.  Munich is where the higher-paying tech jobs are.  Less startup culture, more good old fashioned German profit-making actual legitimate business culture.  Google, Apple, Microsoft — these companies have a much bigger presence in Munich than in Berlin.<p>There is still quite a bit of specialization in German cities.  Publishing? Hamburg.  Finance? Frankfurt.  Cars? Munich, or Stuttgart and environs.  Basically if you want to live a dynamic and interesting and vibrant life, and are cool with making less money, go to Berlin.  If you want more stability and professionalism go somewhere else.  And it’s really easy to travel around Germany by train, plane or automobile, so you can always start in one place and explore others.  Check out Darmstadt for example!  Amazing art museum! Very very serious tech research scene!  Minutes from Frankfurt!<p>Another thing to consider is that German employment culture revolves around stability.  There are lots of opportunities to do weird risky things, but in principle almost everybody thinks the best way to live is to have a good job, do your work, and by the time you’re 30 you have a pretty good idea what your life will be like when you retire at 67.  If that’s attractive to you, you’ll probably really love Germany.<p>And as long as you’re in Berlin or Munich or Hamburg you don’t have to eat German food! :-)<p>Finally, one thing I think German “tech” doesn’t get enough credit for: there is a lot of very serious engineering done in Germany but it’s not the “Uber for X” variety — it’s mostly based around existing, real-world technical challenges, usually involving physical machines of some kind.  If things like self-driving cars or factory automation or building a better hammer attract you more than “Social network for cats” then you’ll probably really like German engineering culture.", "by": "biztos"}, {"item_id": 21107140, "text": "interesting, that you say salaries in Berlin are higher than in Toronto. i always thought it was other way around. can someone give ballpark numbers about Berlin fulltime and contract rates?", "by": "shitgoose"}, {"item_id": 21107457, "text": "As an immigrant from India who is happily living in Toronto with no desire of going (back) to US, here are my reasons why I like it here better. My reasons have nothing to do with job opportunities. (I lived in NY for about 8 years ).<p>As a &quot;visible minority&quot;, life in Toronto and Vancouver is less stressful than it is in USA or Edmonton. Also your dating life will be better in Toronto. If you plan to have a family and kids, you don&#x27;t have to worry about school shootings -- this is now a thing parents worry about in USA. Your parents can visit you and getting a visitor visa is not a pain.<p>Of course taxes are higher and take home pay is lower than in USA and the rent is too damm high. But somehow your quality of life will be better here. People are more chill here than in USA (my experience is limited to NY&#x2F;NJ) and I will bet you already have someone you know who has relative living in Canada. So loneliness will not be an issue.<p>Also, you can start your own business as soon as you get permanent residency. in USA, a green card could take upto 12 years. In Canada , you will get it in 3 years at most. And when you start contracting as  an independent , you will make a whole lot more.<p>I have never been to Berlin but I hope to visit it one day. I have German friends and they are wonderful people.", "by": "manishsharan"}]