[{"item_id": 21101601, "text": "While the article is kind of slog in the beginning to establish its context, this struck me as especially true&#x2F;relevant:<p>“When innovative companies begin making decent profits, landlords raise the rents to adjust for the new ability to pay. As a result, these additional wages are neither reinvested, nor reflected in the disposable income of employees. This is the dynamic behind the mystery of stagnant wages. When workers in a particularly well-paid sector begin pouring into a city, landlords likewise raise the rent to absorb these incomes. It isn’t gentrification, but absorption through monopoly power.”<p>The housing affordability crisis is really a crisis of land owner cartels, especially in major urban centers. Short of some massive investment in public housing, there’s not much that can be done to course correct.", "by": "claudeganon"}, {"item_id": 21102785, "text": "&quot;&quot;&quot; But Canada is, and has always been, an oligarchy where the ruling families—the Saputos, Demarais, Reichmans, etc.—have relied on their own Brezhnevites to preserve their wealth by shielding them not just from competition, but from any kind of change.<p>The key to acquiring wealth in this country is creating bottlenecks by saturating public and private institutions with members of this class. &quot;&quot;&quot;<p>So true. The general feeling that incompetence at these big companies has no consequence.<p>The depresssing and true: &quot;&quot;&quot;This is how much a developer should make. We’re not paying a penny more.&quot;<p>Sorry to say, but tech is not valued in Canada by Canadian companies. American companies operating in Canada have a better mindset.", "by": "deskamess"}, {"item_id": 21104915, "text": "Reading this as someone who has moved from New Zealand to San Francisco, the parallels are depressing.<p>In New Zealand the price of housing has skyrocketed, and exists in a similar plane to Canada&#x27;s housing market. We have the same issues of low productivity and relatively low wages as well.<p>There&#x27;s a toxic cycle that&#x27;s created. Boomers made all of their money in housing appreciation, and heavily encourage millennials to continue the cycle (which, taking the most optimistic view of it all, makes sense). But a house doesn&#x27;t cost 2.5x your income now - it costs 8-10x. So you&#x27;re married to a mortgage (which unlike America has its interest rate fixed for &lt;5 years), have probably got a lot of your parents money invested as well (because you aren&#x27;t earning enough to come up with a $200k down payment on your own).<p>Because real estate has &#x27;proven&#x27; results, and the media make a lot of money advertising houses for sale, that&#x27;s a lot of what you get told to do. As an individual you&#x27;re so heavily indebted you can&#x27;t afford to take risks, but at the same time, companies aren&#x27;t trying to improve their productivity - because the best ROI has been in the property market. So wages suck too.<p>New Zealand is a bad place to be a young person. That&#x27;s why I don&#x27;t live there anymore. And I don&#x27;t think I&#x27;ll move back anytime soon unfortunately.", "by": "seem_2211"}, {"item_id": 21101832, "text": "<i>Landlordism in cities is (correctly) blamed for a worsening of income inequality.</i><p>While I agree that landlordism tends to increase income inequality -- especially in the form Vancouver suffers, where protests convince the city to reject the construction of new housing even when the land is already appropriately zoned and the proposed building complies with the approved local development plan -- but it&#x27;s wrong to refer to a <i>worsening</i> of income inequality.<p>Income inequality in Canada increased substantially through the 1980s and 1990s, but it peaked around 2004-2007 (depending on exactly which measure you use) and has been steadily declining since then.", "by": "cperciva"}, {"item_id": 21106100, "text": "Having lived through a Soviet inspired bureaucracy where the wait times to get a phone line was years, getting a car could take up to 5 years; this article is spot on. Eerily familiar. That same tingling of dread from decades ago washed over me haha.<p>Everything was mandated by a bureaucrat, how many factories there could be, how many goods they could produce. There was no concept of supply and demand, instead there was five year plan from the central government and that was what would be implemented regardless of the ground reality.<p>When people got a phone line installed in their house, the neighbours would come over to marvel as if visiting a new born baby.<p>When my uncle got his allotment for a scooter after two years, he distributed sweets to his co-workers. It was a great occasion.", "by": "drevil-v2"}, {"item_id": 21102217, "text": "This is pretty accurate.  Rent seeking in Canada is at an extreme, monopolies are maintained through excessive government regulation, cartels in real estate as well as many industries are definitely a thing and almost the whole country is under-employed.<p>Don&#x27;t have a ton of time ATM but we&#x27;re in dire need of deregulating a lot of industries and breaking up cartels.", "by": "Mikeb85"}, {"item_id": 21104933, "text": "Unfortunately it&#x27;s deep in the Canadian business community DNA; the family compact, the Hudson&#x27;s Bay Company, whatever... Exempted from population density, rapid growth, and revolutionary fervor of our neighbours to the south, we were a place where colonial money could just sit and go stale.<p>It was the fur industry and logging then, now it&#x27;s crappy oil from the tar sands that sells for little more than it costs to dig it up; but nobody in Calgary has the balls to admit it.<p>I have American friends who talk about Canada in glowing terms as a place without the same corruption as the US. It&#x27;s just a different kind of corruption, that this article aludes to throughout.<p>And yes, nothing ever gets done. Everything goes over budget. Not a problem confined to B.C. by any means.", "by": "cmrdporcupine"}, {"item_id": 21101907, "text": "The success of a cities and nations has always dependent on a couple of variables:\n1. Human capital (increasing size and quality)\n2. Cheap real estate (ever decreasing share of real estate costs as an input of value creation machinery)\n3. Cheap energy costs<p>In the U.S. and in most developed countries, we&#x27;ve had (1), in some cases (3) but (2) is become scarce.<p>In my opinion, there are very few modern cities that are able to provide cheap housing these days. It requires an activist government fighting two very powerful forces: existing home owners and corporate landlords. Truth is that the lobby of those interest groups are way more powerful than low income renters.<p>The other problem is that expanding the housing stock is not sufficient, governments have to provide basic services: water, public transportation access, sewage, etc.<p>Who is going to pay for them? In most cases, the cost is paid via property taxes (existing homeowners and corporate landlords)<p>The truth is that we have disincentivized the creation of new housing stock and until we fix the underlying issues of bringing more supply to the market, this issue will continue to worsen.<p><a href=\"https:&#x2F;&#x2F;www.zillow.com&#x2F;research&#x2F;new-construction-shortgage-20991&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zillow.com&#x2F;research&#x2F;new-construction-shortgage-2...</a>", "by": "todipa"}, {"item_id": 21104965, "text": "I feel like Kevin O&#x27;Leary&#x27;s boat crash (with fatality) on the Georgian Bay last month is a metaphor for the entire country&#x27;s economy:<p>Arrogant baby boomers driving around in luxury in the pitch black night, with the lights out, running into each other on the lake -- and then shirking all responsibility.", "by": "cmrdporcupine"}, {"item_id": 21105901, "text": "I am reading an interesting book now: Why nations fail <a href=\"https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Why_Nations_Fail\" rel=\"nofollow\">https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Why_Nations_Fail</a><p>The author discusses that for a country to be successful there must be institutions that encourage working hard and entrepreneurship. More, the political system should be organised in a way that stimulates creation and support of such institutions. The negative consequences for politicians supporting oligarchy must be worse than for ones who introduces changes that can improve lives of regular people.<p>My guess the problem is not in real estate speculations - it is just consequences of underlying system inefficiencies.<p>I see Canada has good educational system, right? But as they say in the article, there is not a lot of motivation and places for smart engineers to do their best.<p>There are barriers to make changes in many areas like medicine, real estate (based on the article).<p>The government seems to be in a situation where due to corruption and lobbies it does not do appropriate changes. They know what to do, but they do not find it good for them personally.\nOligarchy wants to keep their positions unchallenged.<p>It is just my guess and pure speculation, I do not know much about Canada.<p>EDIT: added more on concequences", "by": "playing_colours"}, {"item_id": 21101791, "text": "A pretty accurate but damning portrayal of the economy in Canada.  I wonder how smaller but more successful economies like Sweden or Israel manage to consistently build great companies?", "by": "kashprime"}, {"item_id": 21102039, "text": "If supply proves too difficult to increase, why not try reducing demand? Or course that would be unpopular with the infinite GDP growth folks but sooner or later will have to be confronted. Seems like the entire political spectrum supports infinite growth even if it manifests in different ways in different political parties.", "by": "Mountain_Skies"}, {"item_id": 21101811, "text": "One interesting solution to home ownership and rent seeking might be to spread the rent increase revenue around. In BC at least its common to disallow sublets. Whereas in NY its more or less allowed by law. This means as the rent goes up, land owners are the only ones who have the ability to make money.", "by": "thinkingkong"}, {"item_id": 21101774, "text": "We&#x27;re in the middle of an election right now and housing is an important issue.   However, most promises will make things worse rather than better.  For example, the Conservatives&#x27; plan to allow thirty year mortgages will do more to increase prices and indebtedness then to lower payments.", "by": "bryanlarsen"}, {"item_id": 21105913, "text": "Y&#x27;all don&#x27;t know the meaning of cartel. It&#x27;s being thrown around here like beads at mardis gras. I&#x27;m just sure I don&#x27;t want to see most of you without shirts on.<p>A cartel is an agreement between organizations&#x2F;people <i>throughout a supply chain</i>. Landowners twisting their mustaches and rubbing their hands together do not make a cartel. Rule of thumb, at least 3 steps in a supply chain. What they would be, is a trust. They&#x27;re at the same level of the supply chain working together. If you&#x27;re going to cry &quot;late stage capitalism&quot;, for fuck&#x27;s sake actually know how capitalism works and how to cheat the system properly. There are rules on how to cheat in capitalism. A 10 minute youtube video won&#x27;t do that for you or the rantings of a crazy frenchman.", "by": "corodra"}]