[{"item_id": 21109266, "text": "380s for ISP for the Raptor vacuum engine seems durn good, considering the tradeoffs between hydrogen and methane.<p>The most efficient engines we&#x27;ve flown, the RL-10 [0] (used on the Delta IV and Atlas rockets as part of the Centaur Upper Stage) and the RS-25 [1], (the Space Shuttle Main Engine) get around 450-460s for their specific impulse. These engines use liquid hydrogen and liquid oxygen. The issue with liquid hydrogen is twofold: it is not very dense, and to keep it from boiling away in liquid form, it needs to be <i>really</i> cold. So you need huge, insulated tanks to store it. Hydrogen is everywhere, but it&#x27;s kind of a pain to use as rocket fuel.<p>Merlin Vacuum [2], which is currently used on the Falcon vehicles gets 311s. The RD-0110 [3], used on the Soyuz gets 326s. These use RP-1, which is highly refined kerosene. It&#x27;s super easy to work with. On earth. Where we have 200 years of infrastructure in place to support using hydrocarbons. It takes that infrastructure to refine it into a form that rocket engines can use without gunking up the works with unburnt carbon and other particulate crap.<p>Raptor uses methane, which is kind of like a jack of all trades between density, efficiency, ease of processing, storage, and ease of use in engines. This is basically how SpaceX seems to operate: rather than optimizing a single part of the system (like trying to get the most efficient engine), they try to optimize from a systems level. I don&#x27;t really know much more than that, because there hasn&#x27;t really been a lot of stuff for civilians to read on methane engines. This is kind of the cutting edge of the second golden age of space exploration. This freaking rules, what a time to be alive.<p>[0] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;RL10\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;RL10</a><p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;RS-25\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;RS-25</a><p>[2] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Merlin_(rocket_engine_family)\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Merlin_(rocket_engine_family)</a><p>[3] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;RD-0110\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;RD-0110</a>", "by": "hoorayimhelping"}, {"item_id": 21109952, "text": "I am so amazed by the genius of making it out of steel. It&#x27;s just so completely counter intuitive but has accelerated their progress so much.<p>If they told you the stats of the material, better strength at cryo tempertures meaning mass reduction, higher melting point meaning minimal heat shielding and great thermal conductivity it would be easy to imagine it was some new super composite. Then your head explodes when they tell you it&#x27;s 2% the cost of what they were using before and it&#x27;s so easy to work with they don&#x27;t even need a factory they can just weld it in a field.<p>Imo Elon is starting to get into contention for greatest engineer of all time.", "by": "drchewbacca"}, {"item_id": 21109109, "text": "I totally understand why they&#x27;ve gone for that design but the welded together steel plates really make me think of the sort of thing Wallace and Gromit would build.", "by": "codeulike"}, {"item_id": 21111899, "text": "<i>NASA is still waiting for SpaceX to complete the Crew Dragon spacecraft that will fly astronauts to and from the International Space Station. The space agency has picked SpaceX (and another company, Boeing) to provide commercial crew flights to the station.</i><p><i>While SpaceX did launch an unpiloted Crew Dragon test flight to the space station this year, a subsequent abort system test failed, leading to the destruction of the vehicle. SpaceX aims to resume abort system tests later this year ahead of the first crewed test flight.</i><p><i>NASA Administrator Jim Bridenstine, it seems, is not happy with the years-long delays of Crew Dragon, as well as Boeing&#x27;s Starliner spacecraft, especially after seeing SpaceX build Starship Mk1 this year ahead of its own test flight.</i><p><i>&quot;I am looking forward to the SpaceX announcement tomorrow,&quot; Bridenstine wrote on Twitter Friday. &quot;In the meantime, Commercial Crew is years behind schedule. NASA expects to see the same level of enthusiasm focused on the investments of the taxpayer. It&#x27;s time to deliver.&quot;</i><p>Interesting.", "by": "nerdponx"}, {"item_id": 21109418, "text": "I suspect that Starship will fly to space before SLS ever will. I also think Starship has a significantly higher chance of flying <i>at all</i> than SLS.", "by": "philwelch"}, {"item_id": 21109176, "text": "Eventually the shell will be a single large roll of steel that is unrolled, bent into a tube with a seam going hotdog that is welded. It will be very strong, lighter than the current patchwork, and extremely beautiful. More similar to the renderings. Can’t wait.", "by": "35787"}, {"item_id": 21108959, "text": "I would love to know what the &quot;Day-in-the-life&quot; of a welder working on those ships would be.  Did they train specifically for aerospace welding? How did they land that specific gig. Must be so inspiring to wake up and work on that.", "by": "abledon"}, {"item_id": 21109421, "text": "The SpaceX&#x2F;Musk presentation video: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=sOpMrVnjYeY\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=sOpMrVnjYeY</a>", "by": "schizoidboy"}, {"item_id": 21109507, "text": "1950s Science Fiction illustrators are feeling so vindicated right now.", "by": "JulianMorrison"}, {"item_id": 21109837, "text": "I just want to point out that SpaceX has not yet successfully put a human in LEO. The moon seems well beyond their technical capabilites at the moment and Mars seems like a fools dream at this point in time.", "by": "computerex"}, {"item_id": 21109617, "text": "I&#x27;ve had to dismiss 3 popups after opening the article on mobile. This is ridiculous.", "by": "RivieraKid"}, {"item_id": 21109838, "text": "I&#x27;m surprised to hear Musk tone. He&#x27;s not that friendly usually. Maybe it&#x27;s because Tesla is a different business and its struggle got to him. Maybe it&#x27;s because his inner child dreamt of this ship for decades..", "by": "agumonkey"}, {"item_id": 21111319, "text": "I’d be interested to learn if advances in digital computing&#x2F;controlling potentially solve most of the problems that were seemingly unsolvable in the Soviet era N1 rocket failures.<p>I’m assuming the inability to control and harmonise 30 rocket engines on the N1 first stage for pitch&#x2F;yaw contributed significantly to the N1 failures and cancellation.<p>Will digital computing&#x2F;control advances control for that and the 42 rocket engines on the SpaceX starships 1st stage?<p>Or are there other major engineering problems(such as aeronautical&#x2F;mechanical) to solve as well?", "by": "chriselles"}, {"item_id": 21109322, "text": "That was a very dense an informative presentation last night, but I think the main take away is that rapid reusability is a game changer. In fact, game-changer is probably an understatement, basically every intuition and rule-of-thumb we have about space launches and travel will have to be rethought. And this will be true even of SpaceX falls well short of meeting their stated targets (2020 orbit, 150t capability, multiple refights per day, etc.<p>Musk stated (I think he just did some mental napkin math at one point) that if they meet their goals, the world&#x27;s launch capacity will be expanded by two orders of magnitude. How often does any new development in any field bring about two orders of extra capacity? How does this incredible capacity change how you use this thing?<p>First consider prices. A launch would cost fuel + support operations + amortized cost of rocket. The last two will tend towards zero as they can be increasingly automated and will be a small fixed cost. IIRC, fuel costs roughly $60-100 per kilo to LEO, a 100kg person with 100kg of supplies and life-support equipment can reasonably expect to get to LEO for $20000 in fuel costs. Ok, so you need to &quot;rent&quot; the rocket (you want to stay there at least a few days), pay operations, SpaceX margin, R&amp;D etc. Even then, imagine weekend LEO launches for $50,000 in the late 2020s. That&#x27;s astounding. Given millenials&#x27; propensity for &quot;experiences&quot;, they&#x27;re going to have hoards of people buying this.<p>But what about risk? They&#x27;ve been trying to launch Crew Dragon for many years and still haven&#x27;t. Well, with expandable rockets, you have to establish a safety record, it takes multiple flights, it&#x27;s extremely expensive, you need a new rocket for each one. With fully reusable rockets, you can literally establish a safety record for an <i>individual rocket</i> within a matter of weeks, not years. Even launching once every three days (ie, far from their daily targets), it would take only a year to do more launches than Falcon or Arienne 5 have made in decades. Also, people are far more willing to take risks than organizations like NASA. Consider a thought experiment: SpaceX does 100 launches of Starship and establishes a safety record of 99% (1 blew up). They then start selling tickets, will people still buy, fully signing away any liability? Yes, you&#x27;ll still have hoards of people lining up for a chance.<p>Finally, this is going to change science as well. Today, sending a 1 ton rover to the surface of Mars is a Really Big Deal. Hence, probes are made very carefully, very expensively and very very slowly. Not just design and build (it takes a decade), but operations as well (Curiosity traveled only 20km in the last 8 years). Everything is essentially super-low bandwidth. But once you know you can get a cheap ride to Mars (of anywhere else) any time, you don&#x27;t have to go to such extremes. You can easily send more rovers, more radio relays, they can travel further, experiment more, take more risks and if you lose one, it&#x27;s just not a big deal anymore!", "by": "martythemaniak"}, {"item_id": 21109554, "text": "Some quotes from Elon Musk in the presentation:<p>&quot;If the schedule is long it&#x27;s wrong, if it&#x27;s tight its right.&quot;<p>&quot;The best part is no part.&quot;<p>&quot;The best process is no process.&quot;<p>This really is different compared to how the space industry has done things in the past.", "by": "mlindner"}, {"item_id": 21109623, "text": "Is there a better site with fewer ads?", "by": "sbr464"}, {"item_id": 21111295, "text": "Truly this is faith in humanity boosting stuff. Great news", "by": "kfrzcode"}, {"item_id": 21108974, "text": null, "by": null}, {"item_id": 21111601, "text": "Does it have Internet connectivity?", "by": "known"}, {"item_id": 21109128, "text": "‘Tis a fine water tower or grain silo, but sure it is no starship, Boerish.", "by": "dopylitty"}, {"item_id": 21111285, "text": "It is going to be interesting to see what happens to SLS once SS&#x2F;SH starts flying. I am guessing there is going to be big public campaign for NASA to cancel SLS and go with the SpaceX craft.", "by": "woodandsteel"}, {"item_id": 21110998, "text": "How do they plan to get 100 tons of cargo from atop the starship down to the surface of Mars? Do you use a crane? I mean, cranes are heavy, right?", "by": "ryanmarsh"}]