[{"item_id": 21104878, "text": "tl;dr this is a two page description of Stephen Kell&#x27;s liballocs library [0]. Basically, it&#x27;s wasteful to install jvm, python interpreter, and electron. He&#x27;s advocating that new languages use (u)nix infrastructure (processes, files, etc) as much as possible. His library is supposed to assist with this by providing process level gc. It provides a hierarchal view such that a caller allocates objects, rather than flat memory.<p>I don&#x27;t know enough to have an opinion on this. As an alterntative view, consider listening to Cliff Click describe the challenge the jvm faced when it had a more permissive ffi [1].<p>[0] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;stephenrkell&#x2F;liballocs\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;stephenrkell&#x2F;liballocs</a><p>[1] <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=LoyBTqkSkZk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=LoyBTqkSkZk</a>", "by": "Nzen"}, {"item_id": 21104852, "text": "GitHub repository: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;stephenrkell&#x2F;liballocs\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;stephenrkell&#x2F;liballocs</a><p>I read the paper imagining a kind of COM implementation (apartments&#x2F;marshalling&#x2F;...)? But the Github readme makes it seem more like a kind of tagged malloc wrapper.", "by": "mappu"}, {"item_id": 21106528, "text": "Interesting that the author makes no mention of CLR, Microsoft’s attempt at the same thing which has been around for 20 years.", "by": "bboreham"}, {"item_id": 21107439, "text": "I&#x27;d love to see the topics of soft-realtime and lightweight threads addressed.", "by": "dcsommer"}, {"item_id": 21105018, "text": "Very interesting. Had to point the irony though<p>&gt; A key hypothesis of the liballocs design is that existing VMs may be\nretrofitted onto it at fairly modest effort, rather than being thrown\naway or substantially rewritten. A previous partial retrofitting (of\nV8) exists, but is challenging to maintain; therefore, input is sought\non alternative candidate VMs for use as retrofitting targets.", "by": "paulddraper"}, {"item_id": 21104836, "text": "I expected this to be about system virtualization, not language VMs. Interesting though, but not my area of expertise.", "by": "mroche"}]