[{"item_id": 21106820, "text": "Consuming less would definitely rescue the planet but everyone not having a 1.5 ton hunk of steel to ferry a 70kg person from robot to robot while throwing away 40% of food produced goes against our hardwiring of having more and more. instead we hold out for some unproven brilliant technical innovation to save us instead of thinking about using resources rationally.", "by": "safgasCVS"}, {"item_id": 21106800, "text": "Nuclear fission could, obviously -- I&#x27;ve yet to see anybody propose a reasonable alternative (with a known tech, not just hypothetical handwaving) to cover our enormous energy needs -- and even then some work is needed to migrate direct fossil consumption to electric. Wind and solar consumes ridiculous amount of spaces and the storage is not solved (we need it for too for other purposes, maybe not in the same form, but that does not make the problem disappear for existing usages...). Without storage, it is not a solution (it does not prevent it from becoming one in the future, but we need to start to build things <i>now</i>, while storage is being studied). Hydro is used already, and developing it to the max will not be enough. Nuclear fusion is not there yet.<p>So even with pervasive nuclear fission we would have a shitload of problem to solve, but at least that would be an immediate first step, and could be replaced <i>if</i> we eventually figure out how to replace it. We haven&#x27;t figured out that yet.", "by": "temac"}, {"item_id": 21106967, "text": "Adding another voice to the chorus of fission works, people are irrational, etc.<p>If you say to me that science proves the world is in grave danger, <i>but</i> we can’t use nuclear fission because it is “dirty” or “dangerous” (or even better, “solving one thing doesn’t matter because the real problem is our culture&#x2F;capitalism”), I will immediately stop taking you seriously.", "by": "guscost"}, {"item_id": 21106761, "text": "Successful large scale fusion energy is not enough. It must be cheap enough to replace hydrocarbons and be viable within reasonable time scale.<p>If the cost and time scale does not matter, fission is already good enough. People are just irrational and can&#x27;t compare things.  Fukushima type accident every few years would be completely acceptable and compared to coal and hydrocarbons.", "by": "nabla9"}, {"item_id": 21107019, "text": "A new theory on fusion. It&#x27;s actually a government organized strategy to keep nuclear scientists&#x2F;engineers occupied on a sisyphean task that can never be completed. If they&#x27;re hard at work on fusion, they&#x27;re not taking payments from foreign governments to work on weapons or subs. It&#x27;s pretty great because the cause is so high minded and noble that it can attract all the engineers and it&#x27;s very difficult so it attracts the brightest too (those suckers are smart). Indeed, it&#x27;s so difficult that they (the government non-proliferation people) may never have to think up a new way to keep the nuclear scientists occupied. US did something similar in the 90s after the Cold War by hiring&#x2F;importing all the Soviet scientists, after WWII by hiring&#x2F;importing German engineers. If you&#x27;re working for us, you&#x27;re not working for them.<p>At some point, maybe weapons engineers could start getting paid to just sit on their hands. Learn to make the bomb, get paid to not make it.<p>Is fusion a brain sink designed for non-proliferation? It&#x27;s a pretty effective non-proliferation tool with total US fusion research at less than $1B&#x2F;yr. Compared to a trillion dollar war or 10s of billions in monitoring etc.", "by": "hairytrog"}, {"item_id": 21106687, "text": "Yup, as much as things like magic wand, warp drive, aliens or parallel worlds colonization, they all can save us.<p>How dare people say just limiting consumption and CO2 pollution  could have any effect. Let&#x27;s just bet everything on zero.", "by": "viach"}, {"item_id": 21106849, "text": "This is great. I hope they succeed, but the climate crisis isn&#x27;t solely about emissions.<p>Yes it&#x27;s the largest most immediate threat. But we will continue to have the dust bowl, ozone crisis, emissions crisis, microplastic crisis, etc. Unless we fundamentally address our relationship to this planet.<p>There&#x27;s an incredible documentary that was way before it&#x27;s time called &quot;Who&#x27;s Counting?&quot; by Marilyn Waring. I think it addresses some of the fundamental causes of each crisis that comes up every so often. We&#x27;re not accounting for the economic value or the &quot;jobs of nature&quot;. We might not even be able to, because we really don&#x27;t fully understand it.", "by": "jefflombardjr"}, {"item_id": 21109480, "text": "&quot;Fusion will be available to all in 20 years.&quot;<p>Unfortunately, they&#x27;ve kept saying that every year since the 1950s. If it were truly possible, we&#x27;d be doing it already.", "by": "simonblack"}, {"item_id": 21106671, "text": "Another article from five days ago:<p>Nuclear energy too slow, too expensive to save climate: report<p><a href=\"https:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;us-energy-nuclearpower&#x2F;nuclear-energy-too-slow-too-expensive-to-save-climate-report-idUSKBN1W909J\" rel=\"nofollow\">https:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;us-energy-nuclearpower&#x2F;nucle...</a><p>Fusion is even further out than fission.", "by": "legulere"}, {"item_id": 21106636, "text": "Well yes that would be great, fusion is the holy grail, but it is always 50 years away.", "by": "JohnJamesRambo"}, {"item_id": 21106741, "text": "The problem is that Nuclear Fusion is always 30 years away. It was 30 years away in the 1970s and it&#x27;s still 30 years away today. Can&#x27;t rely on a solution that would probably not be available in time.", "by": "yyyk"}, {"item_id": 21106720, "text": "Fusion or not, only an abundance of incredibly cheap clean energy is going to turn back the tide on CO2 and other pollutants, and who knows what problems that may bring.", "by": "hanoz"}, {"item_id": 21109887, "text": "If it was that easy we would have built them already.", "by": "imtringued"}, {"item_id": 21106949, "text": "Fusion is cool and it would be a very nice accomplishment for mankind. But it&#x27;s kind of like going to the moon. The benefits will be offshoots of the journey rather than the journey and goal itself. Basically, if we want commercially viable and global use of fusion, someone needs to fix the problems below (talking here about D-T fusion designs and not aneutronic concepts). Not being negative, just pointing at the walls that need to be scaled.<p>1. Cost. The big problem here is that fusion does not address the main impediment of current nuclear fission. It&#x27;s going to be really expensive to build power plants that are about similarly sized to fission power plants and more complicated (ITER is $65B... other projects are in the $5B range). They will still be massive construction projects. Renewables have proven that you have to manufacture your power systems in factories to lower costs rapidly. At the end of the day, fusion is going to be construction with all its associated delays, cost overruns, and low productivity. Can&#x27;t really fix this without going much smaller and simpler, and that&#x27;s not really an option based on physical&#x2F;engineering requirements.<p>2. No current functional prototype. How long does it take from functional prototype to large-scale deployment, especially considering the massive regulatory overhaul required? eg. 50 years for aircraft? That might be fast enough.<p>3. Lots of very difficult engineering to deal with all the neutron damage and extreme temperature gradients. Million degree plasmas, 600 degree coolants, -40 degree super magnets, all within a few meters = nightmare. It&#x27;s quite a hassle, but there are lots of smart people working on this. Can probably throw more money at this.<p>4. Not safer than fission. Yes, no long lived fission products for fusion and meltdowns are more difficult. But reactor damage and tritium release are probably more likely than in fission. Fusion power plant would be a lot more complex (more parts and systems) and has lots of tritium (tritium likes to escape from where you put it and diffuses through metals) with tritium processing facility to breed and fuel the reactor. Tritium has 10 year half life and not good for you when ingested. Essentially, lots of radioactive material handling + lots of equipment to maintain  = higher chance of small accidents. See page 10 in link at bottom. Can probably throw more money at this.<p>5. Proliferation. Fusion reactors have lots of neutrons and tritium. Neutrons can be used to breed weapons material simply by placing normal uranium or thorium in the neutron flux. Tritium is used to boost nuclear weapons (just a bit of tritium drastically lowers the plutonium required). Is the only we to solve this state controlled fusion power? How can that be market competitive?<p>6. Probably only good for electrical power. While this is really just a limitation, it illustrates that fusion, should 1-5 be resolved, is not a magic bullet. You can&#x27;t do much with it other than make electrical power. The power plants are too big to use for distributed process heat or hydrogen production.<p>Lidsky&#x27;s often ignored 1984 paper: <a href=\"http:&#x2F;&#x2F;orcutt.net&#x2F;weblog&#x2F;wp-content&#x2F;uploads&#x2F;2015&#x2F;08&#x2F;The-Trouble-With-Fusion_MIT_Tech_Review_1983.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;orcutt.net&#x2F;weblog&#x2F;wp-content&#x2F;uploads&#x2F;2015&#x2F;08&#x2F;The-Trou...</a>", "by": "hairytrog"}, {"item_id": 21106661, "text": "Fusion is not necessary at all, thorium is a sufficent holy grail, currently underfunded because of humanity irrationallity.", "by": "The_rationalist"}, {"item_id": 21107150, "text": "Suspending disbelief for a moment:<p>Future perfect nuclear fusion helps us become carbon neutral. Transportation, structures, agriculture, power generation are now carbon free. Yay!<p>But it&#x27;s still not enough.<p>Carbon is now being added by &quot;natural&quot; causes, in a positive feedback loop. Thawing tundra, burning forests, ocean acidification. With the imminent threat of the ocean burping up all that the frozen methane currently stored on its floor.<p>Whatever is needed for humanity to become carbon neutral, we need much more to become carbon negative, to remove carbon faster than nature adds it.", "by": "specialist"}, {"item_id": 21106758, "text": "fission is already good enough. Let’s just adopt and build safe designs at scale", "by": "option"}, {"item_id": 21106946, "text": "The real irony is if we truly did solve Global Warming, the propaganda machine would either decide we are creating carbon emissions from something else, or go create a new global crisis to panic about.<p>IE - the words will change, but the freak out will be the same.", "by": "programminggeek"}, {"item_id": 21107034, "text": "Climate alarmists sound like apocalyptic death cult. Read the writings of the heavens gate cult and tell me its not almost 1:1.", "by": "foolzcrow"}, {"item_id": 21106638, "text": "Dream on", "by": "m4r35n357"}, {"item_id": 21106658, "text": "&quot;Climate Catastrophe&quot; is a completely normal word to use and it&#x27;s absolutely not suspicious that it&#x27;s being pushed harder than the term &quot;fake news&quot; when it was coined three years ago.<p>edit: yup that took less than 40 seconds", "by": "s9w"}, {"item_id": 21106794, "text": "Let&#x27;s just use whatever tech saved us from the climate catastrophe everyone was preaching was coming 20 years ago. Or the ones before that I heard tell of", "by": "starvingbear"}]