[{"item_id": 21108203, "text": "I&#x27;m totally a layperson on the subject but the other day I thought about how far more devices in my house use DC than AC than 30 years ago. It seems odd that I convert solar to AC then back to DC.<p>I wonder if there&#x27;s any future to running both an AC and a DC bus through the house, or if that makes no sense for reasons beyond my basic understanding.", "by": "Waterluvian"}, {"item_id": 21108488, "text": "More than 50% of the Population will live inside Mega Cities by 2050 [1]. While it is good to have Solar cheaper for Houses, the reality is most people won&#x27;t have a rooftop Solar option.<p>Edit: This is not to say 50% cheaper is useless, it is a point of information for people living in houses and not realise large population around the world cant afford a house.<p>[1] <a href=\"https:&#x2F;&#x2F;www.cnbc.com&#x2F;2018&#x2F;05&#x2F;17&#x2F;two-thirds-of-global-population-will-live-in-cities-by-2050-un-says.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cnbc.com&#x2F;2018&#x2F;05&#x2F;17&#x2F;two-thirds-of-global-populat...</a>", "by": "ksec"}, {"item_id": 21108757, "text": "Why is it so expensive to install solar in the US? In the UK you can get a 3kw grid tied system installed for under £5000 ($6100), and around double for a 9kw system - a lot of the cost is renting scaffolding and having people on site to do the work, so it gets cheaper per kw as you have more installed.", "by": "fyfy18"}, {"item_id": 21111423, "text": "Combining the roof with the solar panels seems like a win.\nA very large percentage of the cost of solar installation (50% last I checked) was labor. So when it&#x27;s time to redo the roof on a house, you can also install solar panels. The interesting question is whether the panel lifecycle is the same as the roof lifecycle.", "by": "jake_morrison"}, {"item_id": 21108438, "text": "For all the talk of AC v DC, that debate is moot.  Current on-grid solar tech integrates a spec inverter into each panel.  In a net metering install (no batteries, generators etc) this is far far simpler.  No loads to calibrate, no DC copper to run, no inverters to break, just plug the panel into the mains and see your bill drop.  That is the way forward for urban&#x2F;suburban solar power.", "by": "sandworm101"}, {"item_id": 21109942, "text": "So why are the pictures on the site clearly of retrofits of solar panels to an existing tile roof?", "by": "Animats"}, {"item_id": 21108548, "text": "Here&#x27;s a good video on the problems of transmitting power, and why we need such high voltages.<p>How do Electric Transmission Lines Work?\n<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qjY31x0m3d8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qjY31x0m3d8</a>", "by": "velox_io"}, {"item_id": 21108580, "text": "Corporate press releases get voted up to #2 on HN these days? Unfortunate.", "by": "listenallyall"}, {"item_id": 21108182, "text": "It&#x27;s very annoying when the cost of something advanced comes from very trivial legacy issues like that.<p>I wish someone develops cheap adapters while construction code gets update to help panel frames.", "by": "agumonkey"}, {"item_id": 21109317, "text": null, "by": null}, {"item_id": 21111443, "text": "Wish I saw more CNC style designed houses :(", "by": "ckdarby"}, {"item_id": 21108099, "text": "Passive solar for air and water temperatures is the way to design it into new homes. Cool in summer, warm in winter. Few to no moving parts or electricity needed. Little to ever replace. Anathema though to fancy solutions favored by VCs like photoelectric utilizing the strip-mining of millions of hectares of arable land, followed by toxic run-off, to produce panels and batteries.<p>For retrofits of existing homes, geothermal whenever possible for upgrading central climate control when present. Current professional installers though are generally incompetent and price-gouge. Sufficiently motivated hackers can easily DIY.", "by": "droithomme"}, {"item_id": 21110138, "text": "It&#x27;s always cheaper to design a feature into a product than to add it later.", "by": "stretchwithme"}]