[{"item_id": 21108263, "text": "There is one super power that is rarely mentioned: having been successful enough that only superficial knowledge and time investment is needed to leverage a workforce.<p>If you are the guy that spends 40hours per week diving deep into one specific topic because your business depends on having someone being an expert on something to that degree, you won&#x27;t be able to lead a this well rounded life.<p>If you are in a Founder position and feel this statement hurts, extract yourself atleast a day a week from being an employee of your business and think bigger.", "by": "Roritharr"}, {"item_id": 21109174, "text": "Let me guess: This guy is a Libra!<p>Seriously though, I can contribute one idea, which is to use radar or spider charts (<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Radar_chart\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Radar_chart</a>). I used to do this kind of thing, tracking 5-10 categories and trying to keep them all balanced. For feedback I would periodically assess how things were going in each category and give it a numeric rating, then plot these on a radar chart. The goal was for the resulting shape to be as close to round as possible, i.e. literally well-rounded. If the chart is bulging out in a particular area you&#x27;ve been working hard in, and lagging in another, you could theoretically take that as the signal to switch focus to the area that needs work. Also if you saved the charts over time you could compare the chart from let&#x27;s say January 2019, against the one from January 2018.<p>For me personally it ended up making itself obsolete because it made me notice in a roundabout way that I am, and want to be, one of those people who works better at one thing at a time (or at least, fewer is better). But it did force me to do some things that were beneficial that I probably wouldn&#x27;t have done otherwise.", "by": "rdiddly"}, {"item_id": 21109706, "text": "I though this was a piece about how modern society pressures us to be good at everything, and how we are optimising ourselves to death.<p>Boy, was I wrong.", "by": "angarg12"}, {"item_id": 21111233, "text": "I’ve learned that unless I’m learning new skills my mind creates issues for me. \nLearning to dance, play an instrument, draw, sing — with no desire to become close to exceptional in any of them has benefited me in ways I couldn’t imagine. \nJust 1% better every month (although I don’t track it) in a relaxed manner, over time, without investing too much time (5 minutes every few days) is enough to make life fun. In the end all these various “unrelated” skills tend to link up. \nYMMV\nI went to “elite” schools and anything less than 100% was deemed failure. So wrong.", "by": "techer"}, {"item_id": 21108858, "text": "After reading about him, I don’t have the impression that he’s particularly good at anything, rather just average.", "by": "ganitarashid"}, {"item_id": 21109570, "text": "I’ve had a feeling for a while that getting to the 80th percentile in everything I do should be my goal.<p>Imagine a person that is the 80th percentile in distance running, powerlifting, swimming, basketball and Nordic skiing.<p>That person would be the best all-around athlete you’d likely meet.<p>The opportunity cost of getting beyond the 80th percentile is so high you should spend that time getting some other skill up to the 80th.<p>That may feel like being a <i>master of none</i> but the trade off is that you’re pretty decent at everything.<p>I know enough about surfing, politics, world travel, programming and music(among other things) that I can hold a conversation with anyone even though I’m not the best at any of them.<p>This has felt like a huge advantage over people who focus on one thing at the expense of being more well rounded.", "by": "shartshooter"}, {"item_id": 21108499, "text": "An obvious PR piece on the front page?", "by": "trabant00"}, {"item_id": 21109853, "text": "&gt; NoteToSelf Mail is a little app that I have on my home screen that lets me really easily send an email<p>Oh snap, I haven&#x27;t thought the AppStore is such saturated platform, where there is specific app to send an email to myself - why FastMail or Spark won&#x27;t be enough to do that? Isn&#x27;t just two&#x2F;one less click optimization app?", "by": "piotrkubisa"}, {"item_id": 21108617, "text": "Have met Henrik a couple times -- super fascinating, very down to earth guy.<p>Interesting to get a peek at what goes on behind the curtain.", "by": "caser"}, {"item_id": 21108682, "text": "&gt; He ... has helped started business like ... Managed By Q (acquired by WeWork)<p>I’m wondering if it’s a good time to praise WeWork ties. On Managed by Q’s website (<a href=\"https:&#x2F;&#x2F;www.managedbyq.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.managedbyq.com&#x2F;</a>):<p>&gt; We Manage, We run, We design, We staff", "by": "alephnan"}, {"item_id": 21110676, "text": "Step 1: Get lucky and win the lottery.<p>Step 2: Sit in your chair.  Your cash reserves now give you access to opportunities that poor people don&#x27;t have.<p>Not a very actionable plan for the rest of us.", "by": "bsder"}, {"item_id": 21110121, "text": "this is an advertisement thinly wrapped in some vague advice", "by": "paulpauper"}, {"item_id": 21108484, "text": "using IFTTT != hacking a Google Home", "by": "hnryjmes"}, {"item_id": 21108798, "text": null, "by": null}, {"item_id": 21109940, "text": "Theres a little more philosophies to go by. I wouldnt invest too much time to incorporate something thats just superficially augmenting a layer of organization. But yes, something to meditate on if it werent used in an inflationary manner in other instances.", "by": "muzzletov"}]