[{"item_id": 21104045, "text": "I worry that tech workers may be under-informed about what a union may mean. A union can be in many ways similar to a corporation with its own power structure and demands.<p>Just 4 examples from my time in a union shop:<p><pre><code>  1) Pay raise and promotion via seniority only\n\n  2) Being warned by the shop steward that I was &quot;working too fast&quot;\n\n  3) Heavy coercion to contribute to specific political candidates\n\n  4) Going on strike for reasons I didn&#x27;t agree with\n\n</code></pre>\nMaybe a tech union would turn out better somehow. I for one would not want to go back to that situation.", "by": "pmikesell"}, {"item_id": 21102703, "text": "Pro or con of the union idea, I hope get they nailed for firing those two organizers. Firing someone and claiming poor performance makes me not want to support them anymore.  I won&#x27;t give them a cent.", "by": "wolco"}, {"item_id": 21103531, "text": "The lack of unions in the industry is making me leave. It’s going to leave out many of its current employees to dry: I want something better than the word of an entrepreneur.", "by": "SomeOtherThrow"}, {"item_id": 21104487, "text": "Open Collective is an alternative to 501(3)(c) for some orgs.<p>I wonder if an Open Collective -esque model could work for employees as an alternative to unions?<p>I applaud the benefits that early unions brought to workers, but what have they done lately(as in decades) I. Terms of creating&#x2F;capturing value?<p>My experience with unions was an an employee of Amazon.com in the 90’s and witnessing the horrible things WashTech and it’s supporters did to my staff in a failed attempt to gain access to Amazon distribution centers.<p>It would be cool if there was a very light digital network model by which employees could collectively engage with company management&#x2F;leadership.<p>As well as far less adversarial, more akin to collaborative labour&#x2F;leadership relationship as found in Germany.", "by": "chriselles"}, {"item_id": 21102913, "text": "Are there any fields similar to software development where there <i>are</i> unions? And if so how is that actually working?", "by": "thinkingkong"}, {"item_id": 21103300, "text": "It is interesting that they didn&#x27;t stop their active KickStarter campaign and pushed people to not pull their donations. It would be nice for them to walk the walk, they did create a petition in response... If I were the CEO I would feel pretty safe about moving forward with the same policies.", "by": "mimikatz"}, {"item_id": 21105292, "text": "I don&#x27;t understand:<p>Nathan: &quot;Would not voluntarily recognize a union even if the vast majority of workers signed in support of one.&quot;<p>The CEO&#x27;s statement he referenced: &quot; If a majority of the staff in an appropriate bargaining unit votes in favor of a union in an NLRB election, we will fully respect that choice and negotiate in good faith toward a collective bargaining agreement.&quot;<p>Those statements seem to be opposite of each other?", "by": "theamk"}, {"item_id": 21104853, "text": "What are the obligations of a US corporation when a vote for unionization is successful? Do all employees get opted in? Is it always required to be hiring exclusive to the union? What makes unions different (needing specialized legislation) from corporations - why can’t employees wanting to unionize just go form their own corporation and try to sell their services on their own terms that way.", "by": "throwawaysea"}, {"item_id": 21105567, "text": "On one hand you have good companies. On the other hand you have terrible companies. Same thing with unions - some of them are good and some of them are bad.", "by": "turtlecloud"}, {"item_id": 21102833, "text": "Just as I was about to back Jeri Ellsworths project :(<p>Damn you conscious!", "by": "panpanna"}, {"item_id": 21103613, "text": "The most interesting twist here is how it shows that &quot;public benefit corporation&quot; is an empty concept.", "by": "lonelappde"}, {"item_id": 21104946, "text": "I find it interesting that Kickstarter decided to go this route. It debunks the claims in the earlier HN thread [1] that the employees were fired due to performance reasons or somehow, conspiracy against Kickstarter.<p>[1] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=20972901\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=20972901</a>", "by": "fzeroracer"}, {"item_id": 21103141, "text": "When it comes down to brass tacks, after all the bluster and maneuvering, the last button to push for greedy corporations is the frickin lawyers - -  I hope the NLRB crushes them . . .", "by": "stevespang"}, {"item_id": 21102915, "text": "Current Affairs can be a fun read (Nathan Robinson, who is an extremely weird dude, writes long-long-long-form takedowns of right-wing figures). But it&#x27;s also an outlet with a very clear political perspective (&quot;workers should own the means of production&quot; would be a reasonable first approximation; &quot;Elizabeth Warren is dangerously conservative&quot; is an illustrative claim), so bear that in mind as you read.", "by": "tptacek"}, {"item_id": 21104044, "text": "Regardless of whether anyone is pro or anti union, it&#x27;s been obvious for a while now that Kickstarter isn&#x27;t arguing in good faith about this. They are going to war with their own employees. There&#x27;s just no justification for that, even if you think unions are bad.<p>Kickstarter keeps digging themselves deeper and deeper into this hole, claiming that they&#x27;re doing it because unions will alter the relationship they have with employees.<p>Even if that&#x27;s true -- you know what <i>really</i> alters the relationship you have with employees? Firing them whenever they try to exercise their rights. It&#x27;s pretty hard to believe an employer has your back when they are actively threatening you and telling you they won&#x27;t acknowledge any of the decisions you make.<p>Kickstarter&#x27;s owners and managers have proven that they&#x27;re able to build a hostile work environment just fine on their own, without anybody else&#x27;s help. I don&#x27;t see any way for them to save face at this point beyond just sitting down and saying, &quot;we were wrong, we treated you like children, and you have the right to decide how you want to negotiate with us.&quot;", "by": "danShumway"}]