[{"item_id": 21107695, "text": "I like Rich Hickey&#x27;s definitions<p>Simple (roots: sim, plex) – one fold or braid<p>Complex – braided or folded together<p>Easy – near to our capabilities<p>These are really articulate definitions that helped me as a programmer.<p>Emergent complexity from simple systems – it seems like there might be an insight here. Avdi says we can build complex systems out of simple components. He says complex systems are hard to understand. He says it&#x27;s not feasible to understand the system or predict it. So they need to be measured and observed. That&#x27;s interesting. I don&#x27;t know if it&#x27;s true that a system built out of simple components cannot be understood. How precise is the model? How many layers deep?", "by": "dustingetz"}, {"item_id": 21108056, "text": "It feels like the article ended just as it was getting warmed up towards something interesting! If any HN&#x27;ers have pointers&#x2F;links to other interesting analyses of emergent complexity among simple interacting agents, I&#x27;d love to read &#x27;em!", "by": "ssivark"}, {"item_id": 21107621, "text": "<a href=\"https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20190929151534&#x2F;https:&#x2F;&#x2F;avdi.codes&#x2F;simple-is-complex&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20190929151534&#x2F;https:&#x2F;&#x2F;avdi.code...</a>", "by": "dustingetz"}, {"item_id": 21110212, "text": "Couldn&#x27;t really take much from this article, other than I should read that book, it sounds so interesting", "by": "michannne"}, {"item_id": 21108119, "text": "Oliver de Weck from MIT has done a lot of work around complexity, including deriving definitions and measures. Turns out there is an objective measure as to how many microservices is optimal. The number comes to around 2.8  connections per component if I remember correctly. Can share the math, if anybody’s interested.", "by": "andreskytt"}, {"item_id": 21109257, "text": "TL;DR simple mechanisms can produce complex behaviours<p>My favourite example is the few simple rules of Go leading to possible extreme superhuman strategies.", "by": "karmakaze"}, {"item_id": 21107867, "text": "What was the point again?<p>Simple isn&#x27;t Complex any more than Love is War or Dark is Light.<p>System-wide interactions between any kind of components is about as difficult as it gets.", "by": "codr7"}, {"item_id": 21108205, "text": "tldr; Micro-services architecture can start out simple at first, but when there are many of them, it will become complex even more so than the monolithic approach.", "by": "jaequery"}]