[{"item_id": 21100917, "text": "Every single time the topic of surveillance or heavy-handed governance comes up, I&#x27;m surprised to see how nobody brings up the fact that it&#x27;s always one-sided:<p>They can see you, but you can&#x27;t see them.<p>This is tyranny.<p>The people in power can do anything anytime anywhere they want and you&#x27;ll never know, unless other people in power tell you about it.<p>There is an ever deepening divide in our society and eventually the people on the lower side will never be able to touch the people on the upper side, and if there&#x27;s ever a global catastrophe, we&#x27;ll be left behind to fend for ourselves.", "by": "Scapeghost"}, {"item_id": 21100959, "text": "Whenever I hear about these kinds of things I always think about when they put a gigapixel camera on a little airplane above Baltimore and flew it around all day every day. Being able to just retroactively track cars and people had such shocking power.\n<a href=\"https:&#x2F;&#x2F;www.bloomberg.com&#x2F;features&#x2F;2016-baltimore-secret-surveillance&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bloomberg.com&#x2F;features&#x2F;2016-baltimore-secret-sur...</a>", "by": "PBnFlash"}, {"item_id": 21100580, "text": "Just traveled to China and to my surprise it was more Orwellian than I anticipated. Despite all of our problems in the US, I&#x27;m still proud to live in a Democracy and a free society.<p>I took down my outdoor security camera after the trip.", "by": "29_29"}, {"item_id": 21100349, "text": "I worry that widespread camera tracking is an effective route to determining identities of otherwise anonymous online accounts. If you can work out times when people are unlikely to be posting content online (e.g. because they are seen carrying bags of shopping) you can gradually, through process of elimination, work out who is the real identity behind some online account, or at least some probability. For example, if I make some number of posts on hacker news, every person who has an &#x27;alibi&#x27; at the time of a post cannot be a candidate for the true identity of the account.", "by": "ganonm"}, {"item_id": 21100935, "text": "Looks like they copied our ARGUS system, which can be mounted on drones to cover entire cities 24&#x2F;7. <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;ARGUS-IS\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;ARGUS-IS</a><p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=QGxNyaXfJsA\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=QGxNyaXfJsA</a>", "by": "cronix"}, {"item_id": 21100241, "text": "I argue that if the US doesn’t keep up with this technology then a lot of towns are going to buy this kind of tech. What if somebody told the police that they can identify problematic people (for any convenient definition of problem) during a protest, even if they came from out of town?", "by": "threatofrain"}, {"item_id": 21100913, "text": "My colleague and I had a discussion about the world going down the drain.He argued that it was never as bad as it is now. I disagreed with him,as I think people had so many &#x27;we had enough&#x27; moments since the beginning of the humanity,that I see no reason why 5,10,15 or maybe after 40 years someone in China or the USA will say &#x27;Screw this&#x27; and it will eventually snowball into another revolution,which will take all these CCTV cameras and social profiling to hell.", "by": "cosmodisk"}, {"item_id": 21106283, "text": "“500 megapixel, 5 times the resolution of human eyes”: wrong. The resolution of human eyes is around 576 megapixels.\n<a href=\"https:&#x2F;&#x2F;curiosity.com&#x2F;topics&#x2F;how-many-megapixels-is-the-human-eye-curiosity&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;curiosity.com&#x2F;topics&#x2F;how-many-megapixels-is-the-huma...</a>", "by": "sinuhe69"}, {"item_id": 21100440, "text": "There are many uses for the technology that don&#x27;t violate civil rights.  We can finally catch dangerous or intoxicated drivers on highways who cause accidents.   Just because the tech is Chinese doesn&#x27;t automatically disqualify it from serious consideration.", "by": "kashprime"}, {"item_id": 21100940, "text": "Please correct the title to:<p>&quot;China&#x27;s super camera can pinpoint a specific individual among thousands of people&quot;", "by": "bobongo"}, {"item_id": 21100517, "text": "That&#x27;s super impressive considering they all look alike", "by": "mrtweetyhack"}, {"item_id": 21100155, "text": "Gotta love communism.", "by": "nkkollaw"}, {"item_id": 21100220, "text": "So aside from the 1984 aspects of this, I have some ideas on how this could be put to good use, specifically in ecosystem management.<p>Mount this to a drone and have it fly over a forest or a farm.<p>Have it count the insect population, say number of bees. Or insects in total.<p>Have it identify the number of a certain type of crop, tree, plant or whatever.<p>Connect it to (I don’t know the term for it) where it can determine the health of the plant or tree. Have it fly over wild areas and count the population of elk, deer, cattle, whatever.<p>Teach it to identify and map out potholes in roads automatically<p>Things of this nature.<p>Fuck facial targets in a stadium.", "by": "samstave"}, {"item_id": 21100217, "text": "I am so frustrated about how HN is now full of whataboutism on the China issues.", "by": "RavlaAlvar"}]