[{"item_id": 21107977, "text": "Headline is waaaay overblown, but not all of it is total hyperbole -- checkout out arxiv and try to read the abstract from just about any paper.<p>It&#x27;s basically totally impermeable. I&#x27;m almost done with an undergraduate degree in math and basically have no idea what ~90% of the research is about at anything other than a topical level. This is fine, it&#x27;s written for specialists in the field (hopefully), but damn, for most fields, it&#x27;s not a whole lot of people.<p>Compared to physics or chemistry, math gets very specialized, very quickly. Depending on the field, there&#x27;s no easy real world isomorphisms either, making it even more difficult.", "by": "Hasz"}, {"item_id": 21107976, "text": "Sounds like a sales pitch for Lean (Microsoft&#x27;s theorem prover), even though Coq [1] is the standard tool for the  UniMath [2] project.<p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Coq\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Coq</a><p>[2] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;UniMath&#x2F;UniMath\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;UniMath&#x2F;UniMath</a>", "by": "ukj"}, {"item_id": 21108133, "text": "&quot;I believe that no human, alive or dead, knows all the details of the proof of Fermat’s Last Theorem. But the community accept the proof nonetheless,&quot; Buzzard wrote in a slide presentation[...]<p>That s 100% clickbait. People knows the demonstration and the demonstration helped to create entire new fields. By the way there are new and shorter proof of the theorem.", "by": "Ceezy"}, {"item_id": 21108064, "text": "This short pdf which the article cites is more useful than anything the article itself contains:<p><a href=\"http:&#x2F;&#x2F;wwwf.imperial.ac.uk&#x2F;~buzzard&#x2F;one_off_lectures&#x2F;msr.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;wwwf.imperial.ac.uk&#x2F;~buzzard&#x2F;one_off_lectures&#x2F;msr.pdf</a>", "by": "colorincorrect"}, {"item_id": 21108286, "text": "Summary:  Motherboard interviewed an attendee at the Interactive Theorem Proving conference who says that he thinks Interactive Theorem Proving is important.  Also, professors specializing in proof theory think their tooling may become important but &quot;the technology still needs improvement&quot;.", "by": "raymondh"}, {"item_id": 21108200, "text": "I&#x27;m currently working on the formalization of Catalan&#x27;s conjecture (or Mihăilescu&#x27;s theorem) in Isabelle&#x2F;HOL&#x2F;Isar.<p>My personal impression is that more formal verification is necessary in math, and it should be tought to every student of Mathematics in introductionary courses because it gives an unforgiving but also rewarding learning experience with formal proofs.<p>Feel free to ask questions.", "by": "madez"}, {"item_id": 21108208, "text": "Suggestion to rely on AI for proof verification is just laughable. Neuron weights instead of formal definitions. So reliable.", "by": "higherkinded"}, {"item_id": 21109537, "text": "The headline is certainly overblown, but there probably errors out there.  The interesting question is where we should be looking for them.  All of the major results in an undergraduate or introductory graduate textbook have been studied often and thoroughly enough that we can be reasonably confident there are no errors in their proofs.  There are errors in very new or very obscure material, but those tend to get corrected as more people start paying attention to them.  It therefore seems like the search should therefore be concentrated in recent results that are becoming more useful but still aren&#x27;t standard.<p>On the other hand, we do need to build a standard library of results that can be used to prove those newer results.  You can&#x27;t do much in analysis without basic results on metric spaces, for instance.", "by": "joker3"}, {"item_id": 21107959, "text": "There is a big grey area between &quot;not 100% correct&quot; and &quot;wrong and harmful&quot;. Like a faulty computer program that produces correct results in 99.999% of the cases a wrong mathematical statement can still yield useful results in practice. You just don&#x27;t want to run into those pesky edge cases where it indeed is wrong.<p>Having a database of all mathematical proofs where all of them are checked for validity, however, is a very useful tool to actually find those edge cases where a proof is wrong and give future mathematicians a solid foundation.<p>Using AI as an extension of human capabilities is a given to me. Like with heavy machinery, we don&#x27;t want to do the heavy lifting. We want to steer it properly to gain most benefit.", "by": "std_throwaway"}, {"item_id": 21107948, "text": "Soo... Unit testing &#x2F; CI for math proofs? If it can be done in software, great.", "by": "MrBuddyCasino"}, {"item_id": 21108335, "text": "I had these fears about my dissertation work, but then realized that the “elder’s” papers were highly cited because they contained important machinery which could be modified and refined to prove other results... or the paper contained an important idea which went on to be proved in a variety of ways. Maybe it’s different outside of PDEs, but I doubt it.", "by": "dls2016"}, {"item_id": 21108219, "text": "I just can&#x27;t help feeling that either the true should be correct, or the wrong should be false. But I guess English is not a strongly typed language.", "by": "bryanrasmussen"}, {"item_id": 21108081, "text": "This just seems like a native advertisement for Lean...", "by": "iamaelephant"}, {"item_id": 21108019, "text": "I’m sure this will help proofing papers. There will still be the problem of proofing that the software proofs what it is intended to proof.", "by": "lysium"}, {"item_id": 21108452, "text": "To mathematicians,<p>Welcome to our world!<p><a href=\"https:&#x2F;&#x2F;xenaproject.wordpress.com&#x2F;2019&#x2F;09&#x2F;27&#x2F;does-anyone-know-a-proof-of-fermats-last-theorem&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;xenaproject.wordpress.com&#x2F;2019&#x2F;09&#x2F;27&#x2F;does-anyone-kno...</a><p><i>Actually working through some of [the details], when formalising them, made me understand that some of these issues were far bigger and more complex than I had realised.</i><p><i>In the perfectoid project there is still an issue regarding the topology on an adic space, which I had assumed would be all over within about a page or two of pdf, but whose actual proof goes on for much longer</i><p>Yeah, that&#x27;s how software developers feel, all day, every day. That&#x27;s why we all moan about being asked to give estimates for things. You don&#x27;t really <i>understand</i> a thing until you&#x27;ve formalised it in code, and often things that look simple and easy turn out to be unexpectedly deep.<p>Mathematics is a field that&#x27;s been doing the equivalent of writing pseudo-code for thousands of years. There are endless reams of pseudo-code that <i>looks</i> like it might work, but as any programmer who&#x27;s ever written pseudo-code knows, whether it actually runs when you try it out for real is anyone&#x27;s guess.<p>So now mathematics is starting to experience the pain of multiple incompatible programming languages&#x2F;ecosystems. There&#x27;s Lean, Coq, Isabelle&#x2F;HOL and some new JetBrains language too. Soon they&#x27;ll start to discover the value of &#x27;foreign language interop&#x27;, rigorous code review, comments, style guides, design documents, package management, automatic optimisation etc.<p>Have you ever looked at a proof written in one of these languages? All code in these languages is a hot mess judged by the standards of professional software developers: tons of abbreviations, single letter variables, uncommented, ad-hoc module structure etc. I&#x27;m sure we&#x27;ll eventually see mathematicians having raging flamewars about what clean style is and tabs vs spaces.<p>Luckily for mathematicians though they work at their own pace and are under no deadline pressure. They&#x27;ll figure it out.", "by": "repolfx"}, {"item_id": 21107907, "text": "Vice really does a disservice to the author. &quot;All&quot; math is not wrong, but I sure wish theorem provers were the preferred method of formalizing mathematics. But theorem provers really aren&#x27;t quite ready for prime time either. But it sure feels like a lot of verification of mathematics is somewhat repetitive.<p>I think that programming&#x2F;CS is to mathematics what neolithic revolution was to human culture. It allows for specialization in the stack. People can obsessively optimize different parts of the stack to everyones benefit.", "by": "adamnemecek"}, {"item_id": 21107916, "text": "Headline is of course absurd hyperbole that does not belong here.<p>&gt; &quot;I think there is a non-zero chance that some of our great castles are built on sand,&quot; Buzzard wrote in a slide presentation. &quot;But I think it&#x27;s small.&quot;", "by": "gowld"}, {"item_id": 21108022, "text": "Extreme clickbait headline. The subheading is &#x27;&quot;I think there is a non-zero chance that some of our great castles are built on sand,&quot; he said, arguing that we must begin to rely on AI to verify proofs.&#x27;", "by": "ummonk"}, {"item_id": 21107991, "text": "Anyone interested in this topic, I have a prediction that the time is right for a new math, that starts from just 1 and 0, and builds every symbol up in a rigorous way.<p>We&#x27;re working on the infrastructure to make such a thing easier, but the project does not currently have a leader: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;treenotation&#x2F;jtree&#x2F;issues&#x2F;83\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;treenotation&#x2F;jtree&#x2F;issues&#x2F;83</a>", "by": "breck"}]