[{"item_id": 21109333, "text": "An interesting footnote: the proposal Grumman beat to win the DARPA contract that led to the X-29 came from General Dynamics, who were pitching a forward-swept wing variant of their ubiquitous F-16 called the F-16 SFW.<p><a href=\"http:&#x2F;&#x2F;www.f-16.net&#x2F;f-16_versions_article26.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.f-16.net&#x2F;f-16_versions_article26.html</a><p>GD really wrung as much mileage out of the F-16 airframe as they possibly could, coming up with all sorts of weird proposed spinoffs from it. They bid on the fighter-bomber contract that was eventually won by the F-15E Strike Eagle, for instance, with a delta-winged F-16 they called the F-16XL (<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;General_Dynamics_F-16XL\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;General_Dynamics_F-16XL</a>), and they attempted to jam thrust-vectoring into the platform with the F-16 VISTA (<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;General_Dynamics_F-16_VISTA\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;General_Dynamics_F-16_VISTA</a>).", "by": "smacktoward"}, {"item_id": 21107923, "text": "Is this really called an &quot;inverted wing&quot;, I&#x27;ve always heard such configurations referred to as &quot;forward swept wings&quot;.<p>For reference, see the Russian Su-47.<p><a href=\"https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Sukhoi_Su-47\" rel=\"nofollow\">https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Sukhoi_Su-47</a><p><a href=\"https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Forward-swept_wing\" rel=\"nofollow\">https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Forward-swept_wing</a>", "by": "jaytaylor"}, {"item_id": 21108516, "text": "The Real Engineering show has a really great and detailed video on these types of inverted wing designs:<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=RN6vGxyMcVU\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=RN6vGxyMcVU</a><p>It has a lot more detail about the aerodynamics and advantages than this article. It&#x27;s worth the watch if you&#x27;re interested.", "by": "djsumdog"}, {"item_id": 21108294, "text": "An interesting fact about this aircraft is that as the wings are positioned behind the center of gravity of the plane they typically induce the plane to pitch down. This is in contrast to a more normal layout that will typically pitch up.<p>On the conventional layout this means that the horizontal stabilisers at the back need to produce a downwards&#x2F;negative lift to stabilise the plane.<p>The X-29 has canards at the front that have to produce positive lift to balance the plane. This means it&#x27;s actually more efficient as both surfaces are producing useful lift and avoiding the penalty of the negative lift of traditional horizontal stabilisers.<p>This is of course more complex in practice, with the CoG not being in a fixed position and careful positioning of wings to reduce the pitch-up tendency.", "by": "agurk"}, {"item_id": 21108987, "text": "&quot;But its highly experimental design made it the most aerodynamically unstable aircraft ever built.&quot;<p>I&#x27;m not sure if that&#x27;s true. The F117 was aerodynamically unstable in all three axes due to its design prioritizing stealth over all else, needed constant corrections by the fly-by-wire system, and it first flew in 1981.", "by": "mysterydip"}, {"item_id": 21111097, "text": "The technically-minded will enjoy Prof. Bill Mason&#x27;s inside detail regarding his time as one of the principal aerodynamicists on the X-29: <a href=\"http:&#x2F;&#x2F;www.dept.aoe.vt.edu&#x2F;~mason&#x2F;Mason_f&#x2F;AnX-29StoryV3.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dept.aoe.vt.edu&#x2F;~mason&#x2F;Mason_f&#x2F;AnX-29StoryV3.pdf</a><p>Also, NASA&#x27;s e-book on the program is far more useful than these superficial enthusiast articles: <a href=\"https:&#x2F;&#x2F;www.nasa.gov&#x2F;connect&#x2F;ebooks&#x2F;sweeping_forward_detail.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nasa.gov&#x2F;connect&#x2F;ebooks&#x2F;sweeping_forward_detail....</a><p>For anyone wondering, one of the main reasons forward-swept wings never became commonplace, the configuration is at odds with low radar observability.<p>Dr. Norris Krone, the principal DARPA instigator behind the program, recently passed away: <a href=\"https:&#x2F;&#x2F;aero.umd.edu&#x2F;news&#x2F;story&#x2F;distinguished-umd-alumnus-and-faculty-member-dr-norris-j-krone-jr-passes-at-88\" rel=\"nofollow\">https:&#x2F;&#x2F;aero.umd.edu&#x2F;news&#x2F;story&#x2F;distinguished-umd-alumnus-an...</a><p>Some other nitpicks:<p>- The article indicates thrust-vectoring obviated the need for FSW, but you&#x27;ll note no thrust-vectoring on western jets outside of the F-22 and experimental aircraft.<p>- They make a big deal about the degree of instability, but talk about that with respect to longitudinal static stability, not dynamic stability or stability about other axes.<p>- Both TACIT BLUE and HAVE BLUE were quite unstable as well, and HAVE BLUE, unstable in all three axes, flew well before the X-29.<p>I&#x27;m not going to go find numbers, just pointing out the article sounds very hyperbolic.  Artificial stability requires vastly less computational power than the breathless words tend to imply.  We should be more impressed with control systems theorists, and flight control design has come a long way since then.", "by": "V_Terranova_Jr"}, {"item_id": 21110640, "text": "I suppose it is literally true that the X-29 is &quot;an impossible fighter jet&quot;, in that it was never put into production and fitted with weaponry.<p>The phrase &quot;inverted wing&quot; is more troubling, because of the potential for confusion with actual wing design terminology: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Gull_wing#Inverted_gull_wing\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Gull_wing#Inverted_gull_wing</a><p>Perhaps this link could be migrated to style.ycombinator.com?", "by": "mcarmichael"}, {"item_id": 21109933, "text": "Looked up an interesting photo from the article: Dryden “Research Aircraft Fleet on Ramp, X-15, F-18, SR-71, X-31, X-29” \nlink: <a href=\"https:&#x2F;&#x2F;www.dfrc.nasa.gov&#x2F;Gallery&#x2F;Photo&#x2F;Fleet&#x2F;HTML&#x2F;EC93-41012-3.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dfrc.nasa.gov&#x2F;Gallery&#x2F;Photo&#x2F;Fleet&#x2F;HTML&#x2F;EC93-4101...</a>", "by": "NKosmatos"}, {"item_id": 21109044, "text": "<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=34de_aDKnQ8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=34de_aDKnQ8</a>", "by": "dvh"}, {"item_id": 21108496, "text": "Maybe I&#x27;m missing it, but does the article actually say what the benefits of this are?", "by": "GordonS"}, {"item_id": 21108073, "text": "I had a GI Joe toy based on this in the 1980s.  What&#x27;s the point of bringing this up now other than if it&#x27;s not in the Internet it didn&#x27;t exist at all?  Again, this is 1980s aerospace tech that didn&#x27;t really go anywhere.", "by": "turk73"}]