[{"item_id": 21108722, "text": "The English description on that page doesn’t make it easy to understand what this key does.<p><i>”Its name comes from the fact that it has two key blades (the part which activates the bolt) at each end of the key, rather than the usual single blade”</i><p>How does that lead to the name “Berlin key” or either of the German names? I would guess “Berlin key” comes from the fact that it predominantly is used in Berlin.<p><i>”After unlocking the lock, the key must be pushed all the way through the lock and retrieved on the other side of the door after it has been closed and locked again”</i><p>I think the main features are:<p>- the key cannot be removed when the lock is open.<p>- you can remove the key from the other side of the door from which it was inserted.<p>It seems you can lock the door from the side it was unlocked from, and remove the key from that side, too. You only have to push it all the way through if you want the door closed and locked with you and the key on the other side of the door.<p>I also think you can close the lock and remove your key when the door is open.", "by": "Someone"}, {"item_id": 21108439, "text": "Video showing how it is used, really neat!<p><a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;UW4jZLEgaiU\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;UW4jZLEgaiU</a>", "by": "cryptozeus"}, {"item_id": 21108585, "text": "I&#x27;m surprised some houses still use this. As it&#x27;s impossible to leave the building without a key in case of a fire.<p>I suspect it may even be illegal today.", "by": "odiroot"}, {"item_id": 21108238, "text": "This is super clever, but I bet some of its potential applications conflict with egress safety requirements&#x2F;laws.<p>(If a door is part of an exit route, you probably can&#x27;t require a key to open it.)", "by": "adrianmonk"}, {"item_id": 21108792, "text": "<a href=\"http:&#x2F;&#x2F;www.bruno-latour.fr&#x2F;sites&#x2F;default&#x2F;files&#x2F;P-36-Berliner-KEY-GBpdf.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bruno-latour.fr&#x2F;sites&#x2F;default&#x2F;files&#x2F;P-36-Berliner...</a><p>This is the original technical document on this key.", "by": "aloknnikhil"}, {"item_id": 21110086, "text": "On a side note, what is the rationale behind the fact that there are doors that can be locked without a key? The horror stories of having the door slammed and getting trapped while outside are so common. If a key was necessary no matter what to lock a door, this wouldn&#x27;t happen and people wouldn&#x27;t have to spend a kidney calling a locksmith in the middle of the night.", "by": "bigbaguette"}, {"item_id": 21109776, "text": "I suppose this is now superseded by modern locks, but this is a great example of solving a problem with technology that would otherwise be left up to human behavior. You could ask people to please make sure to lock the door, but there would always be people who would forget, or just not care enough to bother.", "by": "mordechai9000"}, {"item_id": 21109571, "text": "I&#x27;ve actually came across this key in an apartment building in Berlin once, so they really are still in use. The person living there did complain about it though, as (at least in the evening) you had to collect guests from the main gate and escort them back there when they leave, since using the key was the only way to open it. Understandably this is quite annoying when you&#x27;re living at the fourth floor.", "by": "niklasd"}, {"item_id": 21108241, "text": "&quot;Also, locking an open door is usually not possible.&quot;<p>A good feature to have on otherwise normal doors so that they only ways to lock it is to be inside or outside with the key. I now have a greater appreciation for deadbolts.", "by": "karmakaze"}, {"item_id": 21108043, "text": "Discovered via tweet: <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;historyned&#x2F;status&#x2F;1178272006334242819?s=21\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;historyned&#x2F;status&#x2F;1178272006334242819?s=...</a><p>Seems like an elegant, physical embodiment of resource acquisition, state management, and release. Albeit uncomfortable in your pocket.<p>Comparisons to C++ std:: on some of these counts may be valid.", "by": "woozyolliew"}, {"item_id": 21111170, "text": "<i>The mechanism makes it impossible to forget to lock the door, without also forgetting the key in the lock. Also, locking an open door is usually not possible.</i>", "by": "sebastianconcpt"}, {"item_id": 21109922, "text": "So Aldi shopping carts and Berlin keys are isomorphic.<p>You stick your token in, you gain access to a facility, and then to get your token back, you must restore the facility to its proper state. Additionally, in both cases, the facility you&#x27;re unlocking happens to involve physically moving an object around.", "by": "adrianmonk"}, {"item_id": 21108790, "text": "What is the closest crypto analog to this kind of key?", "by": "pletnes"}, {"item_id": 21108770, "text": "Is there a technical analogue to this?", "by": "Vaslo"}, {"item_id": 21109552, "text": "Any sociologists want to summarize the Latour essay?", "by": "viburnum"}, {"item_id": 21108990, "text": "My house in Berlin, the Corbusierhaus[1][2], used to have this type of key for the front (car) gate.<p>The gate was usually open, and then couldn&#x27;t be locked with the key.  If the gate was closed, it could only be left again in the closed state.<p>The house is next to the Olympic Stadium, so the gates are closed when there&#x27;s a football game, concert or other event.<p>[1] <a href=\"http:&#x2F;&#x2F;www.corbusierhaus-berlin.de\" rel=\"nofollow\">http:&#x2F;&#x2F;www.corbusierhaus-berlin.de</a><p>[2] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Unité_d&#x27;Habitation_of_Berlin\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Unité_d&#x27;Habitation_of_Berlin</a>", "by": "mpweiher"}, {"item_id": 21110644, "text": "<i>LockPickingLawyer has entered the chat</i>", "by": "anon91831837"}, {"item_id": 21108270, "text": "<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Mengenlehreuhr\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Mengenlehreuhr</a>", "by": "7373737373"}]