[{"item_id": 21111481, "text": "I had an idea for a minimal change to improve a Reddit-like site, perhaps you will find it interesting: split the concept of &quot;subreddit&quot; into &quot;tags&quot; and &quot;communities&quot;.<p>Tags: much of the content of Reddit is people reposting the same thing at various times to various subreddits, and many of the comments are people noticing that it fits into &quot;r&#x2F;whatever&quot; instead. The default behavior should be that posts of the same link to various tags (r&#x2F;awww, r&#x2F;catsstandingup) should not recreate a new post but just backlink to the same post. Repeat posts to the same tag should be a no-operation. This removes the community aspect of tags, and some of the worst emergent behaviors of reddit along with it. Treating a tag as both a topic and a community leads to a neverending cycle of people creating niche topic tags for the community aspect, but then finding themselves &quot;invaded&quot; as people will always want to find and comment on content about topics that they disagree with.<p>But of course the community aspect of Reddit leads to good things. So you make a separate concept of communities. These communities could follow the posts of one or more tags, applying filters to those of their own choosing, and make their discussion visible within community borders only or visible to all, based on their own choices (in addition to internal community posts.) They can control admission to the communities on their own rules (fully public, invite codes only, etc.) The ability to automatically follow the posts of certain tags (and either view or not view public comments) will keep small communities from getting stale for lack of posts.", "by": "comnetxr"}, {"item_id": 21110903, "text": "How will you avoid-<p>&gt; John Gabriel&#x27;s Greater Internet Fuckwad Theory was proposed in the Penny Arcade (web comic) on March 19, 2004 by Mike Krahulik and Jerry Holkins. It says that when a normal person is allowed anonymity and an audience, they lose social inhibitions and act inappropriately.<p>If anything, the last decade has taught us the immutability of this law.  Usernames and comment history seem to help somewhat with people acting accountable for their actions.  Total anonymity seems to always lead to a  cesspool like 4chan.", "by": "JohnJamesRambo"}, {"item_id": 21110598, "text": "I think this &quot;reddit-with-4chan-features&quot; approach is more viable than 8chan&#x27;s &quot;4chan-with-reddit-features&quot; approach, since I don&#x27;t think the imageboard model is very compatible with the &quot;community-run boards&quot; feature. It&#x27;s also a good thing that (it appears that) this website is &quot;fresh&quot; and apolitical rather than coming forth from a political rift in another community (e.g. 8chan, gab, voat).<p>I&#x27;ll definitely be following this website with interest; I&#x27;m a huge fan of sites that allow anonymous posting as well as how Reddit can create active communities around very niche topics (which is a lot harder on e.g. 4chan).<p>EDIT: I do have some problems with this rule: &quot;Nothing that violates US law, or anything that would be considered &#x27;gray area&#x27;.&quot; What is a &#x27;gray area&#x27; is, itself, a gray area. I don&#x27;t think the rule itself needs changing, but it would be good if it was supported by some examples of things that people might want to do but you won&#x27;t allow.<p>EDIT2: Another issue: in a lot of fonts, Ieddit (with capital i) looks very similar to leddit (with lowercase L), which is a derogatory term for Reddit on 4chan (and possibly elsewhere) (owing to the shitty rageface memes which use the word &quot;le&quot;)", "by": "Smithalicious"}, {"item_id": 21110881, "text": "I am of the opinion this should represent subs as &#x2F;i&#x2F;all, instead of with &#x2F;r&#x2F;", "by": "Aeolun"}, {"item_id": 21110945, "text": "&gt; Anonymous &#x2F;r&#x2F;beastiality 6h<p>&gt; Dogs knotting women (www.com)<p>Really, who expected anything else?", "by": "iikoolpp"}, {"item_id": 21111866, "text": "How are you going to prevent your reddit clone website being overrun with lowest-common-denominator content? i.e. how you will maintain quality long-term, after the initial rush of novelty wears off.", "by": "FrozenVoid"}, {"item_id": 21110902, "text": "Based upon the first few posts, this probably isn&#x27;t a great idea.", "by": "siquick"}, {"item_id": 21110977, "text": "Three clicks in and I see a picture of a dog fucking a woman.", "by": "burnout41"}, {"item_id": 21110950, "text": "I like the idea of anonymous posting and at the same time on Reddit I&#x27;ve found challenges with brand new accounts with agendas showing up en mass with little regard for the local community and just wanting to push their agenda.<p>It&#x27;s a rough thing to allow anonymous comments and also foster a community online.", "by": "duxup"}, {"item_id": 21110458, "text": "<a href=\"https:&#x2F;&#x2F;github.com&#x2F;cc-d&#x2F;ieddit\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;cc-d&#x2F;ieddit</a>", "by": "timemachine"}, {"item_id": 21111678, "text": "yes hello site&#x27;s creator here<p>there were a ton of technical issues earlier that are now &#x27;mostly&#x27; fixed<p>in terms of the nsfw content, the index page is basically &#x2F;r&#x2F;all without nsfw. marking something as nsfw in a sfw sub hides the thumbnail.<p>this was posted here while i was sleeping... i went to bed thinking nobody had noticed my previous post and wasn&#x27;t being attentive. the original post i made to Show Hn was 15 hours ago...  I&#x27;m guessing a mod &#x27;refreshed&#x27; this?", "by": "cc-d"}, {"item_id": 21110995, "text": "The name &#x27;ieddit&#x27; is way too close to &#x27;reddit&#x27; and should be changed to avoid trademark issues.", "by": "Figs"}, {"item_id": 21110755, "text": "I like mastodon&#x27;s way of marking &quot;sensitive&quot; content, which will hide text or pictures until you explicitly click to open them.", "by": "nurettin"}, {"item_id": 21110926, "text": "I actually think these are compelling features:<p>* Fully Transparent Mod&#x2F;Admin Action Logs &lt;- This is evidenced by the fact that on reddit mod drama sparks up every so often<p>* Anonymous Posting Option &lt;- The fact that people make throwaways indicates that they desire anonymity sometimes<p>My next question though is what stops reddit from implementing them?", "by": "chillacy"}, {"item_id": 21111085, "text": "Looks like this is getting a lot of HN hug of death.<p>Let the username landgrab begin. Apparently they are called SubEddits instead of Subreddits? Not much in the way of r&#x2F;android or similar but time will tell if this lasts or vanishes. Seems nice enough so far.", "by": "Multicomp"}, {"item_id": 21110854, "text": "Almost every single action signs me out. Creating a sub gives back an &#x27;invalid&#x27; error message&#x27;, which then signs me out.<p>Have clicked on less than 10 links and have already been exposed to bestiality images. This post in question has been up for half an hour, where is the moderation?", "by": "Rotdhizon"}, {"item_id": 21110234, "text": "I would be willing to pay up to 10 usd per month to be able to create an account and run my news feed under my domain name.", "by": "rodolphoarruda"}, {"item_id": 21111074, "text": "Patreon’s URL for reporting community guidelines violations is here:<p><a href=\"https:&#x2F;&#x2F;support.patreon.com&#x2F;hc&#x2F;en-us&#x2F;requests&#x2F;new\" rel=\"nofollow\">https:&#x2F;&#x2F;support.patreon.com&#x2F;hc&#x2F;en-us&#x2F;requests&#x2F;new</a><p>Those guidelines are here for anyone who is curious:<p><a href=\"https:&#x2F;&#x2F;www.patreon.com&#x2F;policy&#x2F;guidelines\" rel=\"nofollow\">https:&#x2F;&#x2F;www.patreon.com&#x2F;policy&#x2F;guidelines</a>", "by": "floatingatoll"}, {"item_id": 21110264, "text": "I’m getting the error:<p>&gt; Too Many Requests: 60 per 1 minute<p>I visited the site twice...<p>It looks interesting, but I am curious what are the implications. I.e. how does everyone’s interactions change.<p>Also seems kinda weird I have to login to be honest...", "by": "lettergram"}, {"item_id": 21110534, "text": "Have you thought about making the data distributed and p2p? that way it&#x27;s more resilient. Reddit at one stage was also minimalist and open source", "by": "pippy"}, {"item_id": 21110887, "text": "The name is very similar to lemmy with this font. Lemmy being the federated alternative to Reddit&#x2F;HN: <a href=\"https:&#x2F;&#x2F;dev.lemmy.ml\" rel=\"nofollow\">https:&#x2F;&#x2F;dev.lemmy.ml</a>", "by": "StudentStuff"}, {"item_id": 21110525, "text": "I like the idea of having a website like reddit, similar functionality without the bloat.<p>The new reddit design is horrible.<p>The design on the site could be a little closer to this site perhaps.", "by": "Mirrorforce"}, {"item_id": 21111720, "text": "For chan", "by": "HNLurker2"}, {"item_id": 21111652, "text": "How do you make sure that anonymity is not abused?", "by": "known"}, {"item_id": 21111643, "text": "Nice", "by": "aks579"}, {"item_id": 21110789, "text": "I read as &quot;Leddit&quot;", "by": "acomagu"}, {"item_id": 21110480, "text": "comments links are not working.", "by": "blondin"}, {"item_id": 21110885, "text": "Is the site dead already?", "by": "radicalriddler"}, {"item_id": 21110393, "text": "ieddit sounds quite close to idiot. You might want to change that (unless it was intended)", "by": "topmonk"}, {"item_id": 21110411, "text": "Hasn&#x27;t the past 20 years shown that anonymous posts and comments are a perfect breeding ground for trolls?", "by": "jonathankoren"}, {"item_id": 21110522, "text": "I haven&#x27;t used Reddit in a very long time, but does it not allow anonymous posts and comments any more?  My account, at least, isn&#x27;t tied to my real name or identity in any way, IIRC.<p>Anyway, I&#x27;m not sure anonymity is a great feature.  The lack of accountability is a good part of the reason why Reddit became such a cesspool.", "by": "jlarocco"}, {"item_id": 21110541, "text": "Would be nice to have it written in Go, to be truly minimalist and for easy local deployment.", "by": "xvilka"}]