[{"item_id": 21102837, "text": "As a parent who has two kids who have ClassDojo, I can say that ClassDojo supports points for any teacher defined criteria. I this case I believe it was a teacher-defined point system, not the default app settings.<p>So while it’s all good to discuss gamification and the dark side of these things, it’s not  the apps designer that decided to negatively reinforce bathroom breaks, but their app did allow the teacher to set that up.<p>What other user defined settings and unintended dark patterns are out there?", "by": "kevinconroy"}, {"item_id": 21103208, "text": "My son hated ClassDojo. Everything was about points, and he saw through the charade enough to see that it didn&#x27;t really matter, and it was way overused in his classroom.<p>I won&#x27;t do it, but I was tempted to make a TeacherDojo spoof where students in a class could award their teacher points for teaching well, and take away points when their teacher fell into bad teaching habits.", "by": "japhyr"}, {"item_id": 21102759, "text": "I have to admit that I instantly recoil at any system that tracks what a child does and potentially penalizes them with such granularity. I suppose it&#x27;s not <i>that</i> far removed from getting a gold star for behaving well...but pair that with technology, and an officious school board, and I can easily envision a kind of perverse social-credit system for students, following them for their entire scholastic careers.", "by": "lordleft"}, {"item_id": 21103136, "text": "It&#x27;s curious that &quot;restroom during class&quot; is the only concrete, non-arbitrary event in that log.<p>&quot;Not following instructions&quot;, &quot;off task&quot;, &quot;teamwork&quot; and &quot;great day&quot; could mean many different things, in different contexts.<p>&quot;Teamwork&quot; could mean playing nicely along with a colleague who is bullying others out of teacher&#x27;s view.<p>&quot;Not following instructions&quot; is whatever an authority wants to be.<p>&quot;Off task&quot; could mean that you&#x27;re not succesfully juggling forcing yourself not to get a bathroom break while concentrating on a task.<p>(I may not sound like it, but I appreciate teachers and I wish they didn&#x27;t need an app to justify their actions to hovering parents.)", "by": "dictum"}, {"item_id": 21104983, "text": "A relative of mine is socially awkward and was often bullied. He became a teacher recently and was bragging to me that he doesn&#x27;t allow his elementary school students bathroom breaks. Parents get upset but he doesn&#x27;t care. After years of being bullied through school now he&#x27;s finally in power in a school situation and is determined to use it. I&#x27;m now wondering how common this situation is.", "by": "ngngngng"}, {"item_id": 21102891, "text": "&gt; Her teachers add and subtract behavioral points in an app shared with her mom.<p>Honestly, this is <i>way</i> too much information. Why does a parent need to know the details of every minor issue in class?", "by": "saagarjha"}, {"item_id": 21103163, "text": "If we don&#x27;t want a social credit system for ourselves, why would we implement one for our children? Here&#x27;s why this terrifies me:<p>I was a sensitive kid getting bullied at one point and had a horrid 2nd grade teacher. Reflecting on her behavior as an adult, it was apparent that I was just a problem for her in her last year before retirement (there was a &quot;Miss So-and-so is retiring&quot; party we had to have as a class for her at the end of the year).<p>The bullying was bad enough that she would just remove me from the class and have me work alone in the library because I&#x27;m certain that it was easier than the alternative. This happened probably 30+ times until one day I broke down and started to cry because it was just a rough day, and I just felt very alone.<p>Librarians noticed, teacher notified, yelled at by the teacher privately for &quot;being a disturbance&quot;, I then told my parents, Dad got insanely angry at the situation (rightfully so), and we met with the principal. I remember sitting outside of the office listening to my father destroy the guy verbally. I cried then too.<p>After the fact I didn&#x27;t have to go to the library alone anymore, but she literally wouldn&#x27;t respond verbally to me at times. I remember not being called on when I had the answer, being the only kid with a hand up. She just ignored me unless she absolutely HAD to respond (IMO abusive behavior towards a child). My grades went down and I was pulled from the gifted programs never to get back in. All of this happened within one school year.<p>I am horrified of what a teacher like that would have done to me with this tool.", "by": "folkhack"}, {"item_id": 21103394, "text": "This is a teacher defined penalty, not a ClassDojo defined penalty.<p>ClassDojo&#x27;s main use case is to <i>reward</i> behavior that&#x27;s usually difficult to reward, like &quot;Sally played well with others today!&quot; It encourages the small things.<p>This is an interesting use case of the platform by the teacher, and I suspect the outcome will simply be the teacher won&#x27;t use this penalty anymore.", "by": "stevebmark"}, {"item_id": 21102749, "text": "What is the benefit of ClassDojo? Instead of simply making notes about students in a notebook, teachers use ClassDojo so that... what? Parents and students can be notified in real time of how many POINTS they got? How is that at all beneficial, let alone beneficial enough to justify inserting a private, for-profit company between students and teachers.", "by": "deogeo"}, {"item_id": 21103106, "text": "I assume the idea isn&#x27;t &quot;don&#x27;t go to the bathroom&quot; so much as &quot;please use the bathroom <i>before</i> class starts.&quot; That isn&#x27;t such an unreasonable ask if classes are relatively short.<p>Adding that to a computerized point system is what makes it seem creepy...", "by": "Wowfunhappy"}, {"item_id": 21102777, "text": "I hope it&#x27;s something the parents can opt out of", "by": "sundayedition"}, {"item_id": 21106183, "text": "In the future, totalitarianism will be gamified.", "by": "_0ffh"}, {"item_id": 21103960, "text": "Just a few comments down, one teacher says she uses the app and doesn&#x27;t penalize for bathroom breaks. It sounds like blame lies with the teach and not the app necessarily.<p>Better title:<p>&quot;Teacher penalizes sutudent for bathroom break using &quot;ClassDojo&quot; App.&quot;", "by": "thekevan"}, {"item_id": 21103037, "text": "Would the 5th grader get or lose points if he were to have an &quot;accident&quot; in class?", "by": "fortran77"}, {"item_id": 21108459, "text": "My son’s school uses this. He came home from his first day of class, started carrying around a book like a clipboard and taking away points from my wife and I whenever we moved or spoke. So there you go, gamification through the eyes of an innocent child. Considering the percentage of my family that was wiped out fighting Hitler, this Nazi stuff really bugs me. It starts with gamification, turns into social credit, work camps are next.", "by": "zxcvbn4038"}, {"item_id": 21102853, "text": "In addition to the qualms about whether this sort of point system represents a movement toward a &quot;social-credit&quot; system, I have another question:<p>What the hell does this have to do with education?<p>I have no problem with gamefication or apps like ClassDojo, but I have to say: the teacher opting to track bathroom breaks (and even apply a penalty by dint of them) comes as no surprise to me given the bizarre norms of educational institutions.  It is in the shadow of these bizarre norms that we need to consider the appropriateness of scoring systems and interfaces.<p>I have never understood what things like hall passes, the pledge of allegiance, and double-file-by-sex lines at doors and cafeterias have to do with learning and nurturing.<p>They seem unambiguously oppositional.<p>A 5th grader (typically a 10 or 11-year old) is absolutely old enough to understand when they need to use the bathroom, walk there by themselves, and return to their classroom, picking up context clues from a capable teacher to plug back into the material without feeling (or being) left out.<p>Heck, many 4 year olds are capable of this.<p>What is the point of education if the culture of its institutions is insistent on treating students as though they are incapable of coherent thought in the first place?", "by": "jMyles"}, {"item_id": 21106355, "text": "ClassDojo and related dystopian apps are really terrible for morale and have an antieducational result. If your kid&#x27;s school wasn&#x27;t enough of a prison camp indoctrinating them with propaganda wait until you see the results after the Dojo marketers get all the teachers mesmerized and on board with tracking every tiny thing and sending alerts constantly to parents about the most minor and always irrelevant issue. Obsession with microdata that has nothing to do with the actual academics or intellectual understanding of concepts allows teachers to ignore academics and turn everything into a operant conditioning experiment. Alert dings replace bells.<p>If your school district mandates Dojo, move districts or homeschool. If it&#x27;s optional, meet with them and make sure they understand they are not under any circumstances to use it on your child and you deny consent. It is abusive software and its use should be banned by law if we want to have good schools and an educated populace in decent mental health. Constant nagging over minor issues destroys psychological well being. Imagine living with a partner who used such an app, or working for a boss. Anyone would agree that would be an abusive situation. Now why would you subject your children to such a thing.", "by": "droithomme"}, {"item_id": 21104939, "text": "Seriously? Duh. If you don&#x27;t teach your kids that they need to plan ahead and take responsibility for themselves, they never will. And if you haven&#x27;t taught your kids, your teacher is gonna have to - especially if it means a disruption to every other student in class.", "by": "zonidjan"}]