[{"item_id": 21111471, "text": "Not just Facebook, but any targeted advertising platform that can target based on demographic could do this.<p>Its not the first example of unethical behaviour using this technology. Alcohol gets targeted to Alcholics, Gambling gets targets to problem gamblers.<p>Targeted advertising for certain purposes should be illegal, including employment ads, alcohol ads, gambing ads and any kind of political ad. There&#x27;s just too many ways it can go wrong with these kinds of ads.", "by": "aussieguy1234"}, {"item_id": 21111986, "text": "&gt; Not just Facebook, but any targeted advertising platform that can target based on demographic could do this.<p>I&#x27;d like to point out that specifically you can NOT do this on Facebook any more, or at least not if Facebook find it out. They make you mark your ads as being job posts, and remove demographic targeting from that.<p>The headline here is irritating, because the headline being shown is two years old. The headline should be the second half of it, which is:<p>&quot;After two years the Federal Government confirms demographic advertising of jobs is illegal&quot;", "by": "peteretep"}, {"item_id": 21110233, "text": "I have mixed feelings about this. I am absolutely aware this can be a means to intentionally exclude specific groups due to prejudice and can be a polite way to do terrible things. I get that.<p>But the reality is that the modern world seems to seriously suck at figuring out how to help people find the right kind of job for themselves or help employers find the right people for the job. I keep thinking &quot;Surely, there must be a better way than what we are doing currently.&quot;<p>Maybe if we worked on solving that issue we would see less of this issue. Like if it is a job for writing HTML and you write HTML, there are ways to find you based on that and it won&#x27;t matter what your gender or age is.", "by": "DoreenMichele"}, {"item_id": 21110779, "text": "The simple question is: Does everyone have an equal opportunity to this position or not? If you can&#x27;t even see the ads then the answer is no, and so it&#x27;s a violation.<p>If there were different ads for different groups but everyone still had the opportunity to see, apply and acquire the position then it&#x27;s fair game.<p>Perhaps Facebook could improve job ads to allow for more specific targeting but always have a fallback ad in that campaign for any non-targeted users. This would help employers without excluding anyone.", "by": "manigandham"}, {"item_id": 21111385, "text": "From the comments below on testing one’s experience, I don’t think that there is a way to actually test one’s soft skill experience, and if they are the right candidate for the job, other than leveraging the networking aspect for recommending a candidate for a job.<p>One important requirement for a senior executive job these days is their Soft Skills. If you can find a way to measure that, well you have solved a major issue.", "by": "slics"}, {"item_id": 21112065, "text": "Why would employers not target women?", "by": "robk"}, {"item_id": 21110243, "text": "A linked article has examples.<p><a href=\"https:&#x2F;&#x2F;www.propublica.org&#x2F;article&#x2F;facebook-advertising-discrimination-housing-race-sex-national-origin\" rel=\"nofollow\">https:&#x2F;&#x2F;www.propublica.org&#x2F;article&#x2F;facebook-advertising-disc...</a><p>Here&#x27;s one: <a href=\"https:&#x2F;&#x2F;assets.propublica.org&#x2F;images&#x2F;articles&#x2F;20171121-facebook-judaism.jpg\" rel=\"nofollow\">https:&#x2F;&#x2F;assets.propublica.org&#x2F;images&#x2F;articles&#x2F;20171121-faceb...</a>", "by": "mcguire"}, {"item_id": 21110837, "text": "Could these legal arguments be extended to lookalike audiences that are built off of email lists that have a gender imbalance? That is, imagine I go to a university to recruit, and I talk with 200 male students and 10 female students. I then take their email addresses and make a lookalike audience to advertise my jobs to. Could that be challenged on the grounds that I am trying to advertise to male students? What if I don&#x27;t know what goes into the algorithm of creating lookalike audiences — for example, how important gender is versus interests.", "by": "gnicholas"}, {"item_id": 21110076, "text": "So does this mean that targeted ads are now considered discrimination?", "by": "tdurden"}, {"item_id": 21111965, "text": "I understand the reason some people are upset with this, but one issue I find interesting is that this is exactly how &#x27;fair&#x27; advertising works, but implicitly.<p>For instance if I advertise a position in, as some random example, Popular Mechanics, I&#x27;m going to get an <i>extremely</i> biased sample. And I&#x27;m putting my position there specifically because I want to appeal to that demographic. This is also why, for instance, in times past if you stayed at home and watched broadcast television there would be a disproportionate number of ads for things such as tampons, diapers (adult and child alike), and job injury lawyers. It was targeting the demographic watching television at that time.<p>Perhaps one fair solution here would be an opt-in demographic profile override. What a mouth full. What I mean is that if you want, you can require Facebook to set your demographics to whatever you like. In other words, imagine you&#x27;re a woman and you want to be shown ads targeting men, well you can opt-in to require your account profile to be a hit for man or woman.<p>The curious thing is that I imagine almost nobody would actually choose to opt-in there. It&#x27;d probably be more used as a protest tool to destroy the value of advertising (by large numbers of people opting into everything), than a tool to get more ads you&#x27;re interested in. Can&#x27;t say I&#x27;m particularly upset by that outcome though.", "by": "rjf72"}, {"item_id": 21110302, "text": "Nothing good can come from sticking my neck out on this, but:<p>If I were paying for advertising for a software engineering position I&#x27;d get much better ROI by excluding women and older demographics simply because they&#x27;re much less likely to be suitable for the job, statistically speaking, when we&#x27;re talking about the wider population in general and not just software engineers. Not because they&#x27;re less capable, but because there&#x27;s less of them as a percentage of the population. I shouldn&#x27;t have the government mandating that I can&#x27;t tune my advertising campaign for ROI, which is basically the only point of running one if the first place.<p>However, on the other side of the coin that&#x27;s pretty unfair because clearly there are good software engineers in those demographics and I&#x27;d be excluding them to save money.<p>I think both alternatives suck in different ways, but as a business I&#x27;d probably choose ROI over fair. It&#x27;s all pretty hypothetical though, because Facebook ads are probably one of the worst ways I can think of to find candidates.", "by": "eloff"}, {"item_id": 21110753, "text": "Posting a job on social media -- and not dedicated job sites -- is already reducing the number of people likely to see the listing. A lot of people don&#x27;t use social media.<p>I did a digital marketing course and have met a few digital marketers. When asked if they use social media themselves, most if not all answer &quot;oh GOD no.&quot;", "by": "foobar1962"}, {"item_id": 21110437, "text": "I see ProPublica is rehashing everyone&#x27;s articles as their own these days.<p>Didn&#x27;t Gizmodo prove this and various other abuses a few years back?", "by": "ga-vu"}, {"item_id": 21111075, "text": "When I was younger (unmarried and no kids), I could work 11 hours in the office as a software developer. And that translate to 55 hours a week minimum. But now I just work 9.5 hours a day. I would love to work 8 hours, but based on my experience you really need to work as much as you can get so you can have a “good” daily stand-up report. I wish I could have a better work and life balance … but when you are a software engineer, you can&#x27;t turn off your programming brain. The problem will be in your mind even if you leave the office, sadly", "by": "WomanCanCode"}, {"item_id": 21110542, "text": null, "by": null}, {"item_id": 21110632, "text": "The dirty secret of hiring is that employers are always thinking about cost, but how many employees out there think of themselves as a cost to a bottom line? Not many.<p>The most exploitable tech workers are young, single, males on H1-b visas. They will take a low salary and essentially be enslaved to their job because getting fired means getting kicked out of the country.<p>Old workers and women are more “expensive” because they use more healthcare than young single males. We must totally disconnect employers from healthcare once and for all.<p>We must also reform the H1-b system and stop employers from having so much leverage over vulnerable employees due to their visa status.<p>Point is, it’s not as if employers think young men are superior talents to women or older workers, it’s that they are by far the cheapest and most exploitable. We need to remove these incentives (or disincentives) that distort the hiring process and allow these discriminatory behaviors to bubble up in the first place.", "by": "undefined3840"}, {"item_id": 21111770, "text": null, "by": null}, {"item_id": 21110002, "text": "Wow, I didn&#x27;t expect to see CapitalOne or Edward Jones on that list.  I kind of figured it would be a bunch of smaller companies that were either ignorant of the law or, more likely, used to playing fast and loose without consequences.", "by": "x0x0"}, {"item_id": 21111059, "text": "Facebook studies every details of its users lives, so why on Earth is targeting job are by gender  an effective choice? Is all that other behavioral data useless for targeting? Is personalized advertising a fraudulent industry?", "by": "lonelappde"}, {"item_id": 21110923, "text": "this doesnt seem like a bad thing imo - tech has always favors young applicants", "by": "dlphn___xyz"}, {"item_id": 21110072, "text": "it&#x27;s called ad targeting. If the govt. wants to pay for those low converting clicks&#x2F;impressions, then i&#x27;m sure they, these employers, will be glad to serve ads to everyone.", "by": "paulpauper"}, {"item_id": 21110144, "text": "This is huge, but in a way perhaps not obvious.  I am trying to define a thing called a programmable company - it&#x27;s where all the actions a company can make are scripted &#x2F; scriptable - and weirdly it&#x27;s what the law assumes exists right now - that a company has a controlling mind.<p>I am trying to say that automation  and governance belong hand in hand.", "by": "lifeisstillgood"}]