[{"item_id": 21102805, "text": "For context, the 737 NG is previous iteration of the 737 (before the MAX) and among the most popular aircraft ever built, with over 7000 in service.  Grounding this would absolutely cripple the airline industry.<p>However, the NG also has an excellent safety record, and 35000 cycles is equivalent to 5 flights (takeoff &amp; landing) every day for 10 years. So while this may lead to extra checks on older aircraft, it&#x27;s highly unlikely to cause a MAX-style global grounding.", "by": "9nGQluzmnq3M"}, {"item_id": 21102845, "text": "There is a 9 year old documentary on two Boing whistleblowers describing cracking probability on the 737ng. It&#x27;s an hour long:\n<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=IaWdEtANi-0\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=IaWdEtANi-0</a>", "by": "hansthehorse"}, {"item_id": 21105106, "text": "Unsurprising given the 2010 Al Jazeera revelations of the Boeing-Ducommun conspiracy and cover-up: critical structural elements that were supposed to be CNC machined by Ducommun were crudely made by hand and Boeing managers ordered them installed into 737 NG (-600, -700, -800, -900) anyhow. And then when a blue-ribbon panel of Boeing employees went to find out what happened, their findings were buried and no corrective action was taken. 737 NG&#x27;s are flying around with substandard critical structural components like spars and the areas around doors, leading to several fuselage breakups on hard landings and runway overruns, which has killed at least several passengers to date. In past similar incidents, aircraft fuselages survived intact. There&#x27;s a very real possibility that one or more 737 NG&#x27;s may breakup in heavy turbulence, hard landings and runway overruns at any time, and Boeing knows about it, but has done nothing to remedy it.<p><a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;IaWdEtANi-0\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;IaWdEtANi-0</a>", "by": "anon91831837"}, {"item_id": 21102820, "text": "I’m not flying anymore. Between the GHG annual personal emissions and the stunning staggering massively deadly failures of rushed Boeing product launches. Finally I will note the whole damn process is dehumanizing and terrible.", "by": "kjar"}, {"item_id": 21105714, "text": "For those curious about how this part looks,\n Boeing Pickle Fork graphic illustration:<p><a href=\"https:&#x2F;&#x2F;www.pprune.org&#x2F;rumours-news&#x2F;625886-737ngs-have-cracked-pickle-forks-after-finding-several-jets.html#post10581606\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pprune.org&#x2F;rumours-news&#x2F;625886-737ngs-have-crack...</a>", "by": "v8engine"}, {"item_id": 21102677, "text": "&gt; Engineers design pickle forks to last the lifetime of the plane, more than 90,000 landings and takeoffs, a term known as &quot;flight cycles&quot; in the aviation industry, without developing cracks.<p>That number made me do a double take.\nSeems planes never stay on the ground for very long.", "by": "alan5"}, {"item_id": 21102807, "text": "A lot of text providing very little information.", "by": "tobib"}, {"item_id": 21102961, "text": "If a part&#x27;s made of aluminum and undergoes cyclic stress, even staying within its instantaneous modulus of elasticity, it <i>will</i> eventually crack.<p>Note the aluminum curve in the graph here [0], it <i>never</i> levels off horizontally.<p>My understanding is this effectively means the modulus of elasticity for aluminum parts is forever diminishing.  Aluminum is a metal that&#x27;s &quot;work hardened&quot;, it&#x27;s basically becoming increasingly brittle the more cyclic stress it experiences.<p>I&#x27;d been told in the past that commercial planes are regularly X-rayed for cracks as part of their maintenance, because of their extensive use of aluminum.<p>None of this should be a surprise except that it&#x27;s supposedly &quot;unexpected&quot; in the pickle fork.  These vehicles have always been high maintenance machines, in order for them to be safe all the structural aluminum must be regularly inspected for cracks, the cracks should be expected and parts replaced as needed.<p>[0] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Fatigue_limit\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Fatigue_limit</a><p>Edit:<p>Out of curiosity I did some digging for photos of this part and more information, this thread delivers some insightful links and citations:<p><a href=\"https:&#x2F;&#x2F;www.pprune.org&#x2F;rumours-news&#x2F;625886-737ngs-have-cracked-pickle-forks-after-finding-several-jets.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pprune.org&#x2F;rumours-news&#x2F;625886-737ngs-have-crack...</a>", "by": "newnewpdro"}, {"item_id": 21102947, "text": null, "by": null}, {"item_id": 21105922, "text": "&lt;A ‘pickle fork’ is the part that connects the fuselage with wings to manage stress and torque loading on the structure&gt;<p>See link for pictures of design<p><a href=\"http:&#x2F;&#x2F;newsinflight.com&#x2F;2019&#x2F;09&#x2F;28&#x2F;boeing-workers-found-new-cracks-on-boeing-737ng-not-max&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;newsinflight.com&#x2F;2019&#x2F;09&#x2F;28&#x2F;boeing-workers-found-new-...</a>", "by": "basicplus2"}, {"item_id": 21106197, "text": "Zero mention as to where the part was manufactured...<p>I was surprised to find that a lot of information is found online. However, there&#x27;s no specific mention of &quot;pickle fork&quot; here: <a href=\"http:&#x2F;&#x2F;www.airframer.com&#x2F;aircraft_detail.html?model=B737#Airframe%20Assemblies\" rel=\"nofollow\">http:&#x2F;&#x2F;www.airframer.com&#x2F;aircraft_detail.html?model=B737#Air...</a><p>I&#x27;m not an engineer, but it looks like Magellan Aerospace Kitchener (ON, Canada) built Wing Components and Spirit Aerosystems (Wichita, Kansas, USA) built Wing Spars and the Front Fuselage. Could have been either one of those.<p>My guess is it&#x27;s Spirit as it&#x27;s mentioned in the notes they build 75% of the airframe in total.", "by": "TestPilot"}, {"item_id": 21103404, "text": "Stick a pickle fork in Boeing; it is cooked.", "by": "nutcracker46"}, {"item_id": 21103015, "text": "&gt;&gt; We&#x27;re told this is very much an ongoing investigation, and that it&#x27;s unclear whether or not this is a widespread issue.<p>TL;DR: a crack in a critical part was found in one plane during a routine inspection. But you wouldn&#x27;t know that unless you read all the way to the middle of the article. This is a non-story engineered to create outrage and clicks.", "by": "m0zg"}]