[{"item_id": 21105741, "text": "I think these articles and the responses are missing the real point which is how an Ivy League education became so important in America.<p>I grew up in Israel near the Technion, our MIT equivalent which produced a few Nobel Prize winners. It&#x27;s not a big deal to get in, if you have poor high school scores you take a year long prep course, classes are hard but most people push through. Having a Technion degree might give you a slight edge getting your first job but that&#x27;s that - you&#x27;ll be judged by your performance moving on, not on your alma mater.<p>When I lived in the US for a few years, I couldn&#x27;t understand how people allocate such importance to a person&#x27;s high school performance (which is basically what determines their alma mater in the best case scenario, before family donations etc). To me it signals a risk-averse mentality that fears taking a chance on a potential hire.", "by": "nir"}, {"item_id": 21104804, "text": "When I was an undergrad Prof. Joe Traub (famous for applying Quasi Monte Carlo to derivatives) passed away and they had a whole lecture series in memorium. David Shaw showed up and, having bailed on Columbia CS because they didn’t want to fund his ideas on algorithmic trading, was straight up like fuck this department y’all are dumb and could have been billionaires. It was pretty crazy, I don’t think I’ve ever seen more uncomfortable squirming in an audience!", "by": "electricslpnsld"}, {"item_id": 21104221, "text": "If Shaw wanted a college guarantee, he could merely start a few of them, with that kind of money.<p>It&#x27;s a big puzzle to me why this doesn&#x27;t happen more often. In the past it did. Fighting inequality or discrimination, especially at the professional level, started when someone said, &quot;Okay, I&#x27;m just going to make a school for my own then.&quot; My favorite example of this is the dismantling of Jewish exclusion at New York medical schools, which happened by creating new medical schools that did not discriminate. [1]<p>The idea that prestige is entrenched, basically, is wrong. Maybe that idea is the main obstacle to education reform.<p>Although maybe this is already happening for rich people. Alt Schools come to mind, although its story has come to an end.<p>I don&#x27;t think it&#x27;s possible for the superrich, as a class, to guarantee admissions for their kids at elite universities, because there&#x27;s only so much space. So why haven&#x27;t they built their own school?<p>[1] <a href=\"http:&#x2F;&#x2F;europepmc.org&#x2F;backend&#x2F;ptpmcrender.fcgi?accid=PMC1808007&amp;blobtype=pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;europepmc.org&#x2F;backend&#x2F;ptpmcrender.fcgi?accid=PMC18080...</a>", "by": "doctorpangloss"}, {"item_id": 21104353, "text": "This comment from 2011 by siavosh, on another NYMag article about Wall Street really rings true:<p>&gt; I hate articles like this.\nI used to work on wall street, and these sort of articles were rampant up until the burst: they glamorize financial &quot;wizards&quot;, hedge funds, trading life etc. They&#x27;re financial porn. They glamorize what, in my opinion, is a dubious field. All the while attracting all sorts of people into a field that has already proven it&#x27;s &quot;value&quot; or lack there of to society.<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=2813902\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=2813902</a><p>Edit: It&#x27;s also funny how the top reply by btcoal describes this current article perfectly:<p>&gt; These articles typically have a set format: 1. Intro into the mysterious culture of the hedge fund 2. Background on the precocious child prodigy turned market whiz 3. Description of firm&#x27;s hiring practices of PhD&#x27;s etc 4. Questioning value of Hedge Fund&#x27;s to society 5. In conclusion, this hedge fund makes a lot of money...", "by": "starpilot"}, {"item_id": 21105701, "text": "The article doesn&#x27;t talk it about it much, but it is not entirely inconsequential that he has started a company which for a while was at the cutting edge of high performance computing for protein structure prediction. The field has moved a little away from this idea lately.<p>The billionaire owner of Renaissance has done something similar. It&#x27;s interesting. Rather than giving the money away to academia or other philanthropic causes à la Bill Gates, they choose instead to micro-manage it. Shaw and the Renaissance guy both formerly worked in academia, and I can see why this would make them skeptical about large donations to academic institutions (beyond the motives proposed in the article).", "by": "Gatsky"}, {"item_id": 21105814, "text": "I wonder how the kids feel about it. It&#x27;s like being born royal, there will never be a way for you to stand on your own feet. Everyone will be polite but you&#x27;ll always wonder what they really think.<p>And yet you still have to work quite hard at those prep schools and elite colleges.<p>A friend of mine of similar status simply doesn&#x27;t use the family name, went to an ok but not Uber-elite school and works a normal job.", "by": "lordnacho"}, {"item_id": 21104268, "text": "And after all that manipu-vestment of system and children, his 1st kid graduates with a Yale Psych BS and becomes an apprentice comedy writer (quite probably assisted by family connections).<p>Think of how transformative that Yale slot could’ve been to someone not standing on a multi-billion dollar pile.", "by": "pinewurst"}, {"item_id": 21104690, "text": "Wow, how can people with normal income families even compete with these very wealth applicants for spots in the Ivy League? They can create such out sized extra curricular activities for themselves that just dwarf everything.", "by": "fakename11"}, {"item_id": 21109716, "text": "I was at Cambridge U and the college I was part of had an application from the child of a hyper-wealthy ruler of a notorious country.  The money of the ruler could have materially changed the prospects of the future of the college. So what they did was create a new slot in the class especially for the potential new student, so no other students would be disadvantaged.<p>I would expect many schools would do a similar thing.  Any school that would receive his kid&#x27;s application would surely admit them under similar rules.  He does not need to hedge his options.", "by": "m_gscie"}, {"item_id": 21109228, "text": "&gt; My bosses would tell me that if my spending eight hours on something would save David five minutes, it would absolutely be a good use of my time.<p>In addition to risk aversion, the article also talked about his efficiency and value of his time.", "by": "alephnan"}, {"item_id": 21106376, "text": "I always remembered D.E.Shaw, as I would visit the London offices at least twice a week over the course of 6 months, to see friends who worked there.<p>Only hire the true hackers seemed to work :)", "by": "zubairq"}, {"item_id": 21104489, "text": "I&#x27;m not sure this produces healthy adaptable well adjusted kids for shaw", "by": "ackbar03"}, {"item_id": 21104988, "text": "You spend a couple hundred dollars to help get your kids into school, you go to jail. Spend a couple million tho...", "by": "choiway"}, {"item_id": 21104408, "text": null, "by": null}, {"item_id": 21106114, "text": "Fun article. This Shaw guy is a real character!<p>I suppose the author is criticizing him, but I ended up liking Shaw from the article.", "by": "droithomme"}, {"item_id": 21104322, "text": "i don&#x27;t understand the point? if i have multiple billions of dollars and my kids want to do something who is going to ask them where they went to school? in fact why are they even going to school?<p>it&#x27;s like this thought i had about superman being buff - he&#x27;s the last person that needs to lift weights", "by": "mlevental"}, {"item_id": 21104347, "text": "All of these people will be against the wall when the revolution comes. Our society is so broken.", "by": "jshaqaw"}]