[{"item_id": 21102531, "text": "A beautiful related result is the Crofton Formula [0], which says that you can measure the length of any curve by appropriately counting the number of straight lines that intersect it.<p>(My co-authors and I discovered a generalization of the formula that also holds in curved space [1].)<p>[0] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Crofton_formula\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Crofton_formula</a><p>[1] <a href=\"https:&#x2F;&#x2F;arxiv.org&#x2F;pdf&#x2F;1505.05515.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;arxiv.org&#x2F;pdf&#x2F;1505.05515.pdf</a>", "by": "samsamoa"}, {"item_id": 21102316, "text": "An interesting related problem is Bertrand&#x27;s paradox[0]. You have an equilateral triangle inscribed in a circle. You pick a random chord from the circle (a line that goes from one edge of the circle to another). What&#x27;s the probability the chord is longer than an edge of the triangle?<p>As it turns out, there isn&#x27;t a well-defined solution. That&#x27;s the paradox. The issue comes from &quot;picking a random chord&quot;. There are different ways that you can pick a random chord which lead to different solutions. One approach to picking a random chord is to pick two random points on the circle and draw the chord between them. This gives you a probability of 1&#x2F;3. Another approach is to pick a random direction and radius, then draw a chord at the end of the radius perpendicular to the radius. This approach gives you a probability of 1&#x2F;2.<p>One interesting aspect is the second approach is the only approach where if you were to draw a circle within the larger circle, the distribution of the chords in the inner circle will match the distribution of chords in the outer circle.<p>[0] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Bertrand_paradox_(probability)\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Bertrand_paradox_(probability)</a>", "by": "malisper"}, {"item_id": 21102154, "text": "I thought this was total magic in high school until my college&#x27;s intro to probability class discussed this before the midterm. I guess maths progression in college can be fast.", "by": "runeblaze"}, {"item_id": 21102162, "text": "This was a practice problem I remember from when I was studying for Exam 1&#x2F;P, one of the qualifying exams for actuaries.<p><a href=\"https:&#x2F;&#x2F;www.soa.org&#x2F;education&#x2F;exam-req&#x2F;edu-exam-p-detail.aspx\" rel=\"nofollow\">https:&#x2F;&#x2F;www.soa.org&#x2F;education&#x2F;exam-req&#x2F;edu-exam-p-detail.asp...</a><p><a href=\"https:&#x2F;&#x2F;www.casact.org&#x2F;admissions&#x2F;syllabus&#x2F;index.cfm?fa=1syllabi\" rel=\"nofollow\">https:&#x2F;&#x2F;www.casact.org&#x2F;admissions&#x2F;syllabus&#x2F;index.cfm?fa=1syl...</a>", "by": "will_pseudonym"}, {"item_id": 21101622, "text": "There’s a nice chapter on Buffon’s needle problem in “Proofs from THE BOOK”, an Erdős-inspired attempt to collect the most beautiful proofs. You can find a PDF of the entire book easily enough on Google, it’s a good read although I would dispute the beauty of some of the proofs in it.", "by": "lorenzhs"}, {"item_id": 21108571, "text": null, "by": null}, {"item_id": 21102874, "text": null, "by": null}, {"item_id": 21103048, "text": "I first saw this little gem in a stats test in my second year at university. I must say it was a lot more fun deriving it without the time pressure", "by": "safgasCVS"}, {"item_id": 21103534, "text": "Kakeya is another nice needle problem:<p><a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;IM-n9c-ARHU\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;IM-n9c-ARHU</a>", "by": "lonelappde"}, {"item_id": 21102050, "text": "Unreadable on Chrome.", "by": "Rainymood"}]