[{"item_id": 21110277, "text": "HN comments seem to lack focus on the podcast&#x27;s contents (which isn&#x27;t too surprising, as the podcast is nearly as long as the post is old.)  Having already listened, here are some highlights:<p>* How work started on the language in the beginning, including social factors such as support from their managers.<p>* The value of starting a language with its spec instead of an implementation.  Why it&#x27;s a good idea and when it&#x27;s maybe not.<p>* Learning how to work in on an open source project coming from a closed source world, how to make that project successful.<p>* Feature rich vs feature parse languages.  What Go chose, and the trade-offs it took when choosing so.<p>* What influences Go has had on other programming languages, with a focus on gofmt and code formatting in general.", "by": "Laremere"}, {"item_id": 21111060, "text": "For those wanting to read a transcript...<p>Transcripts are delayed a few days but there will be a transcript. We have a human on staff (Alex) to ensure every podcast we produce a highly readable transcript that can also be contributed to via Github.", "by": "adamstac"}, {"item_id": 21110633, "text": "I think I&#x27;m the only Go programmer who enjoys the idea behind GOPATH :)", "by": "haolez"}, {"item_id": 21110894, "text": "Mods, please add (podcast) warning to title.<p>There is no transcript.", "by": "gumby"}, {"item_id": 21110867, "text": "Slightly off topic: Why was the language named &quot;Go&quot;?<p>I originally assumed that it was an abbreviation of <i>Google</i> (where it was developed) but I can&#x27;t seem to find an information confirming that...", "by": "gitgud"}, {"item_id": 21111972, "text": "Don&#x27;t.", "by": "higherkinded"}, {"item_id": 21110163, "text": "While I dislike golang its runtime and compiler are nice. Also lot of its simplicity aspects are nice.<p>if vlang can implement what it is trying to implement then probably it will be a nice contender to golang in all aspects. But that looks too good to be true.<p>The other language is rust, but the higher learning curve make it a bit harder for adoption in non systems where go&#x2F;java like performance is enough.", "by": "mrath"}, {"item_id": 21110241, "text": "are basic languages good though? the amount of go concurrency bugs I&#x27;ve dealt with has been outstanding and quite brutal over the last few years; I feel like many times the same sort of c &quot;i dont make mistakes&quot; programmers are attracted to go and they also don&#x27;t make mistakes there as well...", "by": "moocowtruck"}, {"item_id": 21110078, "text": "first two minutes are ads and fluff, fast forward them", "by": "sneak"}, {"item_id": 21111010, "text": "No progress bar. No fast forward button. No speed-up.<p>Man this UX is frustrating.", "by": "kristianov"}, {"item_id": 21109796, "text": "Step 1: be rob pike. Step 2: invent a pretty basic programming language using your old compiler from Plan 9 while at google. Step 3: be rob pike. ^_^", "by": "arcticbull"}]