[{"item_id": 21104739, "text": "I am a pancreatic cancer survivor.  It is considered incurable in 2019 and I&#x27;m here because of a 1930s era surgery called a Whipple procedure.  Around 9% survive five years or more -- a number that hasn&#x27;t really changed.<p>In a belt plus suspenders move I underwent 2 rounds (six infusions per round) of chemo plus 28 consecutive weekdays of radiation after surgery.  All my doctors are amazed at my recovery, a few saying the best they&#x27;ve seen (though it came with diabetes and a different digestive pathway).<p>Chemo was awful.  Mine came with a bag of steroids first to mask the effects for a few days.  I scheduled my sessions for Thursday, knowing it wouldn&#x27;t hit me until Friday night.  One Saturday I slept around 20 hours.<p>However, by the end we had figured out how to minimize the effect of the chemo.  I needed my wife who watched me diligently.  Cancer is not a one person job!  She made sure every time I opened my eyes I stayed hydrated and ate something.<p>Chemo should have gotten worse.  It actually got easier.<p>My cancer never caused me pain.  The treatment... that&#x27;s another story.  I left the hospital with my belly held together by 16 staples.", "by": "geofffox"}, {"item_id": 21104182, "text": "Traditional chemotherapy is toxic to all cells. Cancer cells grow rapidly (part of what makes them dangerous). So the toxic effect gets the cancer cells first, since cells that are growing take up the most chemotherapy. But other cells grow rapidly too, like hair and intestinal cells, which is why cancer patients lose their hair and have terrible nausea&#x2F;diarrhea.<p>All (almost all?) cells take up some chemo. So, you are actually dying, just hopefully more slowly than the cancer. And then we stop the chemo before you all the way die.<p>This is why the bar for a cancer diagnosis is so high. We need biopsies to try to get as close to 100% accurate diagnosis as possible.", "by": "joshgel"}, {"item_id": 21104263, "text": "In pharmacy school I was told the paradigm in infections diseases was to identify the amount of medication to kill the pathogen, then give a little more. In oncology, it&#x27;s to identify the amount of medication that would kill the patient, then give a little less.", "by": "cosmic_shame"}, {"item_id": 21105812, "text": "Visual loss is a very rare side effect of chemotherapy, and permanent visual loss even rarer. The more common and no less serious side effects of heart muscle damage and secondary leukemia are not mentioned in the tagline, being ill-suited as click bait I presume.<p>I have given the chemotherapy described here to many patients. There is wide variation in how patients experience chemotherapy. Some finish and tell me it wasn&#x27;t as bad as they expected. I&#x27;m quite sure they only tell me things like this in the privacy of the consulting room. They would never say this to another patient in the waiting room. They feel bad for not having had the kind of widely publicised terrible experience.<p>Beyond the tagline, the account is reasonably accurate, although at times indulges in melodrama, about mitochondria of all things. It also doesn&#x27;t do a good job of talking about the cognitive dysfunction associated with chemotherapy. This is a complex issue. In randomised trials, patients receiving placebo cancer treatments tend to report high rates of some cognitive problems. That chemotherapy itself is causal in every case is certainly in doubt. The mere experience of being diagnosed with cancer as you might imagine can have profound cognitive effects.<p>I am not quibbling for the sake of it. There are patients who decide not to have chemotherapy, and sometimes what they have heard about the experience from &#x27;alternate&#x27; channels (such as newspaper taglines) has an out-sized influence on their decision. This is why a responsible editorial team would have had this article reviewed by medical professionals and patient advocates, and taken their advice about more judicious highlighting of potential side-effects. The article also doesn&#x27;t quite deal with the fact that triple negative breast cancer is a really bad disease to have. Metastatic disease has a median overall survival of 18 months. If chemotherapy had not completely eradicated the cancer as it did in her case (the chances are about 50-50), 40% of patients develop metastatic disease in 3 years.", "by": "Gatsky"}, {"item_id": 21104152, "text": "Chemotherapy is scary. It seems so counterintuitive to choose to inflict this kind of damage to oneself, in the hopes that it will prevent an even worse outcome.<p>Part of it is that there is this nagging feeling that it might not even be the right approach, given the legion of side effects of all kinds. Even oncologists get vague and evasive when this is questioned. In the end we can only rely on generalized statistics about survival rates, unsure of how it applies to individual situations.<p>I disagree with the anger people often show towards cancer. It&#x27;s like people project some kind of malignant personality onto the phenomenon. I think of it as a natural part of life, like early hair loss. You can die from it, but death comes anyway, for one reason or another. At least with cancer you have time to get used to the idea, unlike an accident, heart attack or whatever. I guess I am a bit of a fatalist.", "by": "sfjailbird"}, {"item_id": 21104150, "text": "My father was diagnosed with lung cancer 4 years ago. He is on his third round of chemo. I recommend reading &quot;The Emperor of all Maladies&quot; for an insightful book on cancer. Even though medicine has made great progress fighting cancer, the scorched earth approach is what most of these treatments come down to.", "by": "pcestrada"}, {"item_id": 21103399, "text": "A line from a passage I remember reading as a medical student, has stuck with me after a decade and a half. It described anticancer therapies as having the effect of &quot;... poisoning patients to the edge of their existence...&quot; It is not my belief that the side effect profile of anti tumor drugs has improved much.<p>So, yeah. Treatments for cancer can suck just as badly as the disease itself.", "by": "Lordarminius"}, {"item_id": 21105134, "text": "I knew two people who both got cancer about the same time. One said no to chemo. The other said yes to chemo.<p>The differences in quality of life until death were <i>dramatic</i>. Neither had a longer life than was expected had they not taken the chemo, but the one who did lost hair, physical dexterity, then life. Suffered greatly.<p>The other one suffered much less, but still died.<p>The doctors all said take the drugs. You don&#x27;t have to take the drugs. Do the research. Chemo isn&#x27;t always beneficial.<p>Sometimes... it&#x27;s just <i>hope</i>.", "by": "anon1m0us"}, {"item_id": 21105673, "text": "As someone doing cancer research and running a clinical lab, diagnosing cancer every day, I read the accounts of folks with cancer with a certain degree of lachesism. I want to know what this is. I know chickenpox and a broken leg and I know what it&#x27;s like to have a loved one with cancer. But the thing itself, I do not know.<p>I spend every waking moment thinking about how to hunt cancer. It used to be reflex, now it&#x27;s been so long it&#x27;s somewhere between habit and addiction. My cognitive self knows I don&#x27;t want cancer. But there&#x27;s definitely a weird, fucked up interest in what it&#x27;s like.", "by": "killjoywashere"}, {"item_id": 21106293, "text": "My gf had grade III brain cancer. She had chemo two times. As chemos go, the one for brain cancer is fairly bening. The only side effect was nausea on initial chemo dose. Easily countered by antiemetic given only before first few initial doses, later withdrawn. The only other side effect was low blood cell counts that didn&#x27;t manifest any symptoms but caused chemo to be delayed by a week till it recovered. Steroids given for brain swelling had more effect as they increased her appetite and kept water in her body causing her face to swell a bit. Ask your doctor for medication that amplifies urine production if you are given steroids. That helped when she was given it for the second time. Also after steroids were stopped her skin needed few weeks to recover from being prone to acne.<p>Possibly the only drug that might have felt like it was killing her was the morphine, as it can depress respiratory system, but at this stage there were so many things that might have been killing her that it wasn&#x27;t important.", "by": "scotty79"}, {"item_id": 21104080, "text": "cancer treatment can also cause cancer and does - it was likely the cause of the death of my grandpa - but he got 10 more years due to a chemo-therapy from an otherwise lethal cancer - fuck cancer.", "by": "nisa"}, {"item_id": 21104187, "text": "Being alive to criticize the treatment is usually better than the alternative.", "by": "brent_noorda"}, {"item_id": 21106366, "text": "My wife worked in oncology for about 5 years as a clinical pharmd.  She and all of the doctors said they would never put themselves through chemo", "by": "chrisan"}, {"item_id": 21108991, "text": "Dying from cancer doesn&#x27;t have to happen anymore. Use hemp oil with at least a 95% THC concentration daily. Search for Rick Simpson oil online for details. You can make the oil at home if you are able to obtain the right hemp leafs. And stay away from chemo!!!", "by": "kd3"}, {"item_id": 21105450, "text": "This is an alternative to maximum tolerated dosing chemotherapy (standard) and it is called adaptive chemotherapy [0]. The aim with adaptive chemotherapy is to just stop the cancer from growing larger and using the growth advantage of the chemosensitive cancer cells to keep the resistant cells under control. This approach is much easier on the patient. I would look very carefully at this approach if I was ever in need of considering chemo.<p>0. <a href=\"https:&#x2F;&#x2F;www.sciencedaily.com&#x2F;releases&#x2F;2016&#x2F;02&#x2F;160224164357.htm\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sciencedaily.com&#x2F;releases&#x2F;2016&#x2F;02&#x2F;160224164357.h...</a>", "by": "danieltillett"}, {"item_id": 21106309, "text": "I&#x27;m also very curious about oncolytic toxicity.<p>personal sad story: uncle diagnosed with stage4 (mets) in late dec, got rounds of chemo 4 months after the diagnosis during which time the tumors didn&#x27;t grow (based on the few bits we could read in his file). But after the 3rd round his health dropped to the floor, didn&#x27;t last long after that. I believe the toll on his system was just too high. And I&#x27;m curious what are the mechanisms at play.", "by": "agumonkey"}, {"item_id": 21105252, "text": "I&#x27;ve had multiple relatives have cancer, some multiple times. Two relatives had cancer twice. Another, five times. Assorted others had cancer at least once.<p>I took care of a relative following a mastectomy. Making sure she got adequately hydrated brought her fever down. I got two hours sleep her first night back from the hospital because I devotedly pushed fluids at every opportunity.<p>She coughed up phlegm after I made her get enough food and drink into her to drop her temperature a degree. She said I probably prevented post-operative pneumonia.<p>My late father had colon cancer in his late sixties. He lost a third of his body weight before it was diagnosed.<p>My parents were told to get their affairs in order. He wasn&#x27;t supposed to live.<p>His surgery that was supposed to be two hours lasted six. The cancer was much more extensive than they expected, but it hadn&#x27;t invaded other organs. They peeled it off the outside of them instead of cutting out parts of them.<p>He had a thirteen inch scar from sternum to pubic bone with a dent going around his belly button. My mother treated the scar with German Penaten cream and treated his skin with Penaten cream.<p>Her mother died from uterine cancer when my mother was in her teens. My mother was convinced that radiation treatments killed her mother. She always had some excuse why my dad couldn&#x27;t make one of his radiation treatments every week.<p>He lived about another two decades.<p>The cancer clinic at Martin Army Hospital was impressed with the condition of dad&#x27;s scar and asked what they were doing. My mother explained it was the Penaten cream. They added it to their regime.<p>After my father defied his sentence of death, the civilian cancer doctor that treated him interviewed my mother on tape for two hours and changed the practices of his clinic based on what she said. The doctor knew my mother is the person who kept my dad alive.<p>Their big thing was hydration. They calculated how much fluids he needed and they made sure he got enough every day. Caffeinated drinks and alcohol did not count.<p>When he was too sick to eat, she made him homemade milkshakes or slushies once or sometimes twice a day in place of meals. On not so bad days, I think she used milk, good quality ice cream and fresh fruit. On super bad days, she used ice, frozen fruit and fruit juice.<p>He was gaining so much weight during a time when most cancer patients are continuing to lose weight that his doctor yelled at her to slow it down. He had a long-standing heart condition and her doctor was afraid she was kill him by putting too much strain on his heart with the rapid weight gain while he was still undergoing treatment.<p>My mother wanted to be a doctor in her youth. She delivered babies in her teens. She never got to be a doctor, but she was always patching someone up as long as I can remember.", "by": "DoreenMichele"}, {"item_id": 21105251, "text": "I cannot possibly fathom the terrible experience of cancer patients going through chemo. My great hope though is that a bunch of these will be rendered treatable with the immunotherapy solutions out there and being developed right now, which though expensive today for most people today, might be bought down by the demand supply mechanics of economics....", "by": "itissid"}, {"item_id": 21105151, "text": "Immuno-oncology and fasting are the future, but polychemotherapies still have their uses.", "by": "anon91831837"}, {"item_id": 21104400, "text": "If I ever have a cancer diagnosis that would require extreme treatment or a pro-longed period of suffering, i.e. stage 3 or 4, I&#x27;d seriously consider shooting myself rather enduring months if not years of agony.<p>In theory I&#x27;d have insurance, however why put my family through years of seeing me suffer and become a person they might not recognize?", "by": "algaeontoast"}, {"item_id": 21104442, "text": "&gt; My desire to survive means I still can’t bring myself to unravel survival’s ethics. One of the chemotherapy drugs with which I was treated, cyclophosphamide, passes into the urine only partially diluted, is only partially removed by water treatment methods, and lasts in the common water supply for 400 to 800 days. Another, carboplatin, is described in its manufacturer’s information sheet as having the “environmental fate” of accumulating in aquatic environments, where it lingers but no one yet knows what damage it does.<p>Tons of complaining about the drugs, economy, medical professionals, and people that keep her alive. Can’t you appreciate that the system worked and is keeping your ass out of the grave? Yes, it costs millions, but that’s why we all pay an absurd amount into insurance.<p>&gt; Everyone understands as a matter of fact that unless you are currently entered into this world’s customary romantic partnership, or unless you have lived long enough to raise devoted grown children, or unless you are young enough to still be in the care of your parents, you are, on the occasion of aggressive cancer in the conditions of aggressive profit, rarely considered worth enough to keep alive.<p>The reality is that the people most likely to care for you at your weakest, most vulnerable moments is your own family. I don’t know how the government can make strangers love and devote themselves to your care with sincere emotion and affection. If you don’t have family because you prefer not to live in a “customary romantic partnership” this is a choice you have made for yourself.", "by": "seibelj"}, {"item_id": 21105440, "text": "I&#x27;m surprised no one has talked about diet here. Not a single one. There are many cases of cancers being completed reversed by change of diet, many cancers survive off of glucose and so switching to a fat based diet has helped many people go into remission as well as dull and intensify the effects of chemotherapy.<p>Cancer is a living biological cell after all and will prefer certain sources of energy over others. Starve it of it&#x27;s primary energy source (glucose) and it will die. Human non-cancerous cells on the other hand are very versatile and can survive off either fat or carbs. Sad how the first thing people would rather do is try chemo than give up off their carb and sugar addictions.", "by": "mannanj"}]