[{"item_id": 21109925, "text": "The clarity, simplicity and minimal didactic approach towards making old instructional videos is gone now. We have subscribe&#x2F;hit-the-bell reminders, annotations, background music, sponsorships, intro and exit greetings and all kinds of unneeded bullshit in video production.<p>Commercialization of video has ruined this art form. Just compare early Mythbuster episodes to something from 2016. Production quality has horrendously degraded. The money is where the masses are and the masses want entertainment, not education.", "by": "spectramax"}, {"item_id": 21108557, "text": "Just in case, Aaron Hsu made a bunch of talks about APL<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;results?search_query=aaron+hsu\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;results?search_query=aaron+hsu</a><p>It&#x27;s a bit caustic to the mainstream (beauty, terseness over ease and variable names) but I personally find it tickles all my boxes.", "by": "agumonkey"}, {"item_id": 21112049, "text": "APL made a lot more sense in the era of 110 baud teletypes.", "by": "narrator"}, {"item_id": 21108213, "text": "As cool as this is, APL has improved a <i>lot</i> in the 34 years since that video was made.  Most notably, these days, APL has `direct functions`, which enable a degree of concision and tacit-programming support unmatched in any other programming language (yes, including Haskell).<p>As a minor taste of the power of direct fns, here&#x27;s a naive implementation of the Fibonacci sequence with one: `fib←{1≥⍵:⍵⋄(∇⍵-1)+∇⍵-2}`", "by": "codesections"}, {"item_id": 21108223, "text": "I have a feeling that apl (or j) based calculator app (with buttons for all fancy symbols) could be something. All those nice powerful one liners seem to be suited for such app. I wonder if something like that is available. I know there is j for Android, but having a nice closed interface focused on short clever code would be fun.", "by": "yeellow"}, {"item_id": 21105936, "text": "A thread from 2014: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=7817593\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=7817593</a>", "by": "dang"}, {"item_id": 21108907, "text": "I find that his mentioning of &quot;monadic&quot; and &quot;dyadic&quot; instead of &quot;unary&quot; and &quot;binary&quot; interesting, why did he mention those?", "by": "coldpresent"}]