[{"item_id": 21100555, "text": "Speaking as a layman and aware of the tendency to anthropomorphise, nevertheless:<p>The time for animals of this cognitive and social level to be granted special protected rights and respect seems <i>long</i> overdue.", "by": "mellosouls"}, {"item_id": 21101281, "text": "Are they taking her with her consent? Did she decided to go to Florida?<p>Deluding the meaning of what a person is or what is not doesn’t look like a good idea in the long run.", "by": "elboru"}, {"item_id": 21100584, "text": "Ironically, said rights were granted by an Argentine court, so presumably do not apply in Florida.", "by": "trevyn"}, {"item_id": 21100705, "text": null, "by": null}, {"item_id": 21101367, "text": "&gt; Florida&#x27;s Center for Great Apes<p>Sounds like a fun place to work", "by": "dmix"}, {"item_id": 21104672, "text": "By determining that all animals are sentient beings, would putting a plough on a cow to farm a piece of land then be viewed as a form of indentured servitude, what about harvesting honey from beehives, spraying bug spray could be viewed as some form of genocide? Where is the line drawn?", "by": "subsaharancoder"}, {"item_id": 21101530, "text": "Next he will work as a bibliothecarian in a university.", "by": "LifeLiverTransp"}, {"item_id": 21100715, "text": "America cages innocent people who don&#x27;t have certain pieces of paper. Families are broken up and children separated from\nMothers.<p>But yea, long overdue monkey rights.", "by": "seamyb88"}, {"item_id": 21100577, "text": "This is definitely not as bad as the Saudi robot that is a person. Though despite the intelligence of nonhumans I am not sure I can support granting personage to things and property at this time.<p>I think the Old Testament has interesting things to say on this topic: &quot;Everything that creeps on the ground and all the fish of the sea are under your authority. &quot;<p>In a lot of ways Judaism and what it evolved into is the unreligion religion. Events in it, like the plagues of Egypt, are digs at the asinine nature of contemporary customs. E.g. the frogs were a plague because the frogs were sacred and could not be killed. In general the Abrahamic God doesn&#x27;t want you fettering your wealth away on complicated rituals.<p>In the West, you can usually see a split between people who view animals largely as property and those that don&#x27;t. The latter concern me, because although I can oppose wanton cruelty -- when it comes down to it, there are people, and not people. And if I need to get rid of property because I can&#x27;t maintain it, I should be able to do so.", "by": "snagglegaggle"}, {"item_id": 21101265, "text": "But with his credit score he can&#x27;t get a car...", "by": "danschumann"}, {"item_id": 21100675, "text": "I wish my government wished peace for me, instead of endless anxiety, fear, and strife.", "by": "op00to"}]