[{"item_id": 21107549, "text": "A big thing that annoys me about buzzwords like &quot;decentralized&quot; is that they&#x27;re not binary. Another one that&#x27;s largely lost meaning is &quot;blockchain&quot;. Decentralized is relative and depends entirely on the context.<p>They do tend to represent ideas like anti-censorship, individualism, and (sometimes) privacy. I think it makes more sense to discuss these topics in terms of the actual implication of what you&#x27;re decentralizing, and how it actually helps.<p>For example, the Internet itself is decentralized. But from the perspective of your particular ISP, it&#x27;s not at all decentralized (if your ISP turns off your Internet, it&#x27;s game over).<p>Email is also decentralized, but so what? Most people use the same email providers so it&#x27;s somewhat meaningless for SMTP itself to be decentralized. Google can still read your emails.<p>The problem with using these terms instead of more tangible language (i.e., language that describes what the thing is actually doing) is that they tend to get hijacked by scammers&#x2F;marketers who just want to harness their popularity for their own ends.", "by": "brenden2"}, {"item_id": 21109436, "text": "&gt; We need decentralized communication<p>&gt; Although Riot has made significant progress in the past few months, there is still a long way to go before it becomes a suitable drop-in replacement for platforms such as WhatsApp or Discord.<p>The problem with adoption client based on Matrix protocol is clearly lack of the quality of clients and being so annoying for users. I think it also stands true for other protocols like IRC or XMPP. In my humble opinion, clients for all 3 are far behind Telegram or WhatsApp or even BBM.<p>Looking on commits in repos of various Riot clients, I am not sure if there is significant progress (yes, it&#x27;s a bit unfair to said that, but comparing to let&#x27;s say webpack repository, number of random contributions is quite low). For Android there are two versions - Riot and RiotX. RiotX is in early stage development (I&#x27;d say it&#x27;s unusable), while the Riot just gets minor changes. iOS client is OK. Web and desktop client (based on electron) is not as simple as Slack to get start and running. I keep fingers crossed for Riot developers and spontaneous contributors to improve those clients - without good, simple to use clients there isn&#x27;t any chance for Matrix to be adopted widely as WhatsApp or Telegram are.<p>Centralization is not really important factor for most of people during selection of communicator. IM is a tool and if it does not do its job properly, people will look for better alternatives. Just, please take a look how many sysadmins&#x2F;devops switched to Slack from IRC. Please stop writing yet another article how centralization is bad - just help Vector.im, TheLounge.chat or other group to bring such IM client where most of people will be comfortable to use it.", "by": "piotrkubisa"}, {"item_id": 21107791, "text": "<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=KbWfzyQBWrU\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=KbWfzyQBWrU</a><p>&gt; Most Popular Instant Messengers 1997 - 2019<p>WhatsApp has approx. 2 billion users. The beginning of that video starts out with messengers (not including things like IRC and email) that have a few million.<p>This is just the Eternal September effect.<p>You and I can just crack out nginx and host a site. The author of this post didn&#x27;t even do that; what hope is there for the rest?<p>An instant messenger, even a secure one, needs a proper marketing budget in order to succeed out in the real world. It doesn&#x27;t just need to be superior - it needs to be _advertised_.", "by": "esotericn"}, {"item_id": 21107294, "text": "&gt; Decentralization is paramount to restoring privacy and freedom to the internet.<p>We have to start with reconquering our phones. A decentralized app cannot be hinged on a centralized appstore.", "by": "lixtra"}, {"item_id": 21107619, "text": "There’s some juicy irony in seeing “We need decentralized communication (medium.com)”.  I see no mention the the elephant in the room.", "by": "ken"}, {"item_id": 21107645, "text": "You want to send something sensitive, mail a letter. In the US, the protections on ease dropping on physical mail is quite good. Requires an actual warrant in an actual court, unlike most electronic communications.<p>Otherwise, assume your communications are being collected and perused.", "by": "dsparkman"}, {"item_id": 21108739, "text": "Oh for crying out loud. No, we need UNcentralizable communication, as to avert undecentralization&#x2F;recentralization.<p>Federation=bad:<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=19959687\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=19959687</a><p>Unfortunately, any communication protocol which mathematically always reduces to ye olde beads-on-a-string with enough extra steps to hide this even from most experts makes this fundamentally impossible… — …and both IP 4 and IPv6 fall into that category, despite their very name implying otherwise:<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=19867467\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=19867467</a><p>Two brief quotes from over there:<p>&quot;[…]<p>This does not mean that we should be doing OSI. Good grief, no. …<p>[…]<p>————<p>[…]<p>[22] Someone will ask, What about IPv6? It does nothing for these problems but make them worse and the problem it does solve is not a problem.<p>[…]&quot;", "by": "no_identd"}, {"item_id": 21107383, "text": "&quot;This means the only way WhatsApp could comply with these demands is by completely altering their software with insecure cryptography.&quot;<p>I get what the author is trying to say, but getting technical details like this incorrect makes it difficult for me to want to keep reading these types of articles. There is no need for WhatsApp, et all to make the crypto insecure, all it needs to do is keep a record of the keys in a centralized database. That&#x27;s why having centralized Commination isn&#x27;t good, all you have to do is own the key handling process and you&#x27;re good.<p>To follow the analogy in the article, the lock is fine, just 3 letter agencies have the key.", "by": "kop316"}, {"item_id": 21107531, "text": "&quot;[...] used against suspected terrorists, pedophiles and other serious criminals.&quot;<p>This isn&#x27;t even a slippery slope, &#x27;suspected, other serious criminals&#x27; is subjective enough to apply at will in any instance.", "by": "karmakaze"}, {"item_id": 21109349, "text": "My beef with Riot (at least as of 18 months ago) was how cumbersome it was to set up encrypted channels, especially on multiple devices. I&#x27;m not at a place where I can do much about that, but happy to support somebody who can (if its still an issue).", "by": "reilly3000"}, {"item_id": 21107438, "text": "We could have decentralized communications if we ever actually use IPV6 in production.  Static IP&#x27;s for all, much easier to self-host.<p>The other large issue is once you self-host, you&#x27;re now liable for moderation of illegal content.  I&#x27;m not sure how to fix that part.", "by": "linuxftw"}, {"item_id": 21108273, "text": "Like IRC?", "by": "jpswade"}, {"item_id": 21109919, "text": "You lads ever heard of gab or zeronet ?", "by": "Jonahgay"}, {"item_id": 21109652, "text": "We have had it, memo.cash", "by": "mraudiobook_com"}]