[{"item_id": 21111172, "text": "&gt; <i>The algorithm detects the content whether it’s posted online or shared via a messaging app like WhatsApp.</i><p>That statement contradicts Whatsapp official statement that all content is end-to-end encrypted: “WhatsApp ... we built end-to-end encryption into our app. When end-to-end encrypted, your messages, photos, videos, voice messages, documents, and calls are secured from falling into the wrong hands. Only you and the person you&#x27;re communicating with can read what is sent, and nobody in between, not even WhatsApp.”<p>In this case, I believe Whatsapp more than I believe a technically illiterate writer on a government website that failed to understand some nuance. Maybe some Whatsapp users forwarded questionable content they’ve received to the authorities, then the algorithm scanned that content. That’s very different than secret scanning happening <i>within</i> Whatsapp.", "by": "cantrevealname"}, {"item_id": 21110546, "text": "The article that this article links to says that the FBI has shared thousands of photos with Swiss Police.", "by": "sharth"}, {"item_id": 21110661, "text": "This article makes no sense.", "by": "gagabity"}, {"item_id": 21111232, "text": "Does this only apply to the Swiss government, or is Facebook sharing any pictures that hit their filters with law enforcement agencies of whatever country you happen to be living in?", "by": "glloydell"}, {"item_id": 21111156, "text": "Giving your photos to a lab to be developed sometimes resulted in police being alerted...although this is based on my hazy memory.", "by": "techer"}, {"item_id": 21111189, "text": "I wonder if Apple and Google employees review my photos stored in my cloud accounts?", "by": "mturilin"}, {"item_id": 21110593, "text": "&gt; In an effort to combat child pornography, providers like Facebook and Google automatically screen all photos for the presence of children and bare skin.<p>The presumption that childhood nudity needs to be screened in such a way is, itself, cringey and creepy and perhaps not without a hint of pedophilia.<p>&gt; The algorithm detects the content whether it’s posted online or shared via a messaging app like WhatsApp.<p>OK, so what is &quot;the algorithm?&quot;  Where can it be tested and audited?<p>And how do authorities acquire content send in a WhatsApp message?  We just went over this yesterday, didn&#x27;t we?  wcathcart, any response to this?", "by": "jMyles"}]