[{"item_id": 21107000, "text": "If you&#x27;re incredulous that Tesla would let people oversee a moving car at 15mph in a parking lot, wait until you hear what happens next after the car gets to them!<p>I think driving is a special case for safety, because we have put humans in charge of controlling 2000+lb cars at high speed in close proximity with other humans doing the same thing, and we&#x27;ve either designed or retrofitted this activity into almost every dense human habitation on the planet.  Obviously we would never make such a decision now, but it gives a special context to today&#x27;s safety decisions.  It is a major ongoing source of death and injury as well as a major source of pollution, and bringing that era to a close is a special priority.  In the United States roughly 100 people per day die in car accidents, and many more are seriously injured, so you could say that every day we can accelerate the end of human driving saves a hundred lives.", "by": "dkarl"}, {"item_id": 21106773, "text": "&quot;You are still responsible for your car and must monitor it and its surroundings at times within your line of sight because it may not detect all obstacles. Be especially careful around quick moving people, bicycles, and cars.&quot;<p>Is this a joke? I have huge respect for Tesla and SpaceX, but how do they expect to release a feature that will self-drive a car (even tiny distance) and someone will oversee a moving car?<p>The software engineer in me just died.", "by": "brainless"}, {"item_id": 21106083, "text": "Honest question, Can somebody explain me the use case for this feature? I don&#x27;t get it.<p>I mean, if the summoned car came to me in a totally autonomous way, it would be useful in very large parking lots, like an airport, campus, etc... Or I could call it while still leaving my apartment&#x2F;office, and the car would be there by the time I get to the door.  But if I need to have the car in my line of sight, just standing still while watching it and holding the button, with me being aware and responsible of the car not bumping into any obstacle,  then it means I&#x27;m pretty close to the vehicle, so why not just walk the very short distance to it?", "by": "molmalo"}, {"item_id": 21106979, "text": "As a motorcyclist, these videos are sickening. Especially the guy purposely using smart summon to cross LIVE traffic (not in a parking lot).<p>These kind of low speed collisions are not a big deal to car drivers. But for someone on a motorcycle, having a Tesla with no driver obliviously pulling out into live traffic in front of a motorcycle (even at low speeds) can cause significant injury.<p>Please, people... don&#x27;t be stupid.", "by": "cj"}, {"item_id": 21106358, "text": "The feature being a worldwide premier, with no past experience, I honestly expected that Tesla had added more sounds and visual warnings when the Summon feature is running, such as flashing the car&#x27;s headlights and emitting regular &quot;bip&quot; (like when a big truck is doing a reverse manœuvre), to catch the attention of other drivers, or even warn blind people when the Tesla is near.<p>Then, once the feature is polished with more real world data, they can always remove the warnings later.<p>The video with the white car coming through especially is scary. From all the sensors and marketing materials I know from Tesla, I would expect the Tesla to have detected that white car way sooner and stopped automatically. There was really no ambiguity to what decision to take here.", "by": "antpls"}, {"item_id": 21111989, "text": "I love Musk but this is a bad feature because he hasn&#x27;t looked at the actuarial case for not having this. TONS of car accidents happen in parking lots.", "by": "grizzles"}, {"item_id": 21107145, "text": "So, the author managed to find 3 concrete examples.<p>One where someone else backed into the Tesla.<p>One where no collision occured.<p>One where the tesla ran into a garage.<p>Only the last seems at all worrisome...<p>I vote for changing the headline to singular collision.", "by": "gpm"}, {"item_id": 21107179, "text": "All evidence so far suggests that self-driving cars are more dangerous than human drivers when similar conditions are taken into account.<p>The comparison numbers that Tesla parrots are between Teslas with modern safety features and in good weather conditions, and the entire rest of road fatalities, including motorcycles. Comparing similarly bodied cars in similar weather conditions, Tesla&#x27;s self driving has more reported collisions per miles driven.", "by": "Jasper_"}, {"item_id": 21107045, "text": "It is bold to imply that what tesla does is anything but directly harmful towards the goal of ending human driving.<p>Tesla and uber do a terrific job of pushing the acceptance of self driving and risking postponing that with their recklessness.", "by": "tjoff"}, {"item_id": 21105786, "text": "Nobody who has an inkling how hacky self-driving is would try this.", "by": "SrslyJosh"}, {"item_id": 21106128, "text": "Taking move fast and break things to the next level", "by": "Havoc"}, {"item_id": 21107893, "text": "Related - if you like spending time on reddit: please consider visiting r&#x2F;realtesla. Sometimes it&#x27;s a bit too negative, but mostly I find it a nice counterbalance to that creepy &quot;everything is <i>always</i> awesome&quot; subreddit.", "by": "tpmx"}, {"item_id": 21106501, "text": "Ok, so, from the article:<p>1. Lexus backed into Tesla<p>2. Nearly collided, on a busy lot, both cars stopped in time.<p>I’m really not seeing a problem yet.<p>Just an alarmist, fake news article.", "by": "moltar"}, {"item_id": 21106167, "text": "I like the Tesla cars and definitely thinking of getting one but the self driving stuff, I&#x27;ll let that age for a decade or two.", "by": "sunstone"}, {"item_id": 21110114, "text": "This feature was pushed out way before it was ready, all so Tesla can recognize some deferred FSD revenue in Q3, which ends on Monday.", "by": "new_realist"}, {"item_id": 21107952, "text": "It looks it is running the same software as my vacuum robot.", "by": "chvid"}, {"item_id": 21106803, "text": "Tesla. I&#x27;m disappointed. You say your cars are the safest on the road. That your self-driving AI is safer than humans. You spar with regulating bodies along those lines-- arguing that you&#x27;re protecting consumers. And then you roll out a fluff feature that causes accidents.", "by": "perspective1"}, {"item_id": 21108235, "text": "This seems like a huge opportunity for insurance fraud like you see often in Asia. Someone arranges to be struck by a car (ie flings themself in front of it), then splits the medical payout with a crooked doctor.", "by": "imglorp"}, {"item_id": 21107452, "text": "Apparently the car doesn&#x27;t try to read road markings, I stand by my comment I made 2 days ago in response to that.<p>&quot;Isnt that below minimum viable product for something expected to be used with other people around?&quot;<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=21089373\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=21089373</a>", "by": "benj111"}, {"item_id": 21105896, "text": "Most of these look like user stupidity rather than anything wrong with the car. Especially the video of the guy who trys to summon his car across a road.<p>I imagine summon is pretty dumb, but all Tesla&#x27;s talk of autopilot and self-driving cars has made people believe it is a lot smarter than it actually is.", "by": "fyfy18"}, {"item_id": 21105441, "text": "Brilliant<p>So we can send a fleet of Tesla to a bank robbery as gay away cars and have them block. Our getaway?", "by": "samstave"}, {"item_id": 21106956, "text": "I can&#x27;t believe that this is a real thing.<p>Are we so lazy that we can&#x27;t walk to our cars now?", "by": "thrower123"}, {"item_id": 21106625, "text": "It was a freaking typo guys, Jesus Christ. iPads suck to type from some times.", "by": "samstave"}, {"item_id": 21106112, "text": "And so if a person accidentally drops their phone the car eventually stops when it meets an unmovable object? Is this correct?", "by": "RaceWon"}, {"item_id": 21106094, "text": "AI taking over and teasing owners.<p>Or just a bad idea for fat and lazy people.", "by": "danielovichdk"}, {"item_id": 21105998, "text": "The feature is in beta, and it is enabled on cars lacking the latest hardware. I think it would be reasonable to expect issues especially for those cars.<p>I know it&#x27;s very popular to cherry pick incidents and attack Tesla these days, but, nobody else is pushing the envelope. And nothing about this feature is putting anyone at significant risk. These are inconveniences that have occurred, and nothing else. In the meantime, the pursuit of self driving cars is pushed forward greatly through the collection of this data.<p>In the end, this will benefit everyone.<p>For now, we can sit back and enjoy the cringey videos this will produce.", "by": "ztjio"}, {"item_id": 21107253, "text": "The carelessness and dangerous way this entire thing has been &quot;rolled out&quot; is alarming.<p>People are touting this as some sort of &quot;amazing&quot; feature, I think this guy Elon Musk is a crazy whackjob who puts people&#x27;s lives at risk.<p>All the videos I saw from Tesla were &quot; ideal well-lit&quot; situations; well of course! University graduate students have Legos and basic robotics that do that crap. Getting it to work in &quot;normal&quot; (read &quot;edge-cases) is the most difficult part. And they conveniently just ignored that part.<p>It&#x27;s insane people are putting these death machines on public roads.<p>Before people claim &quot;this is just a parking lot&quot;, imagine how many parents use their stroll-cartd with babies in them or how many kids run around in parking lots.", "by": "mindfulplay"}]