[{"item_id": 21109557, "text": "The results Grail presented as a talk at ESMO are fairly similar to those they presented in somewhat less detail at conferences earlier in the year (AACR and ASCO).<p>For those who are interested in a deeper dive on this technology, its potential limitations, and its potential benefits, I wrote up a three-part series earlier this year breaking down recent advances in liquid-biopsy-based cancer detection:<p>Part I: regarding tumor fraction (this goes into depth about the stage I limitations noted by other commenters) <a href=\"https:&#x2F;&#x2F;ihaque.org&#x2F;posts&#x2F;2019&#x2F;07&#x2F;02&#x2F;early-detection-mid-2019-part-1&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ihaque.org&#x2F;posts&#x2F;2019&#x2F;07&#x2F;02&#x2F;early-detection-mid-2019...</a><p>Part II: technical advances from Grail (the authors here) and Guardant (one of their main commercial competitors) <a href=\"https:&#x2F;&#x2F;ihaque.org&#x2F;posts&#x2F;2019&#x2F;07&#x2F;08&#x2F;early-detection-mid-2019-part-2&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ihaque.org&#x2F;posts&#x2F;2019&#x2F;07&#x2F;08&#x2F;early-detection-mid-2019...</a><p>Part III: clinical performance and economics - integrating the sensitivity and specificity numbers with a simple model for important clinical parameters like adherence (how many people prescribed to take the test actually do), and cost: <a href=\"https:&#x2F;&#x2F;ihaque.org&#x2F;posts&#x2F;2019&#x2F;08&#x2F;18&#x2F;early-detection-mid-2019-part-3&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ihaque.org&#x2F;posts&#x2F;2019&#x2F;08&#x2F;18&#x2F;early-detection-mid-2019...</a><p>Disclaimer: I&#x27;m the former CSO of a competing company, but I no longer work in this space.", "by": "_ihaque"}, {"item_id": 21108002, "text": "From [0], the types of cancer they can screen make up at least 81.4% of new cancer diagnoses, which means that with their 99.4% true positive rate, this test should be able to correctly identify ~80% of new cancer incidences. If I&#x27;m doing my math right, that&#x27;s really impressive.<p>[0]: <a href=\"https:&#x2F;&#x2F;www.wcrf.org&#x2F;dietandcancer&#x2F;cancer-trends&#x2F;worldwide-cancer-data\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wcrf.org&#x2F;dietandcancer&#x2F;cancer-trends&#x2F;worldwide-c...</a>", "by": "ethhics"}, {"item_id": 21107504, "text": "In addition to the press release someone posted, if you’re interested in some of the (high level) science behind this, I’d encourage you to read the ESMO presentation slides this news comes from: <a href=\"https:&#x2F;&#x2F;grail.com&#x2F;wp-content&#x2F;uploads&#x2F;ESMO_2019_Oxnard_CCGA2_Training_Final.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;grail.com&#x2F;wp-content&#x2F;uploads&#x2F;ESMO_2019_Oxnard_CCGA2_...</a><p>I don’t think the article mentions it, but the study is funded by Grail, which is commercializing a variety of related technologies.", "by": "doctoring"}, {"item_id": 21111152, "text": "A pathologist friend told me “there’s a good chance you already have the cancer that might eventually kill you.” The danger of early detection of cancer is that we’ll end up treating fat more people than we would otherwise, and cancer treatment is often brutal. I’ll be interested to see what better detection actually does for mortality rates.", "by": "kaikai"}, {"item_id": 21107472, "text": "Original press release that is the basis for the story:\n<a href=\"https:&#x2F;&#x2F;www.dana-farber.org&#x2F;newsroom&#x2F;news-releases&#x2F;2019&#x2F;new-blood-test-capable-of-detecting-multiple-types-of-cancer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dana-farber.org&#x2F;newsroom&#x2F;news-releases&#x2F;2019&#x2F;new-...</a>", "by": "petilon"}, {"item_id": 21109688, "text": "One day I hope that I will have a device that can digitize my blood sample at home so that remote cloud processing can warn me of issues. Life can sometimes get in the way of preventative checks. Social anxiety might be a part of that too.", "by": "cheschire"}, {"item_id": 21109822, "text": "This is very promising. The performance will definitely get better, this is like the first smoky pictures coming out of an MRI.<p>The real challenge is going to be dealing with the result... it isn’t simply a matter of continuing to use the same treatments we do now but applied to earlier stage disease.", "by": "Gatsky"}, {"item_id": 21108054, "text": null, "by": null}, {"item_id": 21105071, "text": "no mentioning of false positives", "by": "aszantu"}, {"item_id": 21106339, "text": "I&#x27;m seeing a similar headline about once per year...", "by": "WordMixer"}, {"item_id": 21108463, "text": "Theranos?", "by": "ganitarashid"}]