[{"item_id": 21103130, "text": "There&#x27;s a good case to be made that we shouldn&#x27;t be recycling (all) plastics but instead sequestering much of it in well-run landfill operations. The energy required to recycle it combined with the inferior product that results make it a net-loss operation. Especially when taking into account the high levels of contamination and processing that must be done to prepare it. Reduce, re-use (and ban single-use), then sequester. [1, 2, 3, 4]<p>Aluminum? Definitely. Steel? Sure. Glass? probably. Paper? Cool. Plastic? <i>shrug</i>.<p>[1] <a href=\"https:&#x2F;&#x2F;www.theguardian.com&#x2F;environment&#x2F;2019&#x2F;aug&#x2F;17&#x2F;plastic-recycling-myth-what-really-happens-your-rubbish\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theguardian.com&#x2F;environment&#x2F;2019&#x2F;aug&#x2F;17&#x2F;plastic-...</a><p>[2] <a href=\"https:&#x2F;&#x2F;www.nationalgeographic.com&#x2F;news&#x2F;2017&#x2F;07&#x2F;plastic-produced-recycling-waste-ocean-trash-debris-environment&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nationalgeographic.com&#x2F;news&#x2F;2017&#x2F;07&#x2F;plastic-prod...</a><p>[3] <a href=\"https:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;amywestervelt&#x2F;2012&#x2F;04&#x2F;25&#x2F;can-recycling-be-bad-for-the-environment&#x2F;#71f06e63bec5\" rel=\"nofollow\">https:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;amywestervelt&#x2F;2012&#x2F;04&#x2F;25&#x2F;can-re...</a><p>[4] <a href=\"https:&#x2F;&#x2F;www.popularmechanics.com&#x2F;science&#x2F;environment&#x2F;a3752&#x2F;4291566&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.popularmechanics.com&#x2F;science&#x2F;environment&#x2F;a3752&#x2F;4...</a>", "by": "arcticbull"}, {"item_id": 21103167, "text": "I hope everyone concludes that the top level strategy everyone can implement is to reduce plastic use and demand at every level -- government, corporate, and, yes, individual.<p>Recycling is a tactic. Without a strategy, a tactic often won&#x27;t work and can even be counterproductive.<p>Reducing production is a strategy. We should always focus first on the strategy, then tactics.<p>I recorded a podcast episode on reducing being strategic and efficiency being tactical <a href=\"https:&#x2F;&#x2F;shows.pippa.io&#x2F;leadership-and-the-environment&#x2F;episodes&#x2F;183-reusing-and-recycling-are-tactical-reducing-is-strategic\" rel=\"nofollow\">https:&#x2F;&#x2F;shows.pippa.io&#x2F;leadership-and-the-environment&#x2F;episod...</a>.", "by": "spodek"}, {"item_id": 21102948, "text": "Ah the realities of the difficulty involved in recycling like for like come to the fore.<p>In some ways I think this situation has been exacerbated by proponents of plastic who have marketed it as &quot;infinitely recyclable&quot; for many years. That statement is technically true, in that there exists a process by which you can take post consumer plastic and reduce it back to its component parts for re-use. At the same time it ignores the reality that &#x27;original&#x27; plastic, as the end product of a chemical process, is quite pure.<p>Thus when you build a system that uses plastic to create products, if you build it to assume the purity levels of pre-consumer plastic, then the onus is on the recycler to create the same level of purity. Estimates on the cost of doing that range from 10x to 100x the cost of creating plastic out of raw pre-cursor chemicals. The reality is that there isn&#x27;t a market for $20 coffee cups over $2 coffee cups because they are &quot;100% post consumer&quot;.<p>I think getting the discussion on to a more realistic footing is a good one. It is much easier to make policy when you have a shot at working with markets rather than against them.<p>To that end, incinerating plastic to generate energy makes a lot of policy sense in a &#x27;peaker&#x27; plant. It isn&#x27;t &quot;reused&quot; in the sense of making more product but it does give additional benefit to the consumer.<p>I am also a proponent of structural re-use of post consumer plastics. It has good insulation value, especially when foamed, and building engineered walls with the post-consumer plastic providing a better than air insulation layer has a durable long term effect of reducing baseline energy load which goes to environmental control (heating&#x2F;cooling) in buildings.<p>It violates the stories that people have been told that their shopping bags will be infinitely recycled into new shopping bags, but it feels to me as a much more authentic way to represent recycling.", "by": "ChuckMcM"}, {"item_id": 21103102, "text": "My understanding of the situation is that recycled plastic is an inferior product, so there isn&#x27;t much demand for it.  NileRed did an interesting demonstration of recycling bottles here: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=xLftqtsiFBs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=xLftqtsiFBs</a> and he goes into some of the details about the resulting product that the recycling process creates.<p>I think the solution is to be careful about what we make from plastic, and what kinds of plastics we use in that case.  If we don&#x27;t waste in the first place, there is no need to recycle anything.  And if we do need to make something disposable, we can use something that is economic to recycle, like aluminum or glass.  It&#x27;s really just plastic that&#x27;s the problem, glass bottles are easy to reuse and aluminum cans can be melted down into aluminum that&#x27;s just as good as non-recycled aluminum.  (Maybe the energy cost of all that melting is high, but I think we are making strides towards more and more renewable electricity, so we might be better off using electricity instead of plastic.)", "by": "jrockway"}, {"item_id": 21102764, "text": "Summary: one company recycled, one incinerated (which creates a small amount of hazardous waste), and one company sent the bales to landfill.<p>In the U.K. (at least a few years ago) councils (ie local authorities) are supposed to try to meet targets for recycling. These come in various kinds:<p>1. Targets for the percentage of their waste that is recycleable<p>2. Targets for the percentage of the waste that is recycled<p>3. Targets for the total quantity of kinds of unrecycleable waste<p>Part 1 generally means trying to reduce the amount of non-recycleable waste that is produced. Partly this can be done by reducing waste in general, and partly by ensuring that waste is better categorised (in the EU there is a complicated categorisation scheme of waste, so eg hardcore is treated differently to various plastics which are different from food or batteries. Some categories are hazardous and have to be treated differently and may only be sent to certain facilities)<p>Part 2 generally means trying to increase the available facilities to recycle that waste (and decrease the capacity for recycleable waste [1])<p>Part 3 is generally about trying to guess how much waste will be produced (eg population&#x2F;large construction predictions)<p>[1] in the eu waste is typically handled by companies where one must pay a fee (or sell—the fee may be negative) for another company to handle the waste. By reducing the supply of landfill (or by giving incentives for recycling), the price for recycling can become low enough that it is preferable. If the price decreases sufficiently then further sorting of mixed waste may become profitable. In general the main method for trying to control recycling is trying to change market conditions (ie prices) rather than trying to impose and distribute quotas. There are various arguments among economists about which method is better (and whether the methods are actually different). Success is measured by trying to estimate how much of the waste in a local authority is recycled (by asking various waste disposal facilities, assuming no illegal disposal, and somehow figuring out what waste was sourced&#x2F;handled outside the local authority)<p>In the UK, incineration (aka Energy from Waste or EfW) is generally considered a “good” kind of waste disposal but slightly less good than recycling.", "by": "dan-robertson"}, {"item_id": 21103199, "text": "I don&#x27;t get what the big deal about putting plastic in the ground is.<p>It&#x27;s <i>literally oil</i>.  It belongs in the ground.<p>Or we can burn it for energy, and then do carbon sequestration, in which case it&#x27;ll need to end up back in the ground.", "by": "nostromo"}, {"item_id": 21103441, "text": "Research find: I came across this video. <a href=\"https:&#x2F;&#x2F;m.youtube.com&#x2F;watch?v=I_fUpP-hq3A\" rel=\"nofollow\">https:&#x2F;&#x2F;m.youtube.com&#x2F;watch?v=I_fUpP-hq3A</a><p>It says most plastics end up in incineration.<p>It also says plastics are separated using infrared technology.<p>I wonder if it is far from imagination to regulate the types of plastics available for use. What if all plastics for all single use purposes were restricted to a single kind of plastic.", "by": "nashashmi"}, {"item_id": 21103159, "text": "related video for those interested:\n<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=c8aVYb-a7Uw\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=c8aVYb-a7Uw</a>", "by": "itsmenow"}, {"item_id": 21103032, "text": null, "by": null}, {"item_id": 21102725, "text": "There is nothing wrong with landfill or incineration. Unlike metals, recycling plastic is not economic. So converting it to  energy by incineration is a pretty good option. In the future if the oil supplies will dwindle it might be economically viable to recycle plastic and then people (or maybe robots) will excavate those landfills for material. It is us taking care of the future generations. Isn&#x27;t it what all those Gertas of the world want?", "by": "golemiprague"}, {"item_id": 21105150, "text": "Fake news double speak.<p>Incinerating is recycling. The article even admits it below.<p>&gt; One problem with incineration as a recycling solution,<p>But only 1 in 3 recycling generates more outrage and more clicks. I&#x27;m sure A&#x2F;B testing agrees.", "by": "aaron695"}, {"item_id": 21102719, "text": "<a href=\"https:&#x2F;&#x2F;i.cbc.ca&#x2F;1.5299276.1569615441!&#x2F;fileImage&#x2F;httpImage&#x2F;image.jpg_gen&#x2F;derivatives&#x2F;original_780&#x2F;basel-action-network.jpg\" rel=\"nofollow\">https:&#x2F;&#x2F;i.cbc.ca&#x2F;1.5299276.1569615441!&#x2F;fileImage&#x2F;httpImage&#x2F;i...</a><p>Not sure what&#x27;s going on in this picture. Can I hazard a guess - the &quot;tracking device&quot; is a cheap smartphone?", "by": "u6eexrtxjjxjexr"}]