[{"item_id": 21102696, "text": "We were surprised to read this story and are not aware of discussions that would force us to change our product.<p>We believe people have a fundamental right to have private conversations. End-to-end encryption protects that right for over a billion people every day.<p>We will always oppose government attempts to build backdoors because they would weaken the security of everyone who uses WhatsApp including governments themselves. In times like these we must stand up both for the security and the privacy of our users everywhere. We will continue do so.<p>Will, Head of WhatsApp", "by": "wcathcart"}, {"item_id": 21100814, "text": "If the source code isn&#x27;t available for audit by 3rd parties (or yourself), and you can&#x27;t build it from source, then it was never really &quot;secure&quot; anyway. What lawmakers do or don&#x27;t say is just noise.<p>Platforms that rely on trust (in this case, trusting that FB isn&#x27;t doing bad things) provide very weak guarantees about privacy&#x2F;security. They could easily include a keylogger in WhatsApp and bypass the e2e encryption, for example, and us regular folk have no way of knowing.", "by": "brenden2"}, {"item_id": 21101890, "text": "Yes, this is something that literally everyone who reads HN will oppose. Meanwhile do you hear the deafening silence from the average Joe who thinks he has &quot;nothing to hide&quot;?<p>Don&#x27;t hate the politicians who keep pushing this. They&#x27;re just trying not to get fired. And the surest way to get fired in a western country right now is to be <i>seen</i> doing nothing about the terrorism problem and then having terrorist acts committed under your watch. So the politician asks the security forces &quot;what can we do to stop terrorism?&quot; Security says &quot;get us access to messages of terrorism suspects&quot;. Seems reasonable, let&#x27;s go ahead with it.<p>Yes, we know that it doesn&#x27;t stop with terrorism suspects. Then law enforcement wants to read the messages of drug kingpins, then drug suspects, then shoplifters, then jaywalkers, then <i>everyone</i>, just to be on the safe side.<p>But as long as people are told that they need to give up some privacy in exchange for security, they&#x27;ll take the latter every time.", "by": "nindalf"}, {"item_id": 21100714, "text": "&gt; Social media platforms based in the U.S. including Facebook and WhatsApp will be forced to share users’ encrypted messages with British police under a new treaty between the two countries, according to a person familiar with the matter.<p>This sounds as if the platforms are already sharing with the US authorities. So this being about them sharing it now with UK authorities.", "by": "Gys"}, {"item_id": 21100662, "text": "The title is editorialized - it&#x27;s not <i>just</i> Whatsapp, it&#x27;s all social media platforms.", "by": "bobthepanda"}, {"item_id": 21101578, "text": "The idea that moves like this will &quot;keep us safe&quot; is utterly preposterous; there are a multitude of other ways in which terrorists (or the boogeyman <i>de jour</i>) could communicate - are the UK and US governments going to insist on backdooring IRC, Slack and face-to-face conversations? Are they going to outlaw encryption libraries?<p>I truely fear for the future that western governments, in particular the 5 eyes members, are hell-bent on creating. They denounce China and Russia for their human rights records in one breath, and seek to strip us of privacy and personal rights in the next - the hypocrisy is simply staggering.<p>What&#x27;s perhaps even more frightening is that so many people believe that moves like this are to keep us safe, <i>will</i> keep us safe.<p>This can not end well...", "by": "GordonS"}, {"item_id": 21100803, "text": "from whatsapps official homepage, respectively  \n(<a href=\"https:&#x2F;&#x2F;faq.whatsapp.com&#x2F;en&#x2F;android&#x2F;28030015\" rel=\"nofollow\">https:&#x2F;&#x2F;faq.whatsapp.com&#x2F;en&#x2F;android&#x2F;28030015</a>, <a href=\"https:&#x2F;&#x2F;faq.whatsapp.com&#x2F;en&#x2F;general&#x2F;26000050\" rel=\"nofollow\">https:&#x2F;&#x2F;faq.whatsapp.com&#x2F;en&#x2F;general&#x2F;26000050</a>)<p><i>&gt;WhatsApp has no ability to see the content of messages or listen to calls on WhatsApp. That’s because the encryption and decryption of messages sent on WhatsApp occurs entirely on your device. Before a message ever leaves your device, it&#x27;s secured with a cryptographic lock, and only the recipient has the keys.[...]</i><p><i>&gt;A search warrant issued under the procedures described in the Federal Rules of Criminal Procedure or equivalent state warrant procedures upon a showing of probable cause is required to compel the disclosure of the stored contents of any account, which may include &quot;about&quot; information, profile photos, group information and address book, if available. In the ordinary course of providing our service, WhatsApp does not store messages once they are delivered or transaction logs of such delivered messages, and undelivered messages are deleted from our servers after 30 days. WhatsApp offers end-to-end encryption for our services, which is always activated</i><p>Very interested to see what their response is and if their promise holds that they do not have technical access to content but merely to account information.", "by": "Barrin92"}, {"item_id": 21101076, "text": "&gt;&gt; while the U.S. won’t be able to use information obtained from British firms in any cases carrying the death penalty.<p>Lol.  So I guess it cannot be used for actual terrorism.  They can use it up until an act of terrorism occurs.  Then, now that murder charges are on the table, they cannot use the same date source to catch the perpetrators?  The US isn&#x27;t going to waive the death penalty on every terror case.  That isn&#x27;t politically possible.<p>We have to just admit that US laws are increasingly incompatible with those of the rest of the world.  Treaties are getting harder and harder to reconcile.  The US needs to back off its departure from international norms.", "by": "sandworm101"}, {"item_id": 21101163, "text": "Nowhere in the article is backdoor mentioned. Only sharing data that is encrypted.<p>US an UK governments can&#x27;t just force FB to add backdoor. It would require new legislation.  FB must play ball for that to happen.<p>Since WhatsApp has forward secrecy and end-to-end encryption, giving access to encrypted data is not easy to use. There might be some useful metadata that helps though.", "by": "nabla9"}, {"item_id": 21101291, "text": "I am weirdly.. giddy about this development. The more goverments try so hard to publicly force companies to, effectively, mandate backdoors, the more public will be aware of it. Added benefit is that FB will lose some market share.<p>The sucky part is.. my mom loves Whatsapp. She was able to use it wo any issues. There are few alternatives that she was able to use so easily.<p>All that said, I wonder. What is the breaking point for people surveillance-wise? I was so wrong a lot about the tolerance already..", "by": "A4ET8a8uTh0"}, {"item_id": 21100783, "text": "Without more details I’m pretty skeptical, currently WhatsApp metadata gets turned over in warrant requests but no message content (metadata includes the times messages were sent and who they were sent from&#x2F;to).<p>It’d be a big deal to force FB to modify WhatsApp for message content interception and I think it’d be challenged in court.", "by": "fossuser"}, {"item_id": 21100687, "text": "Is there any more detailed info out there?<p>I would expect such an accord between countries to enable data sharing, not force companies to record more data. So I&#x27;m sceptical of the article&#x27;s claim for now.", "by": "AnssiH"}, {"item_id": 21102526, "text": "Why is this article Facebook focused? Is this click-bait? Telegraph and iMessage also support unbreakable end to end encryption.<p>Also, if we&#x27;re talking backdoors, why not just force Apple to unlock devices so that police can just read the messages in WhatsApp directly? That&#x27;s something I could get behind as it means the intelligence community has to at least have the physical device on hand.<p>Do people have actual links to this treaty they&#x27;re about to sign and what the exact wording is? I remember there being this 5-nation meeting in the summer with Canada and Australia that was specifically looking to lobby Facebook to open WhatsApp. Haven&#x27;t seen anything new since.", "by": "jarjoura"}, {"item_id": 21101154, "text": "Here is what is most frightening.<p>So let&#x27;s say this law passes BUT someone builds a really good open-source messenger.<p>You can&#x27;t install it now because you can&#x27;t side-load apps on devices.<p>You alpha geeks can but the other consumers can&#x27;t.<p>What we need is a law requiring some type of side loading.<p>It needs to be possible to go to a website, and install an app there directly and have it support all of the native platform features.", "by": "burtonator"}, {"item_id": 21103942, "text": "Going by the original Sunday Times (UK publication) article[0], it looks like this headline relates to _upcoming_ data sharing legislation which UK Home Secretary Priti Patel[1], who took that office this July, is expected to sign in October 2019.<p>It&#x27;s worth putting scrutiny both on the UK&#x27;s desire to create these backdoors in social media apps (a path that many would argue could lead to eventual exploitation and abuse of that backdoor by unintended parties), and also WhatsApp&#x27;s ability to deny the existence of such backdoors, now or in future.<p>[0] <a href=\"https:&#x2F;&#x2F;www.thetimes.co.uk&#x2F;article&#x2F;police-can-access-suspects-facebook-and-whatsapp-messages-in-deal-with-us-q7lrfmchz\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thetimes.co.uk&#x2F;article&#x2F;police-can-access-suspect...</a><p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Priti_Patel\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Priti_Patel</a>", "by": "jka"}, {"item_id": 21101452, "text": "Does anyone have any advice for what platform might be best to migrate to? I&#x27;m not overly concerned with group E2E, but it is a nice-to-have. Telegram and Discord seem like two of the most practical options, Keybase and Matrix seem like two of the most ideal from a security standpoint. I wonder what offers the best cross-section of features and user experience.", "by": "jchw"}, {"item_id": 21100794, "text": "When the article says &quot;share users’ encrypted messages&quot;, it&#x27;s not clear if it&#x27;s referring to the messages in their encrypted state, or is referring to messages have been decrypted before sharing.", "by": "markstos"}, {"item_id": 21101933, "text": "A backdoor that will be exploited by criminal third-parties. Even if you (against all sense and reason) trust the US and UK governments, this is a move that will expose your data to criminals.", "by": "_emacsomancer_"}, {"item_id": 21102584, "text": "Ok, I&#x27;m starting to think this article is click-bait. There is no need for a backdoor with WhatsApp because messages are stored on the device. If police have the device on hand, they should be able to see the messages (assuming they can unlock it.)<p><a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;safety&#x2F;groups&#x2F;law&#x2F;guidelines&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;safety&#x2F;groups&#x2F;law&#x2F;guidelines&#x2F;</a><p>&gt; International Legal Process Requirements<p>&gt; We disclose account records solely in accordance with our terms of service and applicable law. A Mutual Legal Assistance Treaty request or letter rogatory may be required to compel the disclosure of the contents of an account. Further information can be found here.", "by": "jarjoura"}, {"item_id": 21100724, "text": "Looking forward to what the people at Signal have to say about this.", "by": "kd3"}, {"item_id": 21101250, "text": "At what point did the world adopt the standard that all private communication is government business ?", "by": "Lordarminius"}, {"item_id": 21101054, "text": "Off the topic, how much can we trust the keyboard we are typing on (on mobile). They probably collect everything we type.<p>Wow !! Just realized that.", "by": "formatkaka"}, {"item_id": 21105875, "text": "I see some comments are raising this topic with nothing to hide.<p>But people on both sides, do you think it&#x27;s OK for you to have nothing to hide, but the government that rules you has something to hide?<p>For me it&#x27;s not so much whether I hide something or or, but rather that if  I&#x27;ll be living under nothing to hide paradigm then the people controlling that should also live under the same. And actually not only the people but rather the institutions. So if an institution is having access to all citizens data that is being collected then the citizens should also have transparency on each decision made and each cent spent by this institution at any time.", "by": "zaro"}, {"item_id": 21101803, "text": "Yes, this is exactly what I meant when I said that you either do what the Government says, or you go down. This is why I do not believe statements of privacy from Apple (such as we keep your data safe, 100% secure, etc.), for example. If they really have no backdoors or any other ways for the Government to access your data, then the Government would go after Apple. If the Government were to request your data, they would hand it over, right? Is this incorrect? If yes, why?", "by": "johnisgood"}, {"item_id": 21101735, "text": "I think the implication is just that Whatsapp has to hand over encrypted messages ...<p>I&#x27;d imagine if the police are then in control of the target mobile they can decrypt those messages.<p>Tbh, if my understanding is correct, I&#x27;m not sure I see any problem there. It&#x27;s targeted at specific individuals for good reason (presumably following a warrant process) and requires both the messages (from Whatsapp) and they keys (from the individual&#x27;s device). What&#x27;s the problem?", "by": "usgroup"}, {"item_id": 21103676, "text": "US Citizens don&#x27;t need to worry.  All of your private information will be turned over to the NSA &#x2F; US Gov.  If the US wants a US citizens private info, they just request it of the UK&#x27;s intel services.  The UK Intel services get it from Facebook, and they then hand it to the US Gov.  For your convenience.", "by": "HashThis"}, {"item_id": 21102771, "text": "&gt; &quot;The U.K. and the U.S. have agreed not to investigate each other’s citizens as part of the deal&quot;<p>Sweet Jesus this people are insane", "by": "cfv"}, {"item_id": 21103080, "text": null, "by": null}, {"item_id": 21100749, "text": "This is essentially a worrying prospect if these developments are actually implemented or advance further. The users trust in the social media service is breached if a backdoor where to be placed in their products (It also defeats the purpose of the end-to-end encryption argument). If you reside in the UK and especially in London, things have just become 500% more Orwellian.<p>&gt;Priti Patel, the U.K.’s home secretary, has previously warned that Facebook’s plan to enable users to send end-to-end encrypted messages would benefit criminals...<p>In London alone, it is not possible to pay for public transport with cash. A debit card&#x2F;oyster is required but for anonymous travel, an oyster can be topped up via cash and reduces transport surveillance, unlike using credit &#x2F; debit cards. Their reasons for doing this because it &quot;benefits criminals&quot; is echoing the &quot;ban encryption&quot; nonsense.<p>&gt; The U.K. and the U.S. have agreed not to investigate each other’s citizens as part of the deal...<p>This I don&#x27;t believe.<p>EDIT: Use a oyster card for public anonymous transport, refrain from using a credit &#x2F; debit card for this.", "by": "rvz"}, {"item_id": 21100651, "text": "Curious what this means for other end-to-end encrypted services such as iMessage.", "by": "Nextgrid"}, {"item_id": 21100775, "text": "It&#x27;s interesting this is even necessary -- Australia&#x27;s legislation to this effect passed last year could&#x27;ve been used just as easily (in combination with the 5-EYES pact).<p>(As an aside, there was meant to be a parliamentary review of the Assistance and Access Act earlier this year -- but I haven&#x27;t heard anything about it.)", "by": "cyphar"}, {"item_id": 21102500, "text": "&gt; serious criminal offenses including terrorism and pedophilia<p><i>sigh</i><p>&quot;Pedophilia&quot; is not a crime, child rape is.", "by": "concordDance"}, {"item_id": 21102038, "text": "IMHO editorializing this as a ‘back door’ is inflammatory.<p>Users need to learn to not have any expectation of privacy when using social networks. It extends far beyond PII leaks.<p>Perhaps complaints should be directed at the root of corruption&#x2F;abuse of such systems, at least as much as the capability itself. The capability is inherent to the technology just as tapping a phone line is.<p>Telcos have to provide interception capabilities (CALEA in the US) or they are not allowed to operate. This has been true for decades, most people do not know how that works but they do know it is possible.  \nAs these social media communications services become more entangled in our lives perhaps they too could be deemed essential infrastructure and treated as utilities.", "by": "lttlrck"}, {"item_id": 21103569, "text": "Just a reminder that anytime they breach communications like this, it&#x27;s because they want to be able to spy on their own citizens in order to subvert and control opposition political movements. For example, climate activism, whistle blowers (e.g. Snowden, Reality Winner, the guy that talked about the Ukraine deal if it wasn&#x27;t an official CIA leak), animal rights, anti-imperialists, etc.", "by": "tehjoker"}, {"item_id": 21101348, "text": "In other news: US, UK subjects agree to stop using WhatsApp in favor of Telegram and Signal:<p><a href=\"https:&#x2F;&#x2F;telegram.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;telegram.org&#x2F;</a><p><a href=\"https:&#x2F;&#x2F;www.signal.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.signal.org&#x2F;</a><p>These are free software, not controlled by a giant corporation (although both are limited liability companies; Telegram in London&#x2F;Dubai, Signal in San Francisco IIANM); with the developer&#x2F;company not having unencyrpyed access to your data.", "by": "einpoklum"}, {"item_id": 21103207, "text": "Feels like the perfect time to read the &quot;Anatomy of the State&quot; by Murray Rothbard. It is only 62 pages long.<p>You can find the book here: <a href=\"https:&#x2F;&#x2F;upload.wikimedia.org&#x2F;wikipedia&#x2F;commons&#x2F;4&#x2F;45&#x2F;Anatomy_of_the_State.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;upload.wikimedia.org&#x2F;wikipedia&#x2F;commons&#x2F;4&#x2F;45&#x2F;Anatomy_...</a>", "by": "johnisgood"}, {"item_id": 21100789, "text": "Another reminder that there are no secure platforms; there are <i>protocols</i> with (one hopes) the potential to be secure. The difference becomes more important by the day.", "by": "theobeers"}, {"item_id": 21100784, "text": "There&#x27;s a funny,rag level newspaper in the UK, called DailyMail. I suggest reading comments under the article about this, gives a good idea of how naive people can be.\n<a href=\"https:&#x2F;&#x2F;www.dailymail.co.uk&#x2F;news&#x2F;article-7514787&#x2F;Facebook-forced-reveal-encrypted-messages-terror-suspects-paedophiles.html#comments-7514787\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dailymail.co.uk&#x2F;news&#x2F;article-7514787&#x2F;Facebook-fo...</a>", "by": "cosmodisk"}, {"item_id": 21106892, "text": "UK seems to be doing all sorts of crazy shit right now so not all that surprised that people are finding out about this via news", "by": "Havoc"}, {"item_id": 21101057, "text": "Why would anyone wanting to exchange incriminating information use Whatsapp or Facebook?<p>It seems this would only serve to catch the most stupid small-time criminals.", "by": "pier25"}, {"item_id": 21102416, "text": "Not my area of expertise but would it not be relatively easy for someone to make their own app using open source and put it in an apk for ordinary phones?<p>I&#x27;ve messed around with the open source cryptography libs before and I don&#x27;t see why someone could not do that.<p>There&#x27;s even a fair bit of advice about how not to misuse such libs.", "by": "lordnacho"}, {"item_id": 21101993, "text": "The title is inaccurate. This does not require a backdoor. The agreement changes nothing about the use of encryption.<p><a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;mmasnick&#x2F;status&#x2F;1177979730932297728?s=21\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;mmasnick&#x2F;status&#x2F;1177979730932297728?s=21</a>", "by": "mayop100"}, {"item_id": 21102976, "text": "Mods: Is this title accurate? It makes it sounds like an encryption back door, but from reading it sounds more like social media companies being forced to provide the cyphertext.<p>(with the authorities then being in a position to compel the end users to give access to devices).", "by": "ac2u"}, {"item_id": 21104571, "text": "I am not one to believe what I read on Bloomberg but the story does say &quot;will be forced to share <i>encrypted</i> messages...&quot;<p>If that&#x27;s all this is, good luck to them doing anything with those.", "by": "natch"}, {"item_id": 21102751, "text": "Mods, please fix the post title. The idea of a backdoor is speculation that is not substantiated by the article.<p>&quot;will be forced to share users’ encrypted messages with British police&quot;<p>So far, all the article is saying is that <i>ciphertext</i> will have to be shared.", "by": "m0dest"}, {"item_id": 21101319, "text": "So to which messenger should we finally switch to? Telegram, Signal, Threema, Wire or some other newcomer?", "by": "nairboon"}, {"item_id": 21104275, "text": "&gt; Social media platforms based in the U.S. including Facebook and WhatsApp will be forced to share users’ encrypted messages with British police<p>If true, I wonder if this includes other US based apps like Signal", "by": "whycombagator"}, {"item_id": 21101322, "text": "Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.", "by": "ISL"}, {"item_id": 21102231, "text": "Is this literally a <i>treaty</i> that will be submitted to the US Senate for ratification and thus carry the force of law, or is it merely an executive branch agreement on cooperation? Does anyone have a link to the actual treaty text?", "by": "nradov"}, {"item_id": 21102669, "text": "Encryption are &quot;munitions&quot;, right? I wonder if there&#x27;s an argument in the U.S. that this violates our right to &quot;bear arms&quot;.<p>It&#x27;s also interesting how the Left and Right flip positions when arms are digital.", "by": "fortran77"}, {"item_id": 21101752, "text": "So we are back to using code words,  one time pads etc?<p>This will do nothing except intrude on civil rights.", "by": "jimnotgym"}, {"item_id": 21101977, "text": "&quot;Social media platforms based in the U.S. including Facebook and WhatsApp will be forced to share users’ encrypted messages with British police&quot;<p>Does this mean they&#x27;re sharing ciphertext or plaintext? Anyone know?", "by": "corndoge"}, {"item_id": 21100802, "text": null, "by": null}, {"item_id": 21101123, "text": "One can infer that the NSA cannot break strong encryption used in WhatsApp.", "by": "verizonuser"}, {"item_id": 21102074, "text": "If you&#x27;re logically consistent, then outlawing encryption implies outlawing computers and mathematics.<p>We are venturing straight into a totalitarian nightmare, and   are totally fine with it.", "by": "lone_haxx0r"}, {"item_id": 21102736, "text": "Sounds familiar...<p>Ohh, right: <a href=\"https:&#x2F;&#x2F;queue.acm.org&#x2F;detail.cfm?id=2508864\" rel=\"nofollow\">https:&#x2F;&#x2F;queue.acm.org&#x2F;detail.cfm?id=2508864</a>", "by": "phkamp"}, {"item_id": 21102028, "text": "I agree it would be good for police to be able to look into a criminal’s phone, but how will they actually achieve this without wrecking the encryption for everyone?", "by": "jonplackett"}, {"item_id": 21102199, "text": "There are really smart and empowered people just waiting for really dumb but empowered people to make the move that opens the path to constant mass surveillance.", "by": "andrerm"}, {"item_id": 21103900, "text": "<a href=\"https:&#x2F;&#x2F;outline.com&#x2F;9LpW2E\" rel=\"nofollow\">https:&#x2F;&#x2F;outline.com&#x2F;9LpW2E</a>", "by": "neonate"}, {"item_id": 21101898, "text": "What are the alternatives to facebook and whatsapp? Is there anything open source and p2p that can be used to replace facebook?", "by": "guiomie"}, {"item_id": 21102919, "text": "I have long stopped using American social media for anything. I think everyone else should do the same.", "by": "Fakira"}, {"item_id": 21102280, "text": "Is this treaty public? Where is it?", "by": "andrerm"}, {"item_id": 21101041, "text": "Isn&#x27;t there any laws against this?<p>I would think this should at least be against one or another amendment for Americans?", "by": "eitland"}, {"item_id": 21100888, "text": null, "by": null}, {"item_id": 21103004, "text": "I wonder does this also apply to services like Apple iMessage", "by": "johnflan"}, {"item_id": 21101209, "text": "Not sure what they’re planning to do with these encrypted messages though.", "by": "tinus_hn"}, {"item_id": 21102241, "text": "I thought there are backdoors already. This must be a diversion.", "by": "decafbad"}, {"item_id": 21101212, "text": "I think everyone needs to focus on protocol more than apps per se.", "by": "villgax"}, {"item_id": 21101285, "text": "Ok, so next years WhatsApp will have backdoor and ads.", "by": "akerro"}, {"item_id": 21101705, "text": "I suspect Facebook has wanted an excuse to remove the end to end encryption and avoid the negative publicity at the same time. Done.", "by": "jcriddle4"}, {"item_id": 21102076, "text": "NOBUS is going to work well. Not.", "by": "newman314"}, {"item_id": 21101672, "text": "&gt; Social media platforms based in the U.S. including Facebook and WhatsApp will be forced to share users’ encrypted messages with British police under a new treaty between the two countries, according to a person familiar with the matter.<p>Would Apple&#x27;s iMessage qualify? (I can&#x27;t read the whole article because of the paywall).", "by": "chooseaname"}, {"item_id": 21102347, "text": "In The Netherlands a government VPN solution was left unpatched for many month, exposing critical infrastructure to any third-party hacking nation state.<p>I&#x27;m not a right-wing anti-government nutcase. I do believe that the government will not be able to keep such a back door secure.", "by": "louwrentius"}, {"item_id": 21101126, "text": "@mods pls change title", "by": "avip"}, {"item_id": 21100746, "text": "Is Signal still safe?", "by": "JohnJamesRambo"}, {"item_id": 21101894, "text": "why are they exempting Apple&#x27;s iMessage then?", "by": "perfectstorm"}, {"item_id": 21102055, "text": "Meanwhile, the US government (mostly Trump) is banning Huawei equipment over spying concerns. Apparently the only concern is that we weren&#x27;t the ones doing the spying.<p>This really hurts our credibility on a government level outside the Five Eyes.", "by": "dehrmann"}, {"item_id": 21100637, "text": "TFA says just UK...", "by": "ga-vu"}, {"item_id": 21103092, "text": "In before a gov&#x27;t forces someone into pregnancy through the &quot;front door&quot; just cuz", "by": "daodedickinson"}, {"item_id": 21102998, "text": null, "by": null}, {"item_id": 21101172, "text": "Police can only search what belongs to the company.  If it the data is yours, and the keys are yours, then the company can only provide it by theft (if at all).", "by": "angel_j"}, {"item_id": 21100679, "text": "If WhatsApp is end to end encrypted, how can they share the messages?", "by": "nicky0"}, {"item_id": 21100624, "text": "Excellent.", "by": "cheez"}, {"item_id": 21102670, "text": "Wtf is HNs lack of knowledge of history?<p>We have known since at <i></i><i>least</i><i></i> 1997 that all Cisco (and other) equipment has had backdoors in them.<p>Like why the fuck would you even be surprised at this at this point.<p>EVERYTHING YOU DO IS CAPTURED.<p>Downvote away yee who are uninformed", "by": "samstave"}, {"item_id": 21102089, "text": "It&#x27;s the Russians that continuously screw us up the only want control to run their gang activity,sex trafficking child molesting pure EVIL into our country the one&#x27;s that bring this and terrorism should be put to death they are also racist natzi white supremacist", "by": "screwunatzi"}, {"item_id": 21102884, "text": null, "by": null}, {"item_id": 21100938, "text": "1) If someone wants to find something you are &quot;hiding&quot;, they will anyway. It&#x27;s always been like this. Encryption is never a protection against this.<p>2) Personally I still think e2e encryption is not a secure solution on operating systems that runs godmode 3rd party, eg. google play services: it relies on a key that can be stolen too many ways too easily. Signal included.<p>3) internet eons (20 years) ago we nearly all used plain text IRC, closed source ICQ, AIM, etc, apart from a few. Recently I started to question the usefulness of &quot;encrypt everything&quot;: we do need a way to verify the content from end to end, but is encryption really the way to do so? Are there any other ways, signatures, hashes, etc?<p>4) All that said, I&#x27;m not surprised. Skype used to be p2p, until M$ moved it to server-client, because &quot;battery life&quot;. Everything is moving back to the Eternal Mainframe in this cycle.", "by": "pmlnr"}]