[{"item_id": 21107495, "text": "I had pretty much this exact thing happen to me. I had left one company to go work for a startup. The startup failed. I was contracted to come back to the first company to cover for a former teammate who was going on maternity leave.<p>For insurance they put a sizeable early leave monetary penalty into the contract. I thought just giving my word would be sufficient but I had no plans to leave so didn&#x27;t matter either way.<p>During the contract I did well on an online programming contest that turned out to be a recruiting tool. I was made a now or never offer I shouldn&#x27;t refuse but I did explaining that I was committed to my current contract. When discussed, they we&#x27;re willing to payout the penalty to have me start earlier.<p>At this point I thought hard about my personal ethics on this and it came down to if it was based on trust, I would have stuck it out to the end but since they made it monetary I was playing by their set out rules and had no qualms (well maybe still a little) about going before the end.", "by": "karmakaze"}, {"item_id": 21111693, "text": "I took a very interesting class at university simply called &quot;Power&quot;. The textbook was &quot;The 48 laws of power&quot; and power seemed to boil down to one thing: Making someone do something they otherwise wouldn&#x27;t do.<p>Money is a type of distilled power, but it&#x27;s often better to use non-monetary power to influence behavior if possible.", "by": "pontifier"}, {"item_id": 21111009, "text": "When I read this, I thought it was a bit psychology 101. Monetary punishment has nothing to do with being late to pickup a child. While the punishment of apologizing to a teacher has a direct link to the event. As wrong as taking a child&#x27;s console&#x2F;phone&#x2F;tablet away when they punched someone at school or w&#x2F;e.", "by": "1ark"}, {"item_id": 21108095, "text": "The original study is here: <a href=\"https:&#x2F;&#x2F;rady.ucsd.edu&#x2F;faculty&#x2F;directory&#x2F;gneezy&#x2F;pub&#x2F;docs&#x2F;fine.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;rady.ucsd.edu&#x2F;faculty&#x2F;directory&#x2F;gneezy&#x2F;pub&#x2F;docs&#x2F;fine...</a>", "by": "DVassallo"}, {"item_id": 21106364, "text": "If they wanted to completely end tardiness from parents they should fine the teacher when parents are late. The guilt would be overwhelming.", "by": "aflag"}, {"item_id": 21105640, "text": "Great, the way out of capitalism! Time &gt; money.", "by": "pieterk"}, {"item_id": 21106914, "text": "Sex is what makes people do what they do.", "by": "boyadjian"}]