[{"item_id": 21104553, "text": "An interesting challenge is to try to generate this puzzle, or one like it, once you know the answer.<p>Given any existing grid, you can implement a &quot;step&quot; function in code that generates the next grid describing it. You&#x27;ll always find a cycle by stepping over and over (the numbers can never get too high, so the space is finite, so you&#x27;ll always converge to a cycle rather than diverging). The goal, then, is to find a cycle of length 2 (or, better yet, a fixed point that maps to itself).<p>I just coded this up to try it out, and one simple starting point gave a cycle of length 27. I tried randomly generating starting points and I can generate a 3-cycle but haven&#x27;t hit any 2-cycles yet. So maybe there&#x27;s another trick to get the configuration from the puzzle.<p>Edit: nevermind, I misinterpreted the puzzle. All letters in the grid count, so &quot;FOUR F&#x27;S&quot; has two Fs and an S. Accounting for that, a randomized approach quickly finds a 2-cycle. But I guess it&#x27;s interesting that a relatively minor tweak like that has a different outcome.", "by": "alangpierce"}, {"item_id": 21107257, "text": "These squares don&#x27;t describe each other because you need external information, namely of the English language.<p>It&#x27;s like saying that 56 describes a house. Yes, page 56 of some architecture book might show a house. But saying that 56 describes that house is just wrong.<p>The puzzle is flawed.", "by": "amelius"}, {"item_id": 21106540, "text": "I wish puzzles would indicate whether it&#x27;s something language&#x2F;decimal-notation based, vs something fundamentally mathematical based, before spending time on it", "by": "Aardwolf"}, {"item_id": 21105013, "text": "I gave up, and boy am I glad I did.", "by": "putzdown"}, {"item_id": 21104664, "text": "I don&#x27;t believe anyone anywhere could solve that.", "by": "mattmaroon"}, {"item_id": 21107177, "text": "I think this is a form of autogram: <a href=\"https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Autogram\" rel=\"nofollow\">https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Autogram</a><p>The article even provides a pair of mutually-describing sentences. Hofstadter has described these in at least one of his books, but I don&#x27;t recall if he discussed how to generate them.", "by": "nemo1618"}, {"item_id": 21107704, "text": "This “puzzle” reminded me of Nick Land’s essay “Qabbala 101”, which remarks on patterns found in “primitive numerization” schemes such as this.\n<a href=\"http:&#x2F;&#x2F;files.eshkolot.ru&#x2F;C1_Nick_Land.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;files.eshkolot.ru&#x2F;C1_Nick_Land.pdf</a>", "by": "Bendy"}]