[{"item_id": 21101183, "text": "Coauthor here. As it turns out, this is one of three papers released near-simultaneously that uncover the extent of tracking on TVs or IoT devices more generally. I&#x27;ve written up a survey of the three papers and what I thought were especially interesting findings, along with some thoughts on why targeted advertising as a business model for TV platforms is harmful to users: <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;random_walker&#x2F;status&#x2F;1177570679232876544\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;random_walker&#x2F;status&#x2F;1177570679232876544</a><p>Direct links to the other two papers:<p><a href=\"https:&#x2F;&#x2F;moniotrlab.ccis.neu.edu&#x2F;wp-content&#x2F;uploads&#x2F;2019&#x2F;09&#x2F;ren-imc19.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;moniotrlab.ccis.neu.edu&#x2F;wp-content&#x2F;uploads&#x2F;2019&#x2F;09&#x2F;r...</a><p><a href=\"https:&#x2F;&#x2F;arxiv.org&#x2F;pdf&#x2F;1909.09848.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;arxiv.org&#x2F;pdf&#x2F;1909.09848.pdf</a>", "by": "randomwalker"}, {"item_id": 21102497, "text": "Installed pi-hole recently and wasn&#x27;t surprised to see all my devices making requests to check in constantly.", "by": "bravoetch"}, {"item_id": 21101693, "text": "What are your thoughts about server-side ad insertion?<p>One of your captured urls in the paper looks like it might be part of a VAST request, which could lead to SSAI.", "by": "thakoppno"}, {"item_id": 21101884, "text": "In a way, the world of <i>1984</i> was <i>too humanistic</i> - imagining a telescreen having a camera pointed back at the human viewer, ambiguously judged by another human viewer. In the current panopticon being built out, surveilling humans for their poorly-specified human behavior is actually not important. Rather it&#x27;s only worth surveilling each human&#x27;s effects in the technological realm. The system doesn&#x27;t particularly care how you lash out, just about which ways you conform.", "by": "mindslight"}]