[{"item_id": 21102892, "text": "Pretty much every synthesiser for 15 years had the same two-row LCD interface as the DX7. My first job out of university in 1995 was as assistant editor of Keyboard Review magazine (UK), and the vast majority of synths I reviewed - wonderful beasts from Ensoniq, Roland, Korg, technologically way ahead of the DX7 - had exactly the same bloody awful UI. Akai&#x27;s S-series samplers, which everyone was using back then, did provide a decent display... but at a price. When someone finally made a sampler affordable by the home market (Ensoniq&#x27;s ESI-32) it too had a greatly compromised display, though at least four rows rather than two.<p>I&#x27;ve always suspected this actually influenced the electronic music styles of the time. The 90s were the start of the analogue resurgence. Sure, an 808 or a 303 is a fabulous-sounding beast in itself. But twiddling knobs is just so much more rewarding and responsive than spending hours squinting at a two-line LCD.", "by": "Doctor_Fegg"}, {"item_id": 21103536, "text": "The DX7 is directly the reason I&#x27;m where I&#x27;m at in the world. As a kid, when the DX7 was new, I&#x27;d spend hours making sounds and writing music on it. I explicitly went to uni (an Electrical&#x2F;computer systems Engineering degree) to learn how to make my own synth. I learnt pretty much how in the first 12 months (although I never got around to making my own). I got head hunted from uni and here I am 3 decades later.<p>If it weren&#x27;t for the DX7 I would have stayed in the classical instrument stream and done a music degree. I wouldn&#x27;t be on HN today.<p>So, it&#x27;s great that people are still applying new tech and gizmos to the DX7. It&#x27;s got a special place in my heart.", "by": "cmroanirgo"}, {"item_id": 21103075, "text": "I have spent a few months this year trying to wrap my head around FM synthesis. Unfortunately I don’t think the DX7 is hard to program just because of the user interface. I have read up and thoroughly understand the theory behind FM synthesis. I have followed various tutorials to design patches. At the end of the the day FM synthesis is powerful but it is inherently much less intuitive and also much easier to get horrible ugly sounds out of than something like the subtractive synthesis seen on most analogue synths.<p>The reason FM synths need to be digital is that very precise pitch ratios between oscillators are important in order to get good sounds. For example you may want to modulate the pitch of one oscillator with another exactly a fifth up (3 to 2 frequency ratio). It can easily sound terrible if the fifth up oscillator goes slightly out of tune.<p>These sort of precision and nonlinearity in output are also one thing that makes FM synthesis a lot harder to use.", "by": "dontreact"}, {"item_id": 21111604, "text": "This looks like basically a MIDI controller that has some software so it can send presets to the DX7.<p>I wonder how much those touch sensors cost, because I&#x27;m sure it could quite easily be used as generic MIDI controller.", "by": "brokenmachine"}, {"item_id": 21103204, "text": "I had a dx7.  I will vouch for it being difficult to program decent sounds for.  Despite having a map of how the 6 oscillators interacted on top of the \nKeyboard.  See photo:\n<a href=\"https:&#x2F;&#x2F;mn2s.com&#x2F;news&#x2F;features&#x2F;brief-history-yamaha-dx7&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;mn2s.com&#x2F;news&#x2F;features&#x2F;brief-history-yamaha-dx7&#x2F;</a><p>It didn’t help that in the 90s when I had that keyboard they’re weren’t many online sources of info about it..<p>The dx7 was neat but couldn’t make very realistic instrument sounds.\nVery popular though.", "by": "acomjean"}, {"item_id": 21103281, "text": "For those who are interested in the DX7 but can&#x27;t obtain one, there&#x27;s a VST version that is literally a perfect recreation. It&#x27;s called Dexed and you can get it here:<p><a href=\"https:&#x2F;&#x2F;asb2m10.github.io&#x2F;dexed&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;asb2m10.github.io&#x2F;dexed&#x2F;</a><p>Personally, I&#x27;m a synth nut and Dexed is my go-to when I&#x27;m in the mood for FM, but I prefer good old subtractive synths over FM most of the time.", "by": "IAmGraydon"}, {"item_id": 21102831, "text": "The DX7 uses FM synthesis which is all digital meaning one can more or less the same results with vastly more flexible interface (Bazille, Dexed, Operator etc.) all inside a computer software. Despite that fact this is incredibly cool and impressive!", "by": "cawlin"}, {"item_id": 21105920, "text": "For anyone interested in FM synthesis without the DX7 &quot;baggage&quot; and more limitations which help you steer away from too harsh sounds, check out the Elektron Digitone.<p>As an added bonus you get a very capable sequencer and it can act as a groovebox on its own for quick sketches.", "by": "malthaus"}, {"item_id": 21103365, "text": "Has anyone tried to take the parameters of an FM synthesis chain as if they were the hash of a particular timbre?<p>In other words, you start with a recording of the sound you&#x27;re after and then just start brute-force iterating through the parameter choices until an analysis of the output looks close enough to the input?<p>I mean, fftw3 takes about a full minute on my Chromebook to measure the quickest algo. So I&#x27;d hope that generating output analyses would be fairly snappy...", "by": "jancsika"}, {"item_id": 21102643, "text": "There is this:<p><a href=\"https:&#x2F;&#x2F;www.musicradar.com&#x2F;news&#x2F;tech&#x2F;dtronics-dt7-has-just-made-the-yamaha-dx7-easier-to-use-636276\" rel=\"nofollow\">https:&#x2F;&#x2F;www.musicradar.com&#x2F;news&#x2F;tech&#x2F;dtronics-dt7-has-just-m...</a>", "by": "jacquesm"}, {"item_id": 21103007, "text": "Nowadays, Patch Base is the way to go.<p><a href=\"https:&#x2F;&#x2F;coffeeshopped.com&#x2F;patch-base&#x2F;editor&#x2F;yamaha-dx7\" rel=\"nofollow\">https:&#x2F;&#x2F;coffeeshopped.com&#x2F;patch-base&#x2F;editor&#x2F;yamaha-dx7</a>", "by": "brandonmenc"}, {"item_id": 21102980, "text": "Wow, very cool! This seems like a great thing to pair with a DX7 and a Reface DX [1], which seems like Yamaha&#x27;s attempt to take the linage of the DX7 and do it justice in modern form with an increased emphasis on usability. I once had a DX7, and I loved it to pieces.<p>The DX7 is one of my favorite synthesizers in history, and its software successor, FM8 [2] by Native Instruments is my favorite synthesizer that I regularly use. As with many of the 61-key workhorse keyboards of the 80s, the DX7 is extremely solidly built and has excellent synth key action which makes it a joy to play. It&#x27;s not weighted, but it also doesn&#x27;t feel like a toy, and the velocity range (while oddly bound to 0-100, one of its few unnecessary flaws) is very playable throughout the entire range. Beyond that, the DX7 as a synthesizer is technologically a legendary synthesizer that contributed heavily to 80s and 90s music [3][4]. It had great presets, the most recognizable of which is the default patch which is it&#x27;s rendition of a Rhodes piano. Many folks bought it for that purpose, and you&#x27;ll that patch in many songs that you may recognize.<p>The DX7 uses a type of synthesis called FM synthesis, which (sort of like FM radio encoding) allows any of its 6 operator oscillators to be used additively or as an operator which feeds its signal to one or many other oscillators, potentially in a cyclical manner. Operators can use frequency multipliers and dividers with base oscillators (I believe only sine waves for the DX7 although there&#x27;s a fair amount more in FM8) so that you can have operators sound harmonically many octaves above a base oscillator, or vice versa. In FM8, you can use multipliers anywhere from 0-64 with a 0.001 resolution. Through careful usage of envelopes and oscillator feedback structures, you can go quite a bit beyond your usual virtual analog style subtractive synthesis. but you can do quite a bit of semi-realistic physical modeling and beyond, whether it be orchestral instruments, drums, or punchy cartoonish caricatures of either. It&#x27;s easily the most versatile form of non-sample based synthesis I&#x27;ve ever found.<p>The wonderful thing about FM8 is how intuitive and flexible the synth gets once you begin to get used to it. The envelope editor makes it straightforward to create arbitrary stage envelopes with the curvature of each stage customizable and really straightforward to visualize. I personally lean on FM synthesis so heavily for a variety of reasons. It&#x27;s a taste thing, but it&#x27;s also a matter of practicality. If you&#x27;re judicious about patches you use, it&#x27;s easier to tune FM instruments to make them take up less spectral space, and clash with other elements in a mix without extra post-processing. Additionally that they tend to be quite CPU light, so the number of distinct instances you can run in realtime without maxing out your CPU is a fair amount higher than hefty virtual analog synths like Massive (it may potentially be the same for Spire). Finally, when it comes to soundscape design possibilities, long envelopes and frequency modulation open the door to ambient shape design that is borderline impossible to do otherwise. I believe this is why the DX7 became Brian Eno&#x27;s favorite synth [4].<p>FM8 is not free (although it and Komplete were some of the best investments I ever made in my music) but there are a variety of free DX7 synths out there that you can use, some of which are compatible as editors for DX7 SysEx patches. The one I&#x27;d recommend is Dexed [5], which is open source and pretty nice, because you can use it with the giant free DX7 patch ecosystem that&#x27;s built up over decades. Give that a go with REAPER (trialware), LMMS (open source but a little hard to use with VST&#x2F;AU plugins), Live (evolving and likely the best for professional musicians to create on), or a DAW of your choice and you&#x27;re in business. Which reminds me, I have a track I need to finish...and based on my commentary, you can probably accurate guess whether there&#x27;s at least 1 instance of DX7 on it.<p>[1] <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=O3PGO_DiuYU\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=O3PGO_DiuYU</a><p>[2] <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=lx_L9dPIa78\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=lx_L9dPIa78</a><p>[3] <a href=\"https:&#x2F;&#x2F;reverbmachine.com&#x2F;blog&#x2F;exploring-the-yamaha-dx7\" rel=\"nofollow\">https:&#x2F;&#x2F;reverbmachine.com&#x2F;blog&#x2F;exploring-the-yamaha-dx7</a><p>[4] <a href=\"http:&#x2F;&#x2F;bobbyblues.recup.ch&#x2F;yamaha_dx7&#x2F;dx7_examples.html\" rel=\"nofollow\">http:&#x2F;&#x2F;bobbyblues.recup.ch&#x2F;yamaha_dx7&#x2F;dx7_examples.html</a><p>[5] <a href=\"https:&#x2F;&#x2F;asb2m10.github.io&#x2F;dexed&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;asb2m10.github.io&#x2F;dexed&#x2F;</a>", "by": "yowlingcat"}]