[{"item_id": 21109556, "text": "When I applied to a major university at age 17, I put down two potential majors. One was Geology.<p>I didn&#x27;t attend that university. I went for two years to a local college and didn&#x27;t bother to declare a major the first year. The second year, I declared as a History major because I was taking a lot of history classes and my counselor was in the history department. It let me keep the same counselor.<p>I dropped out in part because I knew two people with substantial amounts of college who were delivering newspapers. One was living with his mother. One was financially dependent upon his wife.<p>I figured I could deliver newspapers for a living without a pile of student loans and my quality of life would be higher without the student loans. I decided I would return to college if I ever had any idea what I wanted to do with a degree.<p>I eventually decided I wanted to be an urban planner, which was a good reason to go back to school. Most urban planning programs are Masters degrees. You typically have a Bachelor&#x27;s in something else.<p>I decided to pursue a Bachelor&#x27;s in Environmental Resource Management as background. I felt I needed to understand the underlying natural environment in order to do good things with the built environment.<p>Most Environmental Studies programs began in Geology departments. It&#x27;s possible that I might have ended up sort of where I am currently even without the long, winding detour in between.", "by": "DoreenMichele"}, {"item_id": 21107466, "text": "Ive been reading some books about innovations and it often seems like this. A lot of random encounters (is word serendepity correct?) coming together to create new idea.<p>Now if only there was more options for this random encounters on the Internet. For me only HN and reading nonfiction helps in this", "by": "qnsi"}, {"item_id": 21105834, "text": "Reminds me a bit of a scene in <i>No Country for Old Men</i>, when Chigurh is in the hotel room.<p><i>If the rule you followed brought you to this - of what use was the rule?</i><p><a href=\"https:&#x2F;&#x2F;youtube.com&#x2F;watch?v=_fv7XSrrI9M\" rel=\"nofollow\">https:&#x2F;&#x2F;youtube.com&#x2F;watch?v=_fv7XSrrI9M</a>", "by": "keiferski"}, {"item_id": 21104127, "text": "Backtracking life decisions like that is fun :)<p>But I find it hard to believe that HPC in the cloud is cheaper than HPC on bare metal, assuming high load most of the time. For computing weather models, that should he the case.", "by": "dbrgn"}, {"item_id": 21109036, "text": "&gt; I think about what gets me to make certain turns and decisions in life. For example, co-founding Cloudrun<p>Huh. Google Cloud Platform has a product with the same name now.<p><a href=\"https:&#x2F;&#x2F;cloud.google.com&#x2F;run&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;cloud.google.com&#x2F;run&#x2F;</a>", "by": "alephnan"}]