[{"item_id": 21107084, "text": "The implication in the article is that the exhaust gases may not be as significant as the metallic debris that vaporizes in the atmosphere. It sounds very unnatural for the atmosphere to have to deal with this, but here’s an interesting quote regarding meteorites (natural metallic debris):<p>“Estimates for the mass of material that falls on Earth each year range from 37,000-78,000 tons. Most of this mass would come from dust-sized particles.” <a href=\"http:&#x2F;&#x2F;curious.astro.cornell.edu&#x2F;about-us&#x2F;75-our-solar-system&#x2F;comets-meteors-and-asteroids&#x2F;meteorites&#x2F;313-how-many-meteorites-hit-earth-each-year-intermediate\" rel=\"nofollow\">http:&#x2F;&#x2F;curious.astro.cornell.edu&#x2F;about-us&#x2F;75-our-solar-syste...</a>", "by": "aristophenes"}, {"item_id": 21106845, "text": "OP is a 2017 article that mentions an upcoming 2018 report that has since been published here <a href=\"https:&#x2F;&#x2F;www.esrl.noaa.gov&#x2F;csd&#x2F;assessments&#x2F;ozone&#x2F;2018&#x2F;executivesummary&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.esrl.noaa.gov&#x2F;csd&#x2F;assessments&#x2F;ozone&#x2F;2018&#x2F;executi...</a>", "by": "Gormisdomai"}, {"item_id": 21106866, "text": "Does it matter?<p>Space travel seems like it should be a priority for humanity. More so than the latest iPhone and all that other crap that produces pollution", "by": "Havoc"}, {"item_id": 21106725, "text": "Is it time to recalibrate rocket technologies with added metric of pollution. Does this mean that Project Prometheus (plopping out nukes sequentially and riding the nuke push <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;njM7xlQIjnQ?t=544\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;njM7xlQIjnQ?t=544</a>) might be back on the table?<p>To reach the moon requires \n- By chemical rocket: 1000 tons of chemical fuel for each 1 ton of payload with 1000:1 ratio roughly linear with increasing payload. Max capability today is on order of 100 tons per launch. \n- By nuclear detonations: fuel:payload closer to 3:1  with prototype design of 400 ton payload for single rocket, and later designs aiming for  100,000 ton payload&#x2F;rocket.<p>Is 30x less waste by mass better even if that waste is in part radioactive? Water waste still seems pretty good to me.<p><a href=\"https:&#x2F;&#x2F;newatlas.com&#x2F;orion-project-atom-bomb-spaceship&#x2F;49454&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;newatlas.com&#x2F;orion-project-atom-bomb-spaceship&#x2F;49454...</a>", "by": "hairytrog"}, {"item_id": 21106790, "text": "Over the last 6 years, 29 people have gone into space or about 5 per year. <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_space_travelers_by_name\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_space_travelers_by_nam...</a><p>Globally, babies are born at the rate of about 145 million per year. So at the current rate of space travel a baby&#x27;s chance of going into space would be about 1 in 30,000,000.<p>Even if space travel were increased by 3 or 4 orders of magnitude, only an insignificant percentage of people would ever travel in space. The energy requirements and expense make it a pastime for only the stupendously rich.", "by": "Merrill"}, {"item_id": 21108343, "text": null, "by": null}, {"item_id": 21106887, "text": "TL;DR: &quot;The climate impact of rockets has not really been seriously addressed as yet&quot;", "by": "sebastianconcpt"}, {"item_id": 21106675, "text": "&gt;There has been a lot of buzz recently about spaceflight companies shooting for frequent &quot;airline-like operations,&quot; but scientists, engineers and policy makers generally are not &quot;putting two and two together with respect to the emissions that are implied by that idea,&quot;<p>I wouldn&#x27;t worry about that. I saw Musk&#x27;s video[1] on using rockets as a way to supplant air-travel and the idea is even more ridiculous than his hyperloop and underground-moving-street concepts. There&#x27;s no point in mentioning it as even a possible eventuality. Rockets will never be used for intra-earth passenger travel.<p>[1]<a href=\"https:&#x2F;&#x2F;www.space.com&#x2F;38314-elon-musk-spacex-mars-rocket-earth-travel.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.space.com&#x2F;38314-elon-musk-spacex-mars-rocket-ear...</a>", "by": "macspoofing"}]