[{"item_id": 21105227, "text": "I do find this to be actually legendary. At a target rate of about one per month, he is set to produce stainless steel, rapidly reusable, 150-ton-capable Mars transports. And is doing this using currently &quot;about 5%&quot; of the resources of his own commercially built satellite launch company, grown from scratch in a decade or so and out-performing every other nations satellite launch programs - by a large margin.<p>His presentation is noticeably a little self-concious, but not so much as to obscure his enjoyment to be standing in front of the first massive shimmering yet wielded and dented together rocket ship, which is due to demonstrate lift off and landing in a month or so.", "by": "strainer"}, {"item_id": 21107604, "text": "&quot;One of the really interesting interesting things to contemplate is the total mass to orbit capability of a large reusable system where you have a significant fleet in operation. If you&#x27;ve got something like Starship where you&#x27;ve got maybe 150 tons capable to orbit and the ship can fly, is capable of say theoretically flying four times a day but you know they call it like 75 percent uptime so theoretical three times a day, three hundred sixty-five days a year. So that&#x27;s like about a thousand flights a year for the ship. The booster can do a lot more than that. This is obviously max theoretical. You&#x27;ve got, you know, 150 tons that service, 150,000 tons to orbit per year per ship. If you&#x27;ve got say ten ships you&#x27;d have [...] one and a half million tons to orbit per year. Twenty ships you&#x27;ve got three million tons to orbit per year. I think the total rest of world capacity, if you take all rockets on earth including Falcon, the total capacity to orbit I think is around two to three hundred tons currently. Total Earth capacity to orbit is about two to three hundred tons if all rockets launched at max rate. So we&#x27;re talking about something that is with a fleet of starships a thousand times more than all earth capacity combined. All other rockets combined would be 0.1% including ours.&quot;<p>How is this not massively disruptive to the entire space launch industry?", "by": "sveit"}, {"item_id": 21104669, "text": "&quot;We could see people flying next year&quot;.<p>O_O<p>This is &quot;Elon Time&quot; at its best, but worth keeping in mind how fast Starship development has actually gone. Elon Time is becoming more realistic.", "by": "mabbo"}, {"item_id": 21104430, "text": "Musk said at the start of his presentation that the magnitude of earth&#x27;s gravity is such that we are right on the cusp of rocket flight possibility. If the magnitude were a little more, rocket flight would be impossible. If it were a bit less, it would all be a lot easier.<p>Can anyone expand on that, assuming it&#x27;s the truth..", "by": "callumprentice"}, {"item_id": 21107136, "text": "A couple of takeaways for me:<p>1. oldspace and its supporters, if they have a clue, should be even more terrified than before by the scale of the vision. Even if only a percentage is achieved the disruption should be shattering<p>2. the unspoken juxtaposition between Musk on the one hand - on the face of it unpolished and light-hearted to the point of flippancy about a topic no less grand than the destiny of humanity, yet in reality visionary, fiercely determined and stunningly successful, and proceeding with at least as stated altruistic goals; and oldspace on the other - polished, solemn, pompous, claiming the sole capability and privilege to act as gatekeepers to space, yet in reality outdated, inefficient, outclassed, and acting like a resentful dog-in-the-manger in response to SpaceX. There&#x27;s something tragicomic, almost Shakespearean about it all", "by": "growlist"}, {"item_id": 21104550, "text": "The most surprising thing to me was nixing the transpiration cooling with methane and switching back to heat shielding tiles for half of it.", "by": "superkuh"}, {"item_id": 21108817, "text": "I didn&#x27;t notice this being mentioned in the webcast or in any of the follow-up articles I&#x27;ve read on the presentation: while the timelines for 6-months-to-orbit seem insane, I believe the underlying drive for an aggressive schedule here largely derives from Mars launch windows. [1]<p>We have a launch window to Mars open from July 2020 - September 2020, the tail end of which is almost exactly one year away.  Starship will have to be orbit capable well before this window, such that the flight and maneuvering characteristics are understood well enough to reasonably justify taking a crack or two at an unmanned cargo Mars mission within the 2020 window.  Musk might not have explicitly mentioned it in the presentation, but I would bet that the Starship teams are internally being driven to these targets.<p>FTA, Musk is quoted in 2017, saying SpaceX was targeting uncrewed Mars missions in 2022, but given his ambitions and depending on the progress of the Starship&#x2F;Super Heavy, I can see them actually aiming for 2020 such that any failures would still guarantee a path to making the 2022 window.<p>All of this is my own amateur speculation, would love to hear corrections or other ideas.<p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Exploration_of_Mars#Launch_windows\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Exploration_of_Mars#Launch_win...</a>", "by": "snoshy"}, {"item_id": 21108520, "text": "It looks like something from Fallout or Rocketeer ... the space nerd in me is disappointed at the &quot;look&quot; but I really really hope it works.", "by": "tibbydudeza"}, {"item_id": 21105288, "text": "Is there a transcript somewhere?", "by": "SomeOldThrow"}, {"item_id": 21106500, "text": "SpaceX always beats my expectations, unlike Tesla.", "by": "snrji"}, {"item_id": 21105255, "text": "It&#x27;s time for Elon to step down as the face of SpaceX. He ruins every presentation he&#x27;s involved in. I can&#x27;t imagine how awkward it was to be there in person and be help prisoner by a completely unprepared, rambling, lazy talk for over an hour.", "by": "stevebmark"}, {"item_id": 21104935, "text": "What a painful presentation to watch. Musk really needs to either work on his public speech or delegate them to someone comfortable.<p>His product reveals could be so much more impactful and inspiring did he not jump between points he&#x27;s trying to make and stutter his way through the entire presentation.", "by": "gouggoug"}]