[{"item_id": 21110611, "text": "Remember the 2010 Ducommun 737 NG (-600 to -900) scandal? Boeing subcontracted key structural components to them to be CNC machined, instead they were crudely hand-fabricobbled and out-of-spec, but Boeing management ordered them installed anyhow. Furthermore, when a Boeing blue-ribbon panel reported its findings, they were ignored. As a result, several aircraft fuselages have broken up on hard landings and runway overruns, killing several passengers. In the past, aircraft fuselages remained intact in similar situations. There are an unknown number of substandard airframes flying around that have the potential to spontaneously break up in heavy turbulence, accelerated fatigue damage, hard landings, and runway overruns. If the flying public and professional pilots were smart, they would avoid aircraft designed, manufactured, or overhauled within the past 20 or so years because of the pervasive, systematic deficiencies introduced by regulatory capture. Older aircraft, if maintained properly, are demonstrably safer until regulators get back on the ball to insist on depth and breadth of safe, proper engineering and manufacturing.", "by": "anon91831837"}, {"item_id": 21108387, "text": "Here is some non pay-walled content: <a href=\"https:&#x2F;&#x2F;qz.com&#x2F;1718506&#x2F;boeings-737-max-mcas-has-better-designed-military-forerunner&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;qz.com&#x2F;1718506&#x2F;boeings-737-max-mcas-has-better-desig...</a><p>The key quote from there:<p>Notably, pilots of the KC-46 are able to override the MCAS—or Maneuvering Characteristics Augmentation System—simply by pulling on the controls, the Journal reports. It quotes an Air Force procurement chief as saying, “We have better sensor data. But most importantly, when the pilot grabs the stick, the pilot is completely in control.”", "by": "heisenbit"}, {"item_id": 21109040, "text": "But presumably the pilots of both downed MAXs were pulling back as hard as possible.", "by": "tus88"}, {"item_id": 21108471, "text": "<a href=\"http:&#x2F;&#x2F;archive.is&#x2F;h5ejA\" rel=\"nofollow\">http:&#x2F;&#x2F;archive.is&#x2F;h5ejA</a>", "by": "bookofjoe"}, {"item_id": 21108475, "text": "Moderators: please add [paywalled] or [$] to paywalled content so I can ignore instead of wasting time. Thanks.", "by": "jwildeboer"}]