[{"item_id": 21111079, "text": "Family, friends, health, purpose. Even without the latest gadgets and being a millionaire, if you have the love of family and friends you can find happiness. I guarantee you won’t find happiness by reading the NYT all day and getting worked up.", "by": "seibelj"}, {"item_id": 21111194, "text": "<i>SPOILERS BELOW</i> (Love, Death and Robots)<p>There&#x27;s an episode of Love, Death and Robots called Zima Blue, where a robot that scrubs the tiles on the side of a swimming pool is progressively upgraded over many years by engineers until it becomes a fully conscious android. It then obsessively pursues the meaning of life through ever larger art projects, some reaching planetary scale. It eventually concludes it has found the meaning of life and in it&#x27;s final art project it disables all it&#x27;s higher cognitive functions and &quot;downgrades&quot; itself back to it&#x27;s original tile scrubbing form with just enough awareness left to take pleasure in the singular menial task.<p>EDIT: I just found out it was adapted from a book called Zima Blue and Other Stories by Alastair Reynolds", "by": "PinkMilkshake"}, {"item_id": 21111256, "text": "The author did not do a good job of spelling out the differences in the two types of happiness. In fact, she didn&#x27;t even address them by their proper names (hedonic and eudaimonic). Identifying the two and really digging in on their differences would probably have made for a more interesting article - and certainly a more enlightening one. Just saying &quot;people are unhappy, don&#x27;t confuse unhappy with unjoyful&quot; isn&#x27;t enough. (Spoiler alert: people think they want hedonic when what they&#x27;re really seeking is eudaimonic.)<p>We&#x27;re driven to hedonic happiness to which  the article loosely alludes just by having stuff and labels that say to be happy. While short term satisfactory it does nothing for people long term. Eudaimonic happiness is a deeper, almost stoic-like approach to happiness. It involves being a part of something that has potential of outlasting the individual. From my experience it took a while to get to this point and understanding the real differences and putting into practices the ceremonies that go with it.<p>One little trick that I learned a while back: never say &quot;I have to&quot; when you can say &quot;I get to&quot;. For example it&#x27;s not &quot;I have to help a friend move&quot; it&#x27;s &quot;I get to help a friend move&quot;. It turned from a chore to a treat - and it is a treat because I get to spend time with my friend. Yeah, it&#x27;s hot, physically exhausting, and all you get at the end of the day is pizza and beer, but at the end of the day _you get pizza and beer_ which is better than 99% of the rest of the world. It may sound kitchy (spelling?) but it works.", "by": "brodouevencode"}, {"item_id": 21111116, "text": "Anybody ever watch Steve Cutts, especially the animations he did for Moby? They are crazy depressing. I feel like happiness is exactly what Denis Leary explianed it as. It&#x27;s a brief moment, like a smoke or a beer.<p>But on to the videos:<p>[happiness]: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=e9dZQelULDk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=e9dZQelULDk</a><p>[moby are you lost]: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=VASywEuqFd8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=VASywEuqFd8</a>", "by": "Something1234"}, {"item_id": 21111167, "text": "It&#x27;s like watching children pick 3-4 random things off the internet, weave a connection between them, and then broadcast the creation to millions of people. Well done nytimes. Keep it up.", "by": "hos234"}, {"item_id": 21111337, "text": "Happiness, in the fundamental sense, is a choice. That choice can be easier or harder at times, just like it&#x27;s easier to speak your mind with a good friend then in a room full of strangers. It is however a choice, and it&#x27;s a choice you can make even when it&#x27;s really difficult.<p>Happiness shouldn&#x27;t be conflated with what the article calls &quot;joy&quot;. Joy is good and fine, but it&#x27;s a primarily external phenomenon.<p>I find happiness to be like a muscle. When you actively choose to be happy most of the time, it&#x27;s easier to be happy in difficult times. If you never practice happiness, the ability to make that choice decays and weakens.<p>The single greatest practice you can do for your own happiness (and general sanity) is to create a feedback loop. For most people, this takes the form of a journal. Electronic, physical, who cares. Jot down something every night, read the previous nights entry when you&#x27;re done.", "by": "vorpalhex"}, {"item_id": 21111149, "text": "I still like Naval Ravikant’s definition from his extraordinary guest spot on the Farnam Street podcast[1]:\n“Today, I believe that happiness is, it’s really a default state. It’s what’s there when you remove the sense that something is missing in your life. We are highly judgmental, survival, and replication machines. We are constantly walking around thinking I need this, I need that, trapped in the web of desires. Happiness is that state when nothing is missing. When nothing is missing, your mind shuts down and your mind stops running into the future or running into the past to regret something or to plan something.”<p>[1] <a href=\"https:&#x2F;&#x2F;fs.blog&#x2F;naval-ravikant&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;fs.blog&#x2F;naval-ravikant&#x2F;</a>", "by": "tpowell"}, {"item_id": 21111504, "text": "The pursuit of &quot;happiness&quot; is just about the best way to ensure you remain unhappy. I&#x27;m not sure when precisely it happened, but &quot;happiness&quot; got a lot harder to find as soon as humanity hypostatized it and made it into a psuedo-religious concept and the end all-be-all of life--seems like everyone just want&#x27;s to &quot;be happy&quot;. Unfortunately, &quot;happiness&quot; is not concrete--it&#x27;s a lazy stand-in for the goals you ought to actually be setting for yourself. The point of life is not to &quot;be happy&quot;--happiness is a pleasant side effect of the life well-lived, not its telos.<p>Pursue something concrete. Set a measurable goal. Aim for small things. Remove the term &quot;happy&quot; from your vocabulary. Just be and do, and focus on things that are small, well defined, modest and not amorphous. Cast aside your distractions. Choose an identity for yourself. Write the obituary you&#x27;d want to have. Work toward it. Fulfill your being. All of a sudden, you might feel a certain nonchalance, a certain comfortability, you might find that you can get on just fine without fretting so much. Over time, your worries might even start to dissipate.<p>Oh, and stop spending so much time consuming and start spending more time producing, crucially, <i>for yourself</i> or for your loved ones, not for an employer. When you interact with other people, use your brain, don&#x27;t turn it off. Think about them in a serious, focused way. Be present. Contemplate moments. Give good gifts. Break from patterns. Don&#x27;t be afraid of embarrassment, corniness, or sentiment. Stop following prescribed modes of interaction and existence without even consciously acceding to them.<p>&quot;Happiness&quot; itself is a big part of the problem, it&#x27;s just as problematic as every other hypostatized concept that&#x27;s ever dawned in the course of human history.", "by": "voidhorse"}, {"item_id": 21111099, "text": "Happiness is a social phenomenon and can’t be solved by individuals. You can move to your own idea of paradise but if you care about other people your happiness will depend on theirs as well.", "by": "viburnum"}, {"item_id": 21111774, "text": "Maybe it&#x27;s a question of having time to get together with others.<p>In the unending war for attention, I feel like I&#x27;ve lost; and through being out of all the social loops, also lost the chances for joy I used to have.<p>I can&#x27;t be the only one that feels like there&#x27;s just not enough time to go around, even less so than there used to be.  That it&#x27;s impossible to get together with friends to do anything on the weekend.  That the transaction cost of trying to overcome physical distance is rising.  That seemingly everyone has something else they&#x27;re investing time in.", "by": "mjevans"}, {"item_id": 21111155, "text": "I think when people say they want to be happy what they really mean is they want to find contentment. Contentment is a long-lasting feeling. Happiness is ephemeral.", "by": "undefined3840"}, {"item_id": 21111083, "text": "More and more Americans are living in larger cities than previous generations. I think lack of a connection with a local community is contributing to high stress. I moved down to the Sierra Nevada mountains from Seattle and my anxiety and stress is much lower.", "by": "devmunchies"}, {"item_id": 21111804, "text": "&quot;The best things in life are free. The second best things are very, very expensive.” - Coco Chanel", "by": "croh"}, {"item_id": 21111132, "text": "Happiness is a state of mind. I can&#x27;t tell you how to get there but I do know that you can&#x27;t expect things and people to make you happy. It&#x27;s all around us but only you know what your state of happiness is. You have to find it for yourself.", "by": "WheelsAtLarge"}, {"item_id": 21111608, "text": "It&#x27;s great when a question so simple is asked that you can answer it and then never think about it again.<p>No.", "by": "anm89"}, {"item_id": 21111161, "text": "Fwiw,<p><a href=\"https:&#x2F;&#x2F;www.lesswrong.com&#x2F;posts&#x2F;ZbgCx2ntD5eu8Cno9&#x2F;how-to-be-happy\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lesswrong.com&#x2F;posts&#x2F;ZbgCx2ntD5eu8Cno9&#x2F;how-to-be-...</a>", "by": "pitt1980"}, {"item_id": 21111737, "text": "Life isn&#x27;t about happiness is about misery....", "by": "hyfgfh"}, {"item_id": 21111729, "text": "I know I am!", "by": "paulcole"}, {"item_id": 21111067, "text": "What does being happy even mean? What does it get you as a goal? I’m not sure it’s even worth chasing.<p>My favorite view on “happiness” comes from The Oatmeal, How to be perfectly unhappy: <a href=\"https:&#x2F;&#x2F;www.theoatmeal.com&#x2F;comics&#x2F;unhappy\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theoatmeal.com&#x2F;comics&#x2F;unhappy</a><p>It boils down to this: stop chasing happiness or joy or whatever marketing departments have decided you need and their product can provide.<p>Focus on meaning.", "by": "Swizec"}, {"item_id": 21111135, "text": "Happiness comes from within. Our social medias are stifling that. Get off them (or at least know how to limit and ignore)!", "by": "cdnuzzo"}, {"item_id": 21111061, "text": "law of headlines", "by": "jimmaswell"}]