[{"item_id": 21112001, "text": "I don&#x27;t understand what&#x27;s supposed to be especially intuitive about this? It&#x27;s an alphabetic list of fallacies - how do I &quot;lookup&quot; one if not by just scrolling down the list?<p>I have no idea what the symbols below the search bar mean and was surprised that the &quot;i&quot; button doesn&#x27;t give me more information about the site or showed help but instead just apparently switched between descriptions and synonyms.", "by": "pragmatick"}, {"item_id": 21111857, "text": "Looks great. I think everyone should have an understanding of how arguments can be fallacious.<p>But one thing I noticed - going down the fallacy rabbit hole - is that you can find fallacies in almost any written opinion...<p>I think this is because fallacies are somewhat subjective and some fallacies can even oppose each other, so there&#x27;s no way to avoid them...<p>But that&#x27;s just my (fallacy-riddled) opinion", "by": "gitgud"}, {"item_id": 21111877, "text": "I really loved the site, great work. My only feedback is to make the pagination more apparent...I at first thought it was a work in progress and you only had the first 20 until I searched around and noticed the pagination boxes... I think clearer pagination or pagination that beckons you to click will reduce your bounce rate", "by": "adim86"}, {"item_id": 21111833, "text": "I strongly suggest using better sources for this. You should avoid using Wikipedia when things like the SEP[1] and IEP[2] are available. Also, &quot;probabilistic&quot; fallacies are <i>not</i> formal fallacies. E.g. something like the &quot;gambler&#x27;s fallacy&quot; is not a de facto formal logical fallacy.<p>Further, the &quot;Naturalistic Fallacy&quot; isn&#x27;t what you think it is. There&#x27;s a difference between &quot;argument from nature&quot; or &quot;the appeal to nature&quot; (which is what you think it is), and G.E. Moore&#x27;s Naturalistic Fallacy[3]. This is a pretty embarrassing mistake, especially if you&#x27;d like to be treated like an authority on the subject.<p>[1] <a href=\"https:&#x2F;&#x2F;plato.stanford.edu&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;plato.stanford.edu&#x2F;</a><p>[2] <a href=\"https:&#x2F;&#x2F;www.iep.utm.edu&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.iep.utm.edu&#x2F;</a><p>[3] <a href=\"https:&#x2F;&#x2F;plato.stanford.edu&#x2F;entries&#x2F;moral-non-naturalism&#x2F;#NatFal\" rel=\"nofollow\">https:&#x2F;&#x2F;plato.stanford.edu&#x2F;entries&#x2F;moral-non-naturalism&#x2F;#Nat...</a>", "by": "dvt"}, {"item_id": 21111069, "text": "Motivation: We live in a digital world full of (m&#x2F;d)isinformation. On one end we should fight to eradicate the source, but on the other end we should exercise strong critical thinking skills so we don’t fall victim to false narratives. I created this tool to help people easily look up 100 common logical fallacies.", "by": "andrewscwei"}, {"item_id": 21111588, "text": "A random button would be a nice addition.", "by": "fbrncci"}, {"item_id": 21111542, "text": "It&#x27;s really pretty and responsive. Great work!", "by": "GrifMD"}, {"item_id": 21111269, "text": "Nice work. Added to Favourites.", "by": "z5h"}, {"item_id": 21110502, "text": "Finally, a A-Z list of logical fallacies!", "by": "iamuser"}, {"item_id": 21110933, "text": "Thank you for doing this!", "by": "prashanth1k"}, {"item_id": 21112043, "text": "You might appreciate this site: <a href=\"https:&#x2F;&#x2F;yourlogicalfallacyis.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;yourlogicalfallacyis.com&#x2F;</a>", "by": "RichardHeart"}]